//инклуды
#include <a_samp>
#include <a_mysql>
#include <streamer>
#include <sscanf>
#include <zcmd>
#include <foreach>
#include <yom_buttons>


//макросы цвета
#define server 					0xffffffff
#define info 					0xffffffff
#define white 					0xffffffff
#define error                   0xCECFCEff
#define accept                  0x00b899ff
#define iAdm                    0xff9900ff //Действие администратора цвет


#define A                       "{00b899}" //Использование зеленого цвета (успешного выполнения)"A"
#define W 						"{ffffff}" //Использование белого цвета "W"
#define S 						"{ffffff}" //Использование цвета для заголовков и важных сообщений "S"
#define I  						"{76dce3}" //Использование цвета для информации "I"
#define E  						"{CECFCE}" //Использование цвета для ошибок "E"
#define COLOR_GREEN             0x63BD4EFF
//Макросы

#define SERVER "Strant Role Play"
#define f(%1, format(%1,sizeof(%1),
forward p_kick(playerid);
public p_kick(playerid) Kick(playerid);
#define Kick(%0)                        SetTimerEx("p_kick",300,false,"i",%0)
#define RandomEx(%1,%2) (random(%2-%1)+%1)


//ЦЕНЫ/УРОВНИ И ПРОЧИЕ НАСТРОЙКИ

#define level_bus 		1	//уровень устройства водителем автобуса
#define level_taxi 		2	//уровень устройства водителем такси
#define level_delivery  3	//уровень устройства на работу развозчика
#define rent_bus        200 //стоимость аренды автобуса
#define rent_taxi       200 //стоимость аренды такси
#define fine       		500 //штраф за недоставленный груз на Развозчике продуктов/топлива

//данные для подключения к базе
#define mysql_host 	"localhost" // ip хостинга
#define mysql_user 	"root" // да что тут объяснять, если не знаете - закрывайте мод.
#define mysql_db 	"new"
#define mysql_pass 	""
//______________________________
new MySQL:con_bd; //mysql соединение

//__для аккаунта
enum playerinfo
{
	ID, name[MAX_PLAYER_NAME],password[30], mail[64], IP[20],
    reg_data[16], sex, skin,
    admin,cash,level, exp,lic,veh_id,key,leader,member,rang,zvezd,
	fskin,keyh,material,patr,drugs,bank,spawn,job,
	phone,p_number,Float:health,wanted,jail, jail_time,
    ban,mute,warn
};
new p_info[MAX_PLAYERS][playerinfo];
//______________________________________

//__банк
new bank_pick[4];
new Float:gAtmPoint[5][4] = {//Добавляем банкоматы объекты банкоматов, естественно и проверка для вызова функции Коорд: x,y,z fRotZ
{1468.82776, -1711.60779, 13.89890,180.00000000},
{1712.74436, -1606.86633, 13.41350,180.00000000},
{1849.25635, -1741.99353, 13.30390,90.00000000},
{-79.02830, -1172.33557, 1.76820,-23.00},
{-2626.88306, 553.30353, 14.33890,-88.00}
};

new metro_pick_vhod[2];


//__выбор скина

//
new Text:skinTextDraw[MAX_PLAYERS][3];
new skinMan[6][1] ={
	{78},//--муж. скин
	{79},//--муж. скин
	{134},//--муж. скин
	{137},//--муж. скин
	{226},//жен. скин
	{216}//жен. скин
};
//__________________,

//бизнесы
enum bInfo
{
	_b_id,
	_owned,
	_owner[MAX_PLAYER_NAME],
	_name[64],
	_int,
	_world,
	_price,
	_tip,
	Float:b_enter[3],
	Float:b_exit[3],
	Float:b_menu[3],
    _pic,
	Text3D:_picV,
	Text3D:_picD,
    Text3D:_text,
    _cena1,
    _prod,
    _bank,
    _lock,
    _colvo,
    _zakaz,
	_status
};

new b_info[55][bInfo];
new totalbiz;

//---------------------------Актёры----------------------------
new spawnactor;


new Text:skin_price[MAX_PLAYERS][5];// pawno info
new skinBuyMan[7][2] ={//PAwno info
{67,1400},
{72,1314},
{96,1000},
{97,5500},
{144,9400},
{146,53000},
{156,43000}
};
new skinBuyMale[5][2] ={//pawno info
{12,4232},
{93,1000},
{192,341},
{233,2000},
{216,76000}
};

//Дома
new totalhouses;
enum house_info
{
	h_id,
	Float:h_enter[3],
	Float:h_exit[3],
	Float:c_pos[4],
	h_rent,
	h_owner[MAX_PLAYER_NAME],
	h_value,
	h_int,
	h_lock,
	h_owned,
	h_squar,
	Text3D:h_text,
	h_icon,
	h_pickup
};
new h_info[645][house_info];
//__Автомобили

//Личное авто:
new Text3D:player_owner[MAX_VEHICLES],
    CAR;
enum vInfo
{
 	v_owner[32],
	Float:v_pos[4],
	v_price,
	v_lock,
	v_model,
	v_color[2],
	v_if_buy,
 	v_tun[15]
};
new veh_info[MAX_VEHICLES][vInfo];
	
///


new salonCar[2];
new PlayerText:speedTD[MAX_PLAYERS][6];
new fuel_car[MAX_VEHICLES],
	engine_car[MAX_VEHICLES];
new
	engine,lights,alarm,doors,bonnet,boot,objective;
new VehicleNames[212][32] = {
"Landstalker", "Bravura", "Buffalo", "Linerunner", "Perrenial", "Sentinel", "Dumper", "Firetruck", "Trashmaster", "Stretch", "Manana",
"Infernus", "Voodoo", "Pony", "Mule", "Cheetah", "Ambulance", "Leviathan", "Moonbeam", "Esperanto", "Taxi", "Washington", "Bobcat",
"Whoopee", "BF Injection", "Hunter", "Premier", "Enforcer", "Securicar", "Banshee", "Predator", "Bus", "Rhino", "Barracks", "Hotknife",
"Trailer 1", "Previon", "Coach", "Cabbie", "Stallion", "Rumpo", "RC Bandit", "Romero", "Packer", "Monster", "Admiral", "Squalo",
"Seasparrow", "Pizzaboy", "Tram", "Trailer 2", "Turismo", "Speeder", "Reefer", "Tropic", "Flatbed", "Yankee", "Caddy", "Solair",
"Berkley's RC Van", "Skimmer", "PCJ-600", "Faggio", "Freeway", "RC Baron", "RC Raider", "Glendale", "Oceanic", "Sanchez", "Sparrow",
"Patriot", "Quad", "Coastguard", "Dinghy", "Hermes", "Sabre", "Rustler", "ZR-350", "Walton", "Regina", "Comet", "BMX", "Burrito",
"Camper", "Marquis", "Baggage", "Dozer", "Maverick", "News Chopper", "Rancher", "FBI Rancher", "Virgo", "Greenwood", "Jetmax", "Hotring",
"Sandking", "Blista Compact", "Police Maverick", "Boxvillde", "Benson", "Mesa", "RC Goblin", "Hotring Racer A", "Hotring Racer B",
"Bloodring Banger", "Rancher", "Super GT", "Elegant", "Journey", "Bike", "Mountain Bike", "Beagle", "Cropduster", "Stunt", "Tanker",
"Roadtrain", "Nebula", "Majestic", "Buccaneer", "Shamal", "Hydra", "FCR-900", "NRG-500", "HPV1000", "Cement Truck", "Tow Truck", "Fortune",
"Cadrona", "FBI Truck", "Willard", "Forklift", "Tractor", "Combine", "Feltzer", "Remington", "Slamvan", "Blade", "Freight", "Streak",
"Vortex", "Vincent", "Bullet", "Clover", "Sadler", "Firetruck LA", "Hustler", "Intruder", "Primo", "Cargobob", "Tampa", "Sunrise", "Merit",
"Utility", "Nevada", "Yosemite", "Windsor", "Monster A", "Monster B", "Uranus", "Jester", "Sultan", "Stratum", "Elegy", "Raindance",
"RC Tiger", "Flash", "Tahoma", "Savanna", "Bandito", "Freight Flat", "Streak Carriage", "Kart", "Mower", "Dune", "Sweeper", "Broadway",
"Tornado", "AT-400", "DFT-30", "Huntley", "Stafford", "BF-400", "News Van", "Tug", "Trailer 3", "Emperor", "Wayfarer", "Euros", "Hotdog",
"Club", "Freight Carriage", "Trailer 4", "Andromeda", "Dodo", "RC Cam", "Launch", "Police Car", "Police Car",
"Police Car", "Police Ranger", "Picador", "S.W.A.T", "Alpha", "Phoenix", "Glendale", "Sadler", "Luggage Trailer A",
"Luggage Trailer B", "Stairs", "Boxville", "Tiller", "Utility Trailer" };
//_____________________________

//__автошкола
new pick_as[3];
new dSchoolCar[8];
new Text3D:dSchool3D[8];
enum
{
	CHECKPOINT_1, CHECKPOINT_2, CHECKPOINT_3, CHECKPOINT_4, CHECKPOINT_5, CHECKPOINT_6, CHECKPOINT_7, CHECKPOINT_8,
	CHECKPOINT_9, CHECKPOINT_10
}


//Организации
//_______________мэрия
new meria[2];//


//Фракции.




//Армия
new bool:onpressb[50]=true;
new knopka[15],
	barrier,
	gate_z51[4],
	_stock[2],
	army_car[2];
	
new army_material,
	army_patr,
	Text3D:boats3dtext[MAX_VEHICLES],
	boats@pripas[MAX_VEHICLES],
	Text3D:sv_3d,
	Text3D:avia_3d,
	avia_boe, //данная переменная не сохр./загр. она увеличивает ящики на авианосце,с момента загрузки сервера, каждую минуту +2 (якобы приплывают)
	cp_sv,
 	non_pick_boe;
//police

new lvpd[5],
	lspd[6],
	sfpd[5];
new	lspd_car[2],
	lvpd_car[2],
	sfpd_car[2];

new
	pd_actor [4];
//FBI
new fbi[2],
	fbi_car[2];

//Радиоцентр

new smi_pickup[2],
	smi_car[2],
	ADVERTISE = INVALID_PLAYER_ID,
	msg_adv[144];


//Мафии

new rm_car[2],
	lcn_car[2],
	yakuza_car[2];
new rm_pickup[3],
	lcn_pickup[3],
	yakuza_pickup[3];
	
	
new store_mafia[3][2];
new Text3D:store_m3D[3];

//Банды

new s_band[5][3],
    Text3D:store_b3D[5];
new ballas_car[2],grove_car[2],rifa_car[2],vagos_car[2], el_corona_car[2];
new ballas_pickup[3];
new grove_pickup[3];
new rifa_pickup[3];
new vagos_pickup[3];
new el_corona_pickup[3];



new TOTALGZ;
new on_zone[46][20];
new ZoneOnBattle[46];
new allowedfactions[] = {10, 11, 12, 13, 14};
new GZSafeTime[46];
enum GzoneInfo
{
	gID,
	Float:gCoords[4],
	gang_terr,
	gang_attack
}
new gangzone_Info[46][GzoneInfo];
new GangZone[46];

new FrakCD;
new PlayerText:GangWar[MAX_PLAYERS];

new bool:get_capture;
new bool:drawcapt[MAX_PLAYERS];

enum captInfo
{
	capture,
	score,
	captureid,
	gangnumber
}
new capture_info[46][captInfo];





///

enum pos_frac
{
	Float: f_x,
	Float: f_y,
	Float: f_z,
	Float: f_a,
	in,
	vw
};
new Float:spawnFrac[14][pos_frac]=//x,y,z,fA, int,vw
{
	{231.4046,74.1227,1005.0391,267.2994,6,1},//lspd
	{224.4001,120.6705,999.0969,89.2981,10,2},//sfpd
	{250.5582,190.7323,1008.1719,269.8524,3,3},//lvpd
	{250.5582,190.7323,1008.1719,269.8524,3,1},//fbi
	{245.6846,1858.8508,14.0840,89.9901,0,0},//Army4
	{1728.2225,-1667.5541,22.6094, 46.8658,18,1},//радиоцентр
	{1271.1755,-793.8644,1084.0078,356.4571, 5, 1},//Рус Маф
	{1271.1755,-793.8644,1084.0078,356.4571, 5, 2},//ЛКН
	{1271.1755,-793.8644,1084.0078,356.4571, 5, 3},//Якудза
	{2450.0586,-1700.1387,1013.5078,272.4571, 2, 6},//Grove
	{-64.0381,1364.3766,1080.2185,92.1, 6, 5},//Ballas
	{2810.0850,-1161.9696,1029.1719,92.1, 8, 8},//Rifa
	{-50.1504,1401.4207,1084.4370,359.0, 8, 6},//el_corona
	{301.3632,302.1126,1003.5391,359.1, 4, 7}//Vagos
};
//_______________работы,

//доставщики
new carDelivery[2];
new carGasTanker[2];
new dlv_info[MAX_VEHICLES];
new GetCarDelivery[MAX_PLAYERS];

//завод
new pickFactory[3];
new Text3D:factory_3D;
new Text3D: factory_int_3D;
new zmet, zprod ,zfuel;
new useProd[6];
new obje[MAX_PLAYERS];

new DBizitem[MAX_PLAYERS][22];
new loadCar[MAX_VEHICLES];

//РАВТОБУС
new job_invite;//чекпоинт работы
new BUS[2];//автобусы
new GetPlayerRentBus[MAX_PLAYERS];//
new ExitCount[MAX_PLAYERS];
new bus_info[MAX_VEHICLES];//занят автобус или нет
new Text3D:INFO_VEH[MAX_VEHICLES];//3d text bus

new Float:ls_sf[21][3] = {
{1172.0496,-1755.2334,13.5307},//остановка 0
{1172.1217,-1834.5684,13.533},
{1071.1046,-1849.2130,13.5282},
{863.9833,-1767.9774,13.5161},
{276.7041,-1683.7516,8.1068},
{88.0130,-1526.4718,5.4290},
{-137.8220,-1255.8290,2.8278},
{-110.9876,-1169.1564,2.7931},//остановка 7
{-98.7435,-1014.8605,24.2880},
{-356.7112,-845.2168,47.4031},
{-621.1583,-981.7831,65.7661},
{-880.2375,-1092.3087,96.4349},
{-1226.0024,-771.5641,64.0372},
{-1491.0153,-816.4308,64.6019},
{-1758.6271,-607.4615,16.3931},
{-2057.6030,-569.3365,29.6874},
{-2219.2126,-423.0219,50.9932},
{-2251.9314,-114.8644,35.3092},
{-2026.7408,-73.1891,35.3041},//остановка
{-2003.2209,-8.7082,34.5920},
{-1988.5082,159.6431,27.6724} // финиш
};

//РТАКСИСТ
new TAXI[2];
new GetPlayerRentTaxi[MAX_PLAYERS];//
new taxi_info[MAX_VEHICLES];//занят автобус или нет

//_______________прочее вспомогательные функции
enum SAZONE_MAIN
{
    SAZONE_NAME[128],
         Float:SAZONE_AREA[6]
};
new gSAZonesCity[][SAZONE_MAIN] = {
        {"Los Santos",                   {44.60, -2892.90, -242.90, 2997.00, -768.00, 900.00}},
        {"Las Venturas",                 {869.40, 596.30, -242.90, 2997.00, 2993.80, 900.00}},
        {"Bone County",                  {-480.50, 596.30, -242.90, 869.40, 2993.80, 900.00}},
        {"Tierra Robada",                {-2997.40, 1659.60, -242.90, -480.50, 2993.80, 900.00}},
        {"Tierra Robada",                {-1213.90, 596.30, -242.90, -480.50, 1659.60, 900.00}},
        {"San Fierro",                   {-2997.40, -1115.50, -242.90, -1213.90, 1659.60, 900.00}},
        {"Red County",                   {-1213.90, -768.00, -242.90, 2997.00, 596.30, 900.00}},
        {"Flint County",                 {-1213.90, -2892.90, -242.90, 44.60, -768.00, 900.00}},
        {"Whetstone",                    {-2997.40, -2892.90, -242.90, -1213.90, -1115.50, 900.00}}
};
new gSAZones[][SAZONE_MAIN] = {
        //      ????????                ( Xmin, Ymin, Zmin, Xmax, Ymax, Zmax)
        {"The Big Ear",                  {-410.00, 1403.30, -3.00, -137.90, 1681.20, 200.00}},
        {"Aldea Malvada",                {-1372.10, 2498.50, 0.00, -1277.50, 2615.30, 200.00}},
        {"Angel Pine",                   {-2324.90, -2584.20, -6.10, -1964.20, -2212.10, 200.00}},
        {"Arco del Oeste",               {-901.10, 2221.80, 0.00, -592.00, 2571.90, 200.00}},
        {"Avispa Country Club",          {-2646.40, -355.40, 0.00, -2270.00, -222.50, 200.00}},
        {"Avispa Country Club",          {-2831.80, -430.20, -6.10, -2646.40, -222.50, 200.00}},
        {"Avispa Country Club",          {-2361.50, -417.10, 0.00, -2270.00, -355.40, 200.00}},
        {"Avispa Country Club",          {-2667.80, -302.10, -28.80, -2646.40, -262.30, 71.10}},
        {"Avispa Country Club",          {-2470.00, -355.40, 0.00, -2270.00, -318.40, 46.10}},
        {"Avispa Country Club",          {-2550.00, -355.40, 0.00, -2470.00, -318.40, 39.70}},
        {"Back o Beyond",                {-1166.90, -2641.10, 0.00, -321.70, -1856.00, 200.00}},
        {"Battery Point",                {-2741.00, 1268.40, -4.50, -2533.00, 1490.40, 200.00}},
        {"Bayside",                      {-2741.00, 2175.10, 0.00, -2353.10, 2722.70, 200.00}},
        {"Bayside Marina",               {-2353.10, 2275.70, 0.00, -2153.10, 2475.70, 200.00}},
        {"Beacon Hill",                  {-399.60, -1075.50, -1.40, -319.00, -977.50, 198.50}},
        {"Blackfield",                   {964.30, 1203.20, -89.00, 1197.30, 1403.20, 110.90}},
        {"Blackfield",                   {964.30, 1403.20, -89.00, 1197.30, 1726.20, 110.90}},
        {"Blackfield Chapel",            {1375.60, 596.30, -89.00, 1558.00, 823.20, 110.90}},
        {"Blackfield Chapel",            {1325.60, 596.30, -89.00, 1375.60, 795.00, 110.90}},
        {"Blackfield Intersection",      {1197.30, 1044.60, -89.00, 1277.00, 1163.30, 110.90}},
        {"Blackfield Intersection",      {1166.50, 795.00, -89.00, 1375.60, 1044.60, 110.90}},
        {"Blackfield Intersection",      {1277.00, 1044.60, -89.00, 1315.30, 1087.60, 110.90}},
        {"Blackfield Intersection",      {1375.60, 823.20, -89.00, 1457.30, 919.40, 110.90}},
        {"Blueberry",                    {104.50, -220.10, 2.30, 349.60, 152.20, 200.00}},
        {"Blueberry",                    {19.60, -404.10, 3.80, 349.60, -220.10, 200.00}},
        {"Blueberry Acres",              {-319.60, -220.10, 0.00, 104.50, 293.30, 200.00}},
        {"Caligula's Palace",            {2087.30, 1543.20, -89.00, 2437.30, 1703.20, 110.90}},
        {"Caligula's Palace",            {2137.40, 1703.20, -89.00, 2437.30, 1783.20, 110.90}},
        {"Calton Heights",               {-2274.10, 744.10, -6.10, -1982.30, 1358.90, 200.00}},
        {"Chinatown",                    {-2274.10, 578.30, -7.60, -2078.60, 744.10, 200.00}},
        {"City Hall",                    {-2867.80, 277.40, -9.10, -2593.40, 458.40, 200.00}},
        {"Come-A-Lot",                   {2087.30, 943.20, -89.00, 2623.10, 1203.20, 110.90}},
        {"Commerce",                     {1323.90, -1842.20, -89.00, 1701.90, -1722.20, 110.90}},
        {"Commerce",                     {1323.90, -1722.20, -89.00, 1440.90, -1577.50, 110.90}},
        {"Commerce",                     {1370.80, -1577.50, -89.00, 1463.90, -1384.90, 110.90}},
        {"Commerce",                     {1463.90, -1577.50, -89.00, 1667.90, -1430.80, 110.90}},
        {"Commerce",                     {1583.50, -1722.20, -89.00, 1758.90, -1577.50, 110.90}},
        {"Commerce",                     {1667.90, -1577.50, -89.00, 1812.60, -1430.80, 110.90}},
        {"Conference Center",            {1046.10, -1804.20, -89.00, 1323.90, -1722.20, 110.90}},
        {"Conference Center",            {1073.20, -1842.20, -89.00, 1323.90, -1804.20, 110.90}},
        {"Cranberry Station",            {-2007.80, 56.30, 0.00, -1922.00, 224.70, 100.00}},
        {"Creek",                        {2749.90, 1937.20, -89.00, 2921.60, 2669.70, 110.90}},
        {"Dillimore",                    {580.70, -674.80, -9.50, 861.00, -404.70, 200.00}},
        {"Doherty",                      {-2270.00, -324.10, -0.00, -1794.90, -222.50, 200.00}},
        {"Doherty",                      {-2173.00, -222.50, -0.00, -1794.90, 265.20, 200.00}},
        {"Downtown",                     {-1982.30, 744.10, -6.10, -1871.70, 1274.20, 200.00}},
        {"Downtown",                     {-1871.70, 1176.40, -4.50, -1620.30, 1274.20, 200.00}},
        {"Downtown",                     {-1700.00, 744.20, -6.10, -1580.00, 1176.50, 200.00}},
        {"Downtown",                     {-1580.00, 744.20, -6.10, -1499.80, 1025.90, 200.00}},
        {"Downtown",                     {-2078.60, 578.30, -7.60, -1499.80, 744.20, 200.00}},
        {"Downtown",                     {-1993.20, 265.20, -9.10, -1794.90, 578.30, 200.00}},
        {"Downtown Los Santos",          {1463.90, -1430.80, -89.00, 1724.70, -1290.80, 110.90}},
        {"Downtown Los Santos",          {1724.70, -1430.80, -89.00, 1812.60, -1250.90, 110.90}},
        {"Downtown Los Santos",          {1463.90, -1290.80, -89.00, 1724.70, -1150.80, 110.90}},
        {"Downtown Los Santos",          {1370.80, -1384.90, -89.00, 1463.90, -1170.80, 110.90}},
        {"Downtown Los Santos",          {1724.70, -1250.90, -89.00, 1812.60, -1150.80, 110.90}},
        {"Downtown Los Santos",          {1370.80, -1170.80, -89.00, 1463.90, -1130.80, 110.90}},
        {"Downtown Los Santos",          {1378.30, -1130.80, -89.00, 1463.90, -1026.30, 110.90}},
        {"Downtown Los Santos",          {1391.00, -1026.30, -89.00, 1463.90, -926.90, 110.90}},
        {"Downtown Los Santos",          {1507.50, -1385.20, 110.90, 1582.50, -1325.30, 335.90}},
        {"East Beach",                   {2632.80, -1852.80, -89.00, 2959.30, -1668.10, 110.90}},
        {"East Beach",                   {2632.80, -1668.10, -89.00, 2747.70, -1393.40, 110.90}},
        {"East Beach",                   {2747.70, -1668.10, -89.00, 2959.30, -1498.60, 110.90}},
        {"East Beach",                   {2747.70, -1498.60, -89.00, 2959.30, -1120.00, 110.90}},
        {"East Los Santos",              {2421.00, -1628.50, -89.00, 2632.80, -1454.30, 110.90}},
        {"East Los Santos",              {2222.50, -1628.50, -89.00, 2421.00, -1494.00, 110.90}},
        {"East Los Santos",              {2266.20, -1494.00, -89.00, 2381.60, -1372.00, 110.90}},
        {"East Los Santos",              {2381.60, -1494.00, -89.00, 2421.00, -1454.30, 110.90}},
        {"East Los Santos",              {2281.40, -1372.00, -89.00, 2381.60, -1135.00, 110.90}},
        {"East Los Santos",              {2381.60, -1454.30, -89.00, 2462.10, -1135.00, 110.90}},
        {"East Los Santos",              {2462.10, -1454.30, -89.00, 2581.70, -1135.00, 110.90}},
        {"Easter Basin",                 {-1794.90, 249.90, -9.10, -1242.90, 578.30, 200.00}},
        {"Easter Basin",                 {-1794.90, -50.00, -0.00, -1499.80, 249.90, 200.00}},
        {"Easter Bay Airport",           {-1499.80, -50.00, -0.00, -1242.90, 249.90, 200.00}},
        {"Easter Bay Airport",           {-1794.90, -730.10, -3.00, -1213.90, -50.00, 200.00}},
        {"Easter Bay Airport",           {-1213.90, -730.10, 0.00, -1132.80, -50.00, 200.00}},
        {"Easter Bay Airport",           {-1242.90, -50.00, 0.00, -1213.90, 578.30, 200.00}},
        {"Easter Bay Airport",           {-1213.90, -50.00, -4.50, -947.90, 578.30, 200.00}},
        {"Easter Bay Airport",           {-1315.40, -405.30, 15.40, -1264.40, -209.50, 25.40}},
        {"Easter Bay Airport",           {-1354.30, -287.30, 15.40, -1315.40, -209.50, 25.40}},
        {"Easter Bay Airport",           {-1490.30, -209.50, 15.40, -1264.40, -148.30, 25.40}},
        {"Easter Bay Chemicals",         {-1132.80, -768.00, 0.00, -956.40, -578.10, 200.00}},
        {"Easter Bay Chemicals",         {-1132.80, -787.30, 0.00, -956.40, -768.00, 200.00}},
        {"El Castillo del Diablo",       {-464.50, 2217.60, 0.00, -208.50, 2580.30, 200.00}},
        {"El Castillo del Diablo",       {-208.50, 2123.00, -7.60, 114.00, 2337.10, 200.00}},
        {"El Castillo del Diablo",       {-208.50, 2337.10, 0.00, 8.40, 2487.10, 200.00}},
        {"El Corona",                    {1812.60, -2179.20, -89.00, 1970.60, -1852.80, 110.90}},
        {"El Corona",                    {1692.60, -2179.20, -89.00, 1812.60, -1842.20, 110.90}},
        {"El Quebrados",                 {-1645.20, 2498.50, 0.00, -1372.10, 2777.80, 200.00}},
        {"Esplanade East",               {-1620.30, 1176.50, -4.50, -1580.00, 1274.20, 200.00}},
        {"Esplanade East",               {-1580.00, 1025.90, -6.10, -1499.80, 1274.20, 200.00}},
        {"Esplanade East",               {-1499.80, 578.30, -79.60, -1339.80, 1274.20, 20.30}},
        {"Esplanade North",              {-2533.00, 1358.90, -4.50, -1996.60, 1501.20, 200.00}},
        {"Esplanade North",              {-1996.60, 1358.90, -4.50, -1524.20, 1592.50, 200.00}},
        {"Esplanade North",              {-1982.30, 1274.20, -4.50, -1524.20, 1358.90, 200.00}},
        {"Fallen Tree",                  {-792.20, -698.50, -5.30, -452.40, -380.00, 200.00}},
        {"Fallow Bridge",                {434.30, 366.50, 0.00, 603.00, 555.60, 200.00}},
        {"Fern Ridge",                   {508.10, -139.20, 0.00, 1306.60, 119.50, 200.00}},
        {"Financial",                    {-1871.70, 744.10, -6.10, -1701.30, 1176.40, 300.00}},
        {"Fisher's Lagoon",              {1916.90, -233.30, -100.00, 2131.70, 13.80, 200.00}},
        {"Flint Intersection",           {-187.70, -1596.70, -89.00, 17.00, -1276.60, 110.90}},
        {"Flint Range",                  {-594.10, -1648.50, 0.00, -187.70, -1276.60, 200.00}},
        {"Fort Carson",                  {-376.20, 826.30, -3.00, 123.70, 1220.40, 200.00}},
        {"Foster Valley",                {-2270.00, -430.20, -0.00, -2178.60, -324.10, 200.00}},
        {"Foster Valley",                {-2178.60, -599.80, -0.00, -1794.90, -324.10, 200.00}},
        {"Foster Valley",                {-2178.60, -1115.50, 0.00, -1794.90, -599.80, 200.00}},
        {"Foster Valley",                {-2178.60, -1250.90, 0.00, -1794.90, -1115.50, 200.00}},
        {"Frederick Bridge",             {2759.20, 296.50, 0.00, 2774.20, 594.70, 200.00}},
        {"Gant Bridge",                  {-2741.40, 1659.60, -6.10, -2616.40, 2175.10, 200.00}},
        {"Gant Bridge",                  {-2741.00, 1490.40, -6.10, -2616.40, 1659.60, 200.00}},
        {"Ganton",                       {2222.50, -1852.80, -89.00, 2632.80, -1722.30, 110.90}},
        {"Ganton",                       {2222.50, -1722.30, -89.00, 2632.80, -1628.50, 110.90}},
        {"Garcia",                       {-2411.20, -222.50, -0.00, -2173.00, 265.20, 200.00}},
        {"Garcia",                       {-2395.10, -222.50, -5.30, -2354.00, -204.70, 200.00}},
        {"Garver Bridge",                {-1339.80, 828.10, -89.00, -1213.90, 1057.00, 110.90}},
        {"Garver Bridge",                {-1213.90, 950.00, -89.00, -1087.90, 1178.90, 110.90}},
        {"Garver Bridge",                {-1499.80, 696.40, -179.60, -1339.80, 925.30, 20.30}},
        {"Glen Park",                    {1812.60, -1449.60, -89.00, 1996.90, -1350.70, 110.90}},
        {"Glen Park",                    {1812.60, -1100.80, -89.00, 1994.30, -973.30, 110.90}},
        {"Glen Park",                    {1812.60, -1350.70, -89.00, 2056.80, -1100.80, 110.90}},
        {"Green Palms",                  {176.50, 1305.40, -3.00, 338.60, 1520.70, 200.00}},
        {"Greenglass College",           {964.30, 1044.60, -89.00, 1197.30, 1203.20, 110.90}},
        {"Greenglass College",           {964.30, 930.80, -89.00, 1166.50, 1044.60, 110.90}},
        {"Hampton Barns",                {603.00, 264.30, 0.00, 761.90, 366.50, 200.00}},
        {"Hankypanky Point",             {2576.90, 62.10, 0.00, 2759.20, 385.50, 200.00}},
        {"Harry Gold Parkway",           {1777.30, 863.20, -89.00, 1817.30, 2342.80, 110.90}},
        {"Hashbury",                     {-2593.40, -222.50, -0.00, -2411.20, 54.70, 200.00}},
        {"Hilltop Farm",                 {967.30, -450.30, -3.00, 1176.70, -217.90, 200.00}},
        {"Hunter Quarry",                {337.20, 710.80, -115.20, 860.50, 1031.70, 203.70}},
        {"Idlewood",                     {1812.60, -1852.80, -89.00, 1971.60, -1742.30, 110.90}},
        {"Idlewood",                     {1812.60, -1742.30, -89.00, 1951.60, -1602.30, 110.90}},
        {"Idlewood",                     {1951.60, -1742.30, -89.00, 2124.60, -1602.30, 110.90}},
        {"Idlewood",                     {1812.60, -1602.30, -89.00, 2124.60, -1449.60, 110.90}},
        {"Idlewood",                     {2124.60, -1742.30, -89.00, 2222.50, -1494.00, 110.90}},
        {"Idlewood",                     {1971.60, -1852.80, -89.00, 2222.50, -1742.30, 110.90}},
        {"Jefferson",                    {1996.90, -1449.60, -89.00, 2056.80, -1350.70, 110.90}},
        {"Jefferson",                    {2124.60, -1494.00, -89.00, 2266.20, -1449.60, 110.90}},
        {"Jefferson",                    {2056.80, -1372.00, -89.00, 2281.40, -1210.70, 110.90}},
        {"Jefferson",                    {2056.80, -1210.70, -89.00, 2185.30, -1126.30, 110.90}},
        {"Jefferson",                    {2185.30, -1210.70, -89.00, 2281.40, -1154.50, 110.90}},
        {"Jefferson",                    {2056.80, -1449.60, -89.00, 2266.20, -1372.00, 110.90}},
        {"Julius Thruway East",          {2623.10, 943.20, -89.00, 2749.90, 1055.90, 110.90}},
        {"Julius Thruway East",          {2685.10, 1055.90, -89.00, 2749.90, 2626.50, 110.90}},
        {"Julius Thruway East",          {2536.40, 2442.50, -89.00, 2685.10, 2542.50, 110.90}},
        {"Julius Thruway East",          {2625.10, 2202.70, -89.00, 2685.10, 2442.50, 110.90}},
        {"Julius Thruway North",         {2498.20, 2542.50, -89.00, 2685.10, 2626.50, 110.90}},
        {"Julius Thruway North",         {2237.40, 2542.50, -89.00, 2498.20, 2663.10, 110.90}},
        {"Julius Thruway North",         {2121.40, 2508.20, -89.00, 2237.40, 2663.10, 110.90}},
        {"Julius Thruway North",         {1938.80, 2508.20, -89.00, 2121.40, 2624.20, 110.90}},
        {"Julius Thruway North",         {1534.50, 2433.20, -89.00, 1848.40, 2583.20, 110.90}},
        {"Julius Thruway North",         {1848.40, 2478.40, -89.00, 1938.80, 2553.40, 110.90}},
        {"Julius Thruway North",         {1704.50, 2342.80, -89.00, 1848.40, 2433.20, 110.90}},
        {"Julius Thruway North",         {1377.30, 2433.20, -89.00, 1534.50, 2507.20, 110.90}},
        {"Julius Thruway South",         {1457.30, 823.20, -89.00, 2377.30, 863.20, 110.90}},
        {"Julius Thruway South",         {2377.30, 788.80, -89.00, 2537.30, 897.90, 110.90}},
        {"Julius Thruway West",          {1197.30, 1163.30, -89.00, 1236.60, 2243.20, 110.90}},
        {"Julius Thruway West",          {1236.60, 2142.80, -89.00, 1297.40, 2243.20, 110.90}},
        {"Juniper Hill",                 {-2533.00, 578.30, -7.60, -2274.10, 968.30, 200.00}},
        {"Juniper Hollow",               {-2533.00, 968.30, -6.10, -2274.10, 1358.90, 200.00}},
        {"K.A.C.C. Military Fuels",      {2498.20, 2626.50, -89.00, 2749.90, 2861.50, 110.90}},
        {"Kincaid Bridge",               {-1339.80, 599.20, -89.00, -1213.90, 828.10, 110.90}},
        {"Kincaid Bridge",               {-1213.90, 721.10, -89.00, -1087.90, 950.00, 110.90}},
        {"Kincaid Bridge",               {-1087.90, 855.30, -89.00, -961.90, 986.20, 110.90}},
        {"King's",                       {-2329.30, 458.40, -7.60, -1993.20, 578.30, 200.00}},
        {"King's",                       {-2411.20, 265.20, -9.10, -1993.20, 373.50, 200.00}},
        {"King's",                       {-2253.50, 373.50, -9.10, -1993.20, 458.40, 200.00}},
        {"LVA Freight Depot",            {1457.30, 863.20, -89.00, 1777.40, 1143.20, 110.90}},
        {"LVA Freight Depot",            {1375.60, 919.40, -89.00, 1457.30, 1203.20, 110.90}},
        {"LVA Freight Depot",            {1277.00, 1087.60, -89.00, 1375.60, 1203.20, 110.90}},
        {"LVA Freight Depot",            {1315.30, 1044.60, -89.00, 1375.60, 1087.60, 110.90}},
        {"LVA Freight Depot",            {1236.60, 1163.40, -89.00, 1277.00, 1203.20, 110.90}},
        {"Las Barrancas",                {-926.10, 1398.70, -3.00, -719.20, 1634.60, 200.00}},
        {"Las Brujas",                   {-365.10, 2123.00, -3.00, -208.50, 2217.60, 200.00}},
        {"Las Colinas",                  {1994.30, -1100.80, -89.00, 2056.80, -920.80, 110.90}},
        {"Las Colinas",                  {2056.80, -1126.30, -89.00, 2126.80, -920.80, 110.90}},
        {"Las Colinas",                  {2185.30, -1154.50, -89.00, 2281.40, -934.40, 110.90}},
        {"Las Colinas",                  {2126.80, -1126.30, -89.00, 2185.30, -934.40, 110.90}},
        {"Las Colinas",                  {2747.70, -1120.00, -89.00, 2959.30, -945.00, 110.90}},
        {"Las Colinas",                  {2632.70, -1135.00, -89.00, 2747.70, -945.00, 110.90}},
        {"Las Colinas",                  {2281.40, -1135.00, -89.00, 2632.70, -945.00, 110.90}},
        {"Las Payasadas",                {-354.30, 2580.30, 2.00, -133.60, 2816.80, 200.00}},
        {"Las Venturas Airport",         {1236.60, 1203.20, -89.00, 1457.30, 1883.10, 110.90}},
        {"Las Venturas Airport",         {1457.30, 1203.20, -89.00, 1777.30, 1883.10, 110.90}},
        {"Las Venturas Airport",         {1457.30, 1143.20, -89.00, 1777.40, 1203.20, 110.90}},
        {"Las Venturas Airport",         {1515.80, 1586.40, -12.50, 1729.90, 1714.50, 87.50}},
        {"Last Dime Motel",              {1823.00, 596.30, -89.00, 1997.20, 823.20, 110.90}},
        {"Leafy Hollow",                 {-1166.90, -1856.00, 0.00, -815.60, -1602.00, 200.00}},
        {"Liberty City",                 {-1000.00, 400.00, 1300.00, -700.00, 600.00, 1400.00}},
        {"Lil' Probe Inn",               {-90.20, 1286.80, -3.00, 153.80, 1554.10, 200.00}},
        {"Linden Side",                  {2749.90, 943.20, -89.00, 2923.30, 1198.90, 110.90}},
        {"Linden Station",               {2749.90, 1198.90, -89.00, 2923.30, 1548.90, 110.90}},
        {"Linden Station",               {2811.20, 1229.50, -39.50, 2861.20, 1407.50, 60.40}},
        {"Little Mexico",                {1701.90, -1842.20, -89.00, 1812.60, -1722.20, 110.90}},
        {"Little Mexico",                {1758.90, -1722.20, -89.00, 1812.60, -1577.50, 110.90}},
        {"Los Flores",                   {2581.70, -1454.30, -89.00, 2632.80, -1393.40, 110.90}},
        {"Los Flores",                   {2581.70, -1393.40, -89.00, 2747.70, -1135.00, 110.90}},
        {"Los Santos International",     {1249.60, -2394.30, -89.00, 1852.00, -2179.20, 110.90}},
        {"Los Santos International",     {1852.00, -2394.30, -89.00, 2089.00, -2179.20, 110.90}},
        {"Los Santos International",     {1382.70, -2730.80, -89.00, 2201.80, -2394.30, 110.90}},
        {"Los Santos International",     {1974.60, -2394.30, -39.00, 2089.00, -2256.50, 60.90}},
        {"Los Santos International",     {1400.90, -2669.20, -39.00, 2189.80, -2597.20, 60.90}},
        {"Los Santos International",     {2051.60, -2597.20, -39.00, 2152.40, -2394.30, 60.90}},
        {"Marina",                       {647.70, -1804.20, -89.00, 851.40, -1577.50, 110.90}},
        {"Marina",                       {647.70, -1577.50, -89.00, 807.90, -1416.20, 110.90}},
        {"Marina",                       {807.90, -1577.50, -89.00, 926.90, -1416.20, 110.90}},
        {"Market",                       {787.40, -1416.20, -89.00, 1072.60, -1310.20, 110.90}},
        {"Market",                       {952.60, -1310.20, -89.00, 1072.60, -1130.80, 110.90}},
        {"Market",                       {1072.60, -1416.20, -89.00, 1370.80, -1130.80, 110.90}},
        {"Market",                       {926.90, -1577.50, -89.00, 1370.80, -1416.20, 110.90}},
        {"Market Station",               {787.40, -1410.90, -34.10, 866.00, -1310.20, 65.80}},
        {"Martin Bridge",                {-222.10, 293.30, 0.00, -122.10, 476.40, 200.00}},
        {"Missionary Hill",              {-2994.40, -811.20, 0.00, -2178.60, -430.20, 200.00}},
        {"Montgomery",                   {1119.50, 119.50, -3.00, 1451.40, 493.30, 200.00}},
        {"Montgomery",                   {1451.40, 347.40, -6.10, 1582.40, 420.80, 200.00}},
        {"Montgomery Intersection",      {1546.60, 208.10, 0.00, 1745.80, 347.40, 200.00}},
        {"Montgomery Intersection",      {1582.40, 347.40, 0.00, 1664.60, 401.70, 200.00}},
        {"Mulholland",                   {1414.00, -768.00, -89.00, 1667.60, -452.40, 110.90}},
        {"Mulholland",                   {1281.10, -452.40, -89.00, 1641.10, -290.90, 110.90}},
        {"Mulholland",                   {1269.10, -768.00, -89.00, 1414.00, -452.40, 110.90}},
        {"Mulholland",                   {1357.00, -926.90, -89.00, 1463.90, -768.00, 110.90}},
        {"Mulholland",                   {1318.10, -910.10, -89.00, 1357.00, -768.00, 110.90}},
        {"Mulholland",                   {1169.10, -910.10, -89.00, 1318.10, -768.00, 110.90}},
        {"Mulholland",                   {768.60, -954.60, -89.00, 952.60, -860.60, 110.90}},
        {"Mulholland",                   {687.80, -860.60, -89.00, 911.80, -768.00, 110.90}},
        {"Mulholland",                   {737.50, -768.00, -89.00, 1142.20, -674.80, 110.90}},
        {"Mulholland",                   {1096.40, -910.10, -89.00, 1169.10, -768.00, 110.90}},
        {"Mulholland",                   {952.60, -937.10, -89.00, 1096.40, -860.60, 110.90}},
        {"Mulholland",                   {911.80, -860.60, -89.00, 1096.40, -768.00, 110.90}},
        {"Mulholland",                   {861.00, -674.80, -89.00, 1156.50, -600.80, 110.90}},
        {"Mulholland Intersection",      {1463.90, -1150.80, -89.00, 1812.60, -768.00, 110.90}},
        {"North Rock",                   {2285.30, -768.00, 0.00, 2770.50, -269.70, 200.00}},
        {"Ocean Docks",                  {2373.70, -2697.00, -89.00, 2809.20, -2330.40, 110.90}},
        {"Ocean Docks",                  {2201.80, -2418.30, -89.00, 2324.00, -2095.00, 110.90}},
        {"Ocean Docks",                  {2324.00, -2302.30, -89.00, 2703.50, -2145.10, 110.90}},
        {"Ocean Docks",                  {2089.00, -2394.30, -89.00, 2201.80, -2235.80, 110.90}},
        {"Ocean Docks",                  {2201.80, -2730.80, -89.00, 2324.00, -2418.30, 110.90}},
        {"Ocean Docks",                  {2703.50, -2302.30, -89.00, 2959.30, -2126.90, 110.90}},
        {"Ocean Docks",                  {2324.00, -2145.10, -89.00, 2703.50, -2059.20, 110.90}},
        {"Ocean Flats",                  {-2994.40, 277.40, -9.10, -2867.80, 458.40, 200.00}},
        {"Ocean Flats",                  {-2994.40, -222.50, -0.00, -2593.40, 277.40, 200.00}},
        {"Ocean Flats",                  {-2994.40, -430.20, -0.00, -2831.80, -222.50, 200.00}},
        {"Octane Springs",               {338.60, 1228.50, 0.00, 664.30, 1655.00, 200.00}},
        {"Old Venturas Strip",           {2162.30, 2012.10, -89.00, 2685.10, 2202.70, 110.90}},
        {"Palisades",                    {-2994.40, 458.40, -6.10, -2741.00, 1339.60, 200.00}},
        {"Palomino Creek",               {2160.20, -149.00, 0.00, 2576.90, 228.30, 200.00}},
        {"Paradiso",                     {-2741.00, 793.40, -6.10, -2533.00, 1268.40, 200.00}},
        {"Pershing Square",              {1440.90, -1722.20, -89.00, 1583.50, -1577.50, 110.90}},
        {"Pilgrim",                      {2437.30, 1383.20, -89.00, 2624.40, 1783.20, 110.90}},
        {"Pilgrim",                      {2624.40, 1383.20, -89.00, 2685.10, 1783.20, 110.90}},
        {"Pilson Intersection",          {1098.30, 2243.20, -89.00, 1377.30, 2507.20, 110.90}},
        {"Pirates in Men's Pants",       {1817.30, 1469.20, -89.00, 2027.40, 1703.20, 110.90}},
        {"Playa del Seville",            {2703.50, -2126.90, -89.00, 2959.30, -1852.80, 110.90}},
        {"Prickle Pine",                 {1534.50, 2583.20, -89.00, 1848.40, 2863.20, 110.90}},
        {"Prickle Pine",                 {1117.40, 2507.20, -89.00, 1534.50, 2723.20, 110.90}},
        {"Prickle Pine",                 {1848.40, 2553.40, -89.00, 1938.80, 2863.20, 110.90}},
        {"Prickle Pine",                 {1938.80, 2624.20, -89.00, 2121.40, 2861.50, 110.90}},
        {"Queens",                       {-2533.00, 458.40, 0.00, -2329.30, 578.30, 200.00}},
        {"Queens",                       {-2593.40, 54.70, 0.00, -2411.20, 458.40, 200.00}},
        {"Queens",                       {-2411.20, 373.50, 0.00, -2253.50, 458.40, 200.00}},
        {"Randolph Industrial Estate",   {1558.00, 596.30, -89.00, 1823.00, 823.20, 110.90}},
        {"Redsands East",                {1817.30, 2011.80, -89.00, 2106.70, 2202.70, 110.90}},
        {"Redsands East",                {1817.30, 2202.70, -89.00, 2011.90, 2342.80, 110.90}},
        {"Redsands East",                {1848.40, 2342.80, -89.00, 2011.90, 2478.40, 110.90}},
        {"Redsands West",                {1236.60, 1883.10, -89.00, 1777.30, 2142.80, 110.90}},
        {"Redsands West",                {1297.40, 2142.80, -89.00, 1777.30, 2243.20, 110.90}},
        {"Redsands West",                {1377.30, 2243.20, -89.00, 1704.50, 2433.20, 110.90}},
        {"Redsands West",                {1704.50, 2243.20, -89.00, 1777.30, 2342.80, 110.90}},
        {"Regular Tom",                  {-405.70, 1712.80, -3.00, -276.70, 1892.70, 200.00}},
        {"Richman",                      {647.50, -1118.20, -89.00, 787.40, -954.60, 110.90}},
        {"Richman",                      {647.50, -954.60, -89.00, 768.60, -860.60, 110.90}},
        {"Richman",                      {225.10, -1369.60, -89.00, 334.50, -1292.00, 110.90}},
        {"Richman",                      {225.10, -1292.00, -89.00, 466.20, -1235.00, 110.90}},
        {"Richman",                      {72.60, -1404.90, -89.00, 225.10, -1235.00, 110.90}},
        {"Richman",                      {72.60, -1235.00, -89.00, 321.30, -1008.10, 110.90}},
        {"Richman",                      {321.30, -1235.00, -89.00, 647.50, -1044.00, 110.90}},
        {"Richman",                      {321.30, -1044.00, -89.00, 647.50, -860.60, 110.90}},
        {"Richman",                      {321.30, -860.60, -89.00, 687.80, -768.00, 110.90}},
        {"Richman",                      {321.30, -768.00, -89.00, 700.70, -674.80, 110.90}},
        {"Robada Intersection",          {-1119.00, 1178.90, -89.00, -862.00, 1351.40, 110.90}},
        {"Roca Escalante",               {2237.40, 2202.70, -89.00, 2536.40, 2542.50, 110.90}},
        {"Roca Escalante",               {2536.40, 2202.70, -89.00, 2625.10, 2442.50, 110.90}},
        {"Rockshore East",               {2537.30, 676.50, -89.00, 2902.30, 943.20, 110.90}},
        {"Rockshore West",               {1997.20, 596.30, -89.00, 2377.30, 823.20, 110.90}},
        {"Rockshore West",               {2377.30, 596.30, -89.00, 2537.30, 788.80, 110.90}},
        {"Rodeo",                        {72.60, -1684.60, -89.00, 225.10, -1544.10, 110.90}},
        {"Rodeo",                        {72.60, -1544.10, -89.00, 225.10, -1404.90, 110.90}},
        {"Rodeo",                        {225.10, -1684.60, -89.00, 312.80, -1501.90, 110.90}},
        {"Rodeo",                        {225.10, -1501.90, -89.00, 334.50, -1369.60, 110.90}},
        {"Rodeo",                        {334.50, -1501.90, -89.00, 422.60, -1406.00, 110.90}},
        {"Rodeo",                        {312.80, -1684.60, -89.00, 422.60, -1501.90, 110.90}},
        {"Rodeo",                        {422.60, -1684.60, -89.00, 558.00, -1570.20, 110.90}},
        {"Rodeo",                        {558.00, -1684.60, -89.00, 647.50, -1384.90, 110.90}},
        {"Rodeo",                        {466.20, -1570.20, -89.00, 558.00, -1385.00, 110.90}},
        {"Rodeo",                        {422.60, -1570.20, -89.00, 466.20, -1406.00, 110.90}},
        {"Rodeo",                        {466.20, -1385.00, -89.00, 647.50, -1235.00, 110.90}},
        {"Rodeo",                        {334.50, -1406.00, -89.00, 466.20, -1292.00, 110.90}},
        {"Royal Casino",                 {2087.30, 1383.20, -89.00, 2437.30, 1543.20, 110.90}},
        {"San Andreas Sound",            {2450.30, 385.50, -100.00, 2759.20, 562.30, 200.00}},
        {"Santa Flora",                  {-2741.00, 458.40, -7.60, -2533.00, 793.40, 200.00}},
        {"Santa Maria Beach",            {342.60, -2173.20, -89.00, 647.70, -1684.60, 110.90}},
        {"Santa Maria Beach",            {72.60, -2173.20, -89.00, 342.60, -1684.60, 110.90}},
        {"Shady Cabin",                  {-1632.80, -2263.40, -3.00, -1601.30, -2231.70, 200.00}},
        {"Shady Creeks",                 {-1820.60, -2643.60, -8.00, -1226.70, -1771.60, 200.00}},
        {"Shady Creeks",                 {-2030.10, -2174.80, -6.10, -1820.60, -1771.60, 200.00}},
        {"Sobell Rail Yards",            {2749.90, 1548.90, -89.00, 2923.30, 1937.20, 110.90}},
        {"Spinybed",                     {2121.40, 2663.10, -89.00, 2498.20, 2861.50, 110.90}},
        {"Starfish Casino",              {2437.30, 1783.20, -89.00, 2685.10, 2012.10, 110.90}},
        {"Starfish Casino",              {2437.30, 1858.10, -39.00, 2495.00, 1970.80, 60.90}},
        {"Starfish Casino",              {2162.30, 1883.20, -89.00, 2437.30, 2012.10, 110.90}},
        {"Temple",                       {1252.30, -1130.80, -89.00, 1378.30, -1026.30, 110.90}},
        {"Temple",                       {1252.30, -1026.30, -89.00, 1391.00, -926.90, 110.90}},
        {"Temple",                       {1252.30, -926.90, -89.00, 1357.00, -910.10, 110.90}},
        {"Temple",                       {952.60, -1130.80, -89.00, 1096.40, -937.10, 110.90}},
        {"Temple",                       {1096.40, -1130.80, -89.00, 1252.30, -1026.30, 110.90}},
        {"Temple",                       {1096.40, -1026.30, -89.00, 1252.30, -910.10, 110.90}},
        {"The Camel's Toe",              {2087.30, 1203.20, -89.00, 2640.40, 1383.20, 110.90}},
        {"The Clown's Pocket",           {2162.30, 1783.20, -89.00, 2437.30, 1883.20, 110.90}},
        {"The Emerald Isle",             {2011.90, 2202.70, -89.00, 2237.40, 2508.20, 110.90}},
        {"The Farm",                     {-1209.60, -1317.10, 114.90, -908.10, -787.30, 251.90}},
        {"The Four Dragons Casino",      {1817.30, 863.20, -89.00, 2027.30, 1083.20, 110.90}},
        {"The High Roller",              {1817.30, 1283.20, -89.00, 2027.30, 1469.20, 110.90}},
        {"The Mako Span",                {1664.60, 401.70, 0.00, 1785.10, 567.20, 200.00}},
        {"The Panopticon",               {-947.90, -304.30, -1.10, -319.60, 327.00, 200.00}},
        {"The Pink Swan",                {1817.30, 1083.20, -89.00, 2027.30, 1283.20, 110.90}},
        {"The Sherman Dam",              {-968.70, 1929.40, -3.00, -481.10, 2155.20, 200.00}},
        {"The Strip",                    {2027.40, 863.20, -89.00, 2087.30, 1703.20, 110.90}},
        {"The Strip",                    {2106.70, 1863.20, -89.00, 2162.30, 2202.70, 110.90}},
        {"The Strip",                    {2027.40, 1783.20, -89.00, 2162.30, 1863.20, 110.90}},
        {"The Strip",                    {2027.40, 1703.20, -89.00, 2137.40, 1783.20, 110.90}},
        {"The Visage",                   {1817.30, 1863.20, -89.00, 2106.70, 2011.80, 110.90}},
        {"The Visage",                   {1817.30, 1703.20, -89.00, 2027.40, 1863.20, 110.90}},
        {"Unity Station",                {1692.60, -1971.80, -20.40, 1812.60, -1932.80, 79.50}},
        {"Valle Ocultado",               {-936.60, 2611.40, 2.00, -715.90, 2847.90, 200.00}},
        {"Verdant Bluffs",               {930.20, -2488.40, -89.00, 1249.60, -2006.70, 110.90}},
        {"Verdant Bluffs",               {1073.20, -2006.70, -89.00, 1249.60, -1842.20, 110.90}},
        {"Verdant Bluffs",               {1249.60, -2179.20, -89.00, 1692.60, -1842.20, 110.90}},
        {"Verdant Meadows",              {37.00, 2337.10, -3.00, 435.90, 2677.90, 200.00}},
        {"Verona Beach",                 {647.70, -2173.20, -89.00, 930.20, -1804.20, 110.90}},
        {"Verona Beach",                 {930.20, -2006.70, -89.00, 1073.20, -1804.20, 110.90}},
        {"Verona Beach",                 {851.40, -1804.20, -89.00, 1046.10, -1577.50, 110.90}},
        {"Verona Beach",                 {1161.50, -1722.20, -89.00, 1323.90, -1577.50, 110.90}},
        {"Verona Beach",                 {1046.10, -1722.20, -89.00, 1161.50, -1577.50, 110.90}},
        {"Vinewood",                     {787.40, -1310.20, -89.00, 952.60, -1130.80, 110.90}},
        {"Vinewood",                     {787.40, -1130.80, -89.00, 952.60, -954.60, 110.90}},
        {"Vinewood",                     {647.50, -1227.20, -89.00, 787.40, -1118.20, 110.90}},
        {"Vinewood",                     {647.70, -1416.20, -89.00, 787.40, -1227.20, 110.90}},
        {"Whitewood Estates",            {883.30, 1726.20, -89.00, 1098.30, 2507.20, 110.90}},
        {"Whitewood Estates",            {1098.30, 1726.20, -89.00, 1197.30, 2243.20, 110.90}},
        {"Willowfield",                  {1970.60, -2179.20, -89.00, 2089.00, -1852.80, 110.90}},
        {"Willowfield",                  {2089.00, -2235.80, -89.00, 2201.80, -1989.90, 110.90}},
        {"Willowfield",                  {2089.00, -1989.90, -89.00, 2324.00, -1852.80, 110.90}},
        {"Willowfield",                  {2201.80, -2095.00, -89.00, 2324.00, -1989.90, 110.90}},
        {"Willowfield",                  {2541.70, -1941.40, -89.00, 2703.50, -1852.80, 110.90}},
        {"Willowfield",                  {2324.00, -2059.20, -89.00, 2541.70, -1852.80, 110.90}},
        {"Willowfield",                  {2541.70, -2059.20, -89.00, 2703.50, -1941.40, 110.90}},
        {"Yellow Bell Station",          {1377.40, 2600.40, -21.90, 1492.40, 2687.30, 78.00}}
};


//Навигатор GPS
enum gps_Info
{
    gps_t[45],
    Float: gps_x,
    Float: gps_y,
    Float: gps_z
}
new  social_info[][gps_Info] = {
    {"Мэрия (устройство на работу)", 1481.3530,-1738.4675,13.3906},
    {"Банк",  1422.6753,-1705.6573,13.3906},
    {"Автопарк",  1106.5701,-1741.1563,13.3906},
    {"Завод продуктов и топлива", -130.3892,-376.1595,1.9571},
    {"Автошкола", -2047.7711,-76.7507,35.1654},
    {"Автосалон Los Santos",  557.9310,-1256.7837,17.2422},
    {"Автосалон San Fierro", -1990.8103,288.8128,34.09},
    {"Автосалон San Fierro[2]",  -1631.4115,1203.0520,7.1797},
    {"Автосалон Las Venturas",  2467.6013,1321.6621,10.7386}
};
new frac_info[][gps_Info] = {
    {"Полиция Лос Сантос", 1537.1061,-1675.3307,13.3828},
    {"Полиция Сан Фиерро",  -1566.8518,661.8513,7.1875},
    {"Полиция Лас Вентурас",  2303.0977,2424.8372,10.8203},
    {"ФБР",  -2431.0439,493.3086,29.9255},
    {"Армия зона 51", 134.8955,1962.0944,19.477},
    {"Радиоцентр",  1628.4852,-1707.4111,13.3599},
    {"Русская Мафия",  -2807.8381,-330.8951,7.0313},
    {"La Cosa Nostra",  1520.2190,2772.9888,10.6719},
    {"Yakuza",  2500.8674,1608.3457,10.7388},
    {"Grove Street",  2463.2759,-1659.1388,13.3047},
    {"E.S Ballas",  2219.5703,-1451.5961,23.8203},
    {"The Rifa",  2420.8711,-2009.8099,13.4293},
    {"El Corona", 1806.3767,-2112.9570,13.3828},
    {"LS Vagos",  2418.3826,-1092.1191,40.6577}
};


//_______________
main() { print("аы"); } //Мама мамы
public OnGameModeInit()
{
	SetGameModeText("Strant v. 1.01");//Ваше название
	
	con_bd = mysql_connect(mysql_host,mysql_user,mysql_pass,mysql_db);//подключение к базе
	mysql_log();
	mysql_tquery(con_bd,"SELECT * FROM `house`", "load_house", "");//загрузка домов
	mysql_tquery(con_bd,"SELECT * FROM `biz`","biz_load","");//загрузка бизнесов
	mysql_tquery(con_bd,"SELECT * FROM `other`","other_load",""); //загрузка переменных
	mysql_tquery(con_bd,"SELECT * FROM `gangzone`","load_gz",""); //загрузка гангзон
	LoadVehicles();//Загрузка системы авто
	SetTimer("timer_sec", 1000, 1);
	for(new i = 0;i<MAX_VEHICLES;i++) fuel_car[i] = 70,VehSpwn(i);
	//__стандартные фичи убираем
	EnableStuntBonusForAll(0);
	ManualVehicleEngineAndLights();
	DisableInteriorEnterExits();
	LimitPlayerMarkerRadius(50.0);
	AllowInteriorWeapons(0);
	AddPlayerClass(0, 1958.3783, 1343.1572, 15.3746, 269.1425, 0, 0, 0, 0, 0, 0);
	//___________________________
	load_veh();
	load_object();
	load_other ();//
	load_pickup();
	load_actors();
	map_load_spawn();
	return 1;
}
load_actors()
{
	spawnactor = CreateActor(37, 1243.3214 ,-1701.4165, 14.8672, 358.1161);
	CreateDynamic3DTextLabel("Адриано\n{FFFFFF}Для взаимодействия нажмите {FFCC00}\"ALT\"", COLOR_GREEN, 1243.3214 ,-1701.4165, 14.8672, 20.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
 	CreateActor(209, 1220.5582,-1696.4308,13.5469,180.1189);
 	CreateDynamic3DTextLabel("Ларёк с едой\n{FFFFFF}Для взаимодействия нажмите {FFCC00}\"ALT\"", COLOR_GREEN, 1220.5631,-1698.5413,13.5469, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
 	
}

load_object()
{
    for(new i=0; i<sizeof(gAtmPoint); i++) CreateDynamicObject(2754, gAtmPoint[i][0], gAtmPoint[i][1], gAtmPoint[i][2], 0.0, 0.0, gAtmPoint[i][3]);
    //армия сф объекты ящиков
    CreateObject(964, -1223.23706, 442.32242, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1224.93494, 442.34470, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1226.62952, 442.35574, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1228.13257, 440.72086, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1228.36133, 438.94867, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1228.05603, 442.38739, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1227.03015, 441.55441, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1225.42810, 441.71249, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1223.97314, 441.47150, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1223.36353, 439.77301, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1224.94556, 440.02481, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1227.46399, 440.22229, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1227.42358, 438.46381, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1225.49829, 438.70023, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1223.71082, 438.51947, 7.20660,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1225.39038, 440.05969, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1225.33557, 438.55917, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1223.14368, 439.49384, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1227.04236, 439.16397, 6.28159,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1225.43860, 439.04309, 8.09160,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1249.96387, 439.09027, 6.29090,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1249.98950, 437.81940, 6.29090,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1250.01636, 438.35379, 7.17590,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1250.01636, 438.35379, 8.10990,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1249.96387, 440.38831, 6.29090,   0.00000, 0.00000, 0.00000);
	CreateObject(964, -1250.01636, 439.65179, 7.17590,   0.00000, 0.00000, 0.00000);
	CreateObject(2567, -1232.34656, 439.13989, 8.17340,   0.00000, 0.00000, 0.00000);
	CreateObject(2567, -1239.86731, 449.05948, 8.17340,   0.00000, 0.00000, 90.00000);

	
	//армия з51
	Create3DTextLabel("Склад боеприпасов\n"S"Для выгрузки боеприпасов\nвведите: /put",server,146.3309,1911.5781,21.0484,25.0,0,0);
	Create3DTextLabel("Склад боеприпасов",server,143.4809,1895.2067,18.4457,25.0,0,0);
    
    CreateObject(1498, 142.848480,1894.326049,17.297035, 0.000000,0.000000,89.900009);//дверь
    
	barrier = CreateObject(968,342.89941406,1796.09960938,18.09999924,0.00000000,90.00000000,33.99267578);
    CreateObject(966, 343.04199, 1796.21375, 17.24870,   0.00000, 0.00000, 214.00000);
	CreateObject(967, 341.44241, 1796.36658, 17.22900,   0.00000, 0.00000, 302.00000);
	CreateObject(16095, 289.86581, 1809.05518, 16.63280,   0.00000, 0.00000, 180.00000);
	gate_z51[0] = CreateObject(985,285.98410034,1816.82214355,18.60793877,0.00000000,0.00000000,270.00000000); //object(gate_autor) (1)
	gate_z51[1] = CreateObject(986,285.98410034,1824.74121094,18.60793877,0.00000000,0.00000000,270.00000000); //object(gate_autol) (1)
	gate_z51[2] = CreateObject(19313,134.7749, 1941.5251, 21.4830,0.00000000,0.00000000,0.00000000); //object(gate_autol) (1)
	gate_z51[3] = CreateObject(985, 96.48480, 1923.26721, 16.48380,   0.00000, 0.00000, 90.00000);

   	CreateObject(967, 95.14091, 1918.53076, 16.99688,   0.00000, 0.00000, 180.00000);//пост

    CreateObject(9241, 354.50894, 1977.32214, 18.12261,   0.00000, 0.00000, 0.00000);
	CreateObject(9241, 355.36743, 1935.69714, 18.12262,   0.00000, 0.00000, 0.00000);
	CreateObject(16770, 233.07202, 1965.76172, 18.19352,   0.00000, 0.00000, 90.00000);
	CreateObject(16770, 215.77527, 1965.78833, 18.19352,   0.00000, 0.00000, 90.00000);
	CreateObject(19940, 224.95064, 2009.70618, 16.59584,   0.00000, 0.00000, 0.00000);
	CreateObject(13187, 236.51280, 2002.79797, 17.77650,   0.00000, 0.00000, 90.00000);
	CreateObject(13187, 229.77914, 2002.79797, 17.77650,   0.00000, 0.00000, 90.00000);
	CreateObject(13187, 222.97040, 2002.79797, 17.77650,   0.00000, 0.00000, 90.00000);
	CreateObject(13187, 209.38560, 2002.79797, 17.77650,   0.00000, 0.00000, 90.00000);
	CreateObject(13187, 216.16969, 2002.79797, 17.77650,   0.00000, 0.00000, 90.00000);
	CreateObject(19312, 190.92024, 1870.40674, 21.40468,   0.00000, 0.00000, 0.00000);
}
load_veh()
{
     //КОРОНОС
	el_corona_car[0] = CreateVehicle(534,1662.5562,-2111.1243,13.2693,269.6263, 135, 135, 1000);
	CreateVehicle(534, 1662.5562,-2115.5178,13.2723,269.6266, 135,135, 1000);
	CreateVehicle(518, 1677.5062,-2105.3210,13.2734,179.8799, 135, 135, 1000);
	CreateVehicle(518, 1689.0051,-2117.9063,13.2183,271.5335, 135, 135, 1000);
	el_corona_car[1] = CreateVehicle(535,1685.1022,-2107.3120,13.1844,270.2835, 135, 135, 1000);

	//вагос
	vagos_car[0] = CreateVehicle(467,2418.9902,-1112.8621,40.5225,336.9530,228,228, 1000); // v1
	CreateVehicle(467,2426.9038,-1112.9227,41.7010,1.2599,228,228, 1000); // v2
	CreateVehicle(474,2413.8665,-1098.0801,39.8968,84.6636,228,228, 1000); // v3
	CreateVehicle(474,2397.6963,-1096.8291,37.7673,283.3022,228,228, 1000); // v4
	vagos_car[1] = CreateVehicle(467,2419.3381,-1106.3800,40.4799,320.3830,228,228, 1000); // v5
	
	//rifa
	rifa_car[0] = CreateVehicle(540,2513.6912,-2014.1971,13.2669,83.5934,198,198, 1000); // r1
	CreateVehicle(540,2503.1802,-2004.9324,13.2633,91.2057,198,198, 1000); // r2
	CreateVehicle(518,2513.3662,-2004.6901,13.0744,87.8914,198,198, 1000); // r3
	CreateVehicle(518,2526.5991,-2006.7926,13.2206,105.8819,198,198, 1000); // r4
	rifa_car[1] = CreateVehicle(518,2526.6936,-2011.9404,13.2248,75.1895,198,198, 1000); // r5

	//ГРУВ
	grove_car[0] = CreateVehicle(492, 2473.1304, -1689.7839, 13.6886, -0.4200, 229, 138, 1000);
	CreateVehicle(492, 2472.0591, -1674.3954, 13.6886, -156.8399, 229, 138, 1000);
	CreateVehicle(492, 2470.0696, -1668.0852, 13.6886, -169.6199, 229, 138, 1000);
	CreateVehicle(600, 2476.4517, -1679.8984, 13.3241, -129.4800,229, 138, 1000);
	grove_car[1] = CreateVehicle(600, 2459.9258, -1674.15, 13.2241, -119.7600, 229, 138, 1000);

	//БАЛЛАС
	ballas_car[0] = CreateVehicle(566, 2259.9167,-1423.3571,23.8148,289.4890,167,167, 1000);
	CreateVehicle(466, 2274.1375,-1428.0880,23.6514,173.8477,167,167, 1000);
	CreateVehicle(466, 2272.5801,-1440.6027,23.6547,172.0525,167,167, 1000);
	CreateVehicle(412, 2266.1848, -1445.2816, 23.5324, -210.4200, 167,167, 1000);
	ballas_car[1] = CreateVehicle(412, 2274.1992,-1413.0179,23.6087,132.4828,167,167, 1000);

	//мафии
    rm_car[0] =	CreateVehicle(415,-2774.0244,-281.8402,6.8149,179.2955,1,1,600); // ??
	CreateVehicle(415,-2769.1563,-281.8402,6.8142,180.4460,1,1,600); // ??
	CreateVehicle(415,-2764.3563,-281.8402,6.8142,180.4460,1,1,600); // ??
	CreateVehicle(415,-2759.5563,-281.8402,6.8142,180.4460,1,1,600); // ??
	CreateVehicle(415,-2754.7563,-281.8402,6.8142,180.4460,1,1,600); // ??
	CreateVehicle(415, -2749.9563,-281.8402,6.8142,180.4460,1,1,600); // ??
	rm_car[1] =	CreateVehicle(415, -2745.1563,-281.8402,6.8142,180.4460,1,1,600);

	
	lcn_car[0] = CreateVehicle(415,1460.5293,2839.0669,10.5914,179.1631,18,18,600); //
	CreateVehicle(415,1465.4655,2839.3647,10.5906,179.3452,18,18,600); //
	CreateVehicle(415,1470.0317,2839.1648,10.5779,179.6352,18,18,600); //
	CreateVehicle(415,1475.0443,2839.4187,10.5661,179.9596,18,18,600); //
	CreateVehicle(415,1479.8687,2839.5571,10.5528,180.2296,18,18,600); //
	CreateVehicle(415,1484.8007,2839.6125,10.5409,180.0703,18,18,600); //
	CreateVehicle(415,1489.4921,2839.6399,10.7009,180.9047,18,18,600); //
	lcn_car[1] = CreateVehicle(415,1494.2808,2839.4143,10.6882,179.4756,18,18,600); //
	
	yakuza_car[0] = CreateVehicle(415,2490.4421,1567.1836,10.5116,342.5705,6,6,600); //
	CreateVehicle(415,2488.6001,1556.4741,10.5142,359.8490,6,6,600); //
	CreateVehicle(415,2490.0000,1546.9858,10.5148,19.1682,6,6,600); //
	CreateVehicle(415,2500.9910,1534.7687,10.5165,68.4507,6,6,600); //
	CreateVehicle(415,2511.8232,1531.7626,10.5143,82.3561,6,6,600); //
	yakuza_car[1] = CreateVehicle(415,2522.2590,1530.8214,10.5194,87.5029,6,6,600); //
	
	
    smi_car[0] = CreateVehicle(488,1671.1829,-1717.2252,20.4844,359.5417,7,6, 600); //
	CreateVehicle(582,1669.3528,-1693.7035,15.3143,89.0275,7,6, 600); //
	CreateVehicle(582,1669.3528,-1696.2855,15.3162,89.0275,7,6, 600); //
	CreateVehicle(582,1669.3528,-1698.7855,15.3162,89.0275,7,6, 600); //
	smi_car[1] = CreateVehicle(582,1669.3528,-1701.2855,15.3162,89.0275,7,6, 600); //

    army_car[0] = CreateVehicle(432, 277.8578, 1955.9332, 17.5809, -90.0000,131, 131, 300);
	CreateVehicle(432, 279.7112, 1963.7585, 17.5809, -90.0000, 131, 131, 300);
	CreateVehicle(432, 280.1783, 1948.1509, 17.5809, -90.0000, 131, 131, 300);
	CreateVehicle(520, 278.0022, 2023.7681, 18.3396, -90.0000, 131, 131, 300);
	CreateVehicle(520, 278.0022, 1989.8170, 18.3396, -90.0000, 131, 131, 300);
	CreateVehicle(519, 308.5096, 2048.1814, 18.6454, 180.0000, 131, 131, 300);
	CreateVehicle(548, 355.4763, 1977.2008, 21.8713, 90.0600, 131, 131, 300);
	CreateVehicle(487, 354.1120, 1935.3219, 20.0660, 90.0000, 131, 131, 300);
	CreateVehicle(579, 222.6210, 1862.2908, 12.9315, 0.0000, 131, 131, 300);
	CreateVehicle(579, 219.0511, 1862.2908, 12.9315, 0.0000,131, 131, 300);
	CreateVehicle(579, 215.5127, 1862.2908, 12.9315, 0.0000, 131, 131, 300);
	CreateVehicle(579, 211.8704, 1862.2908, 12.9315, -0.0600, 131, 131, 300);
	CreateVehicle(470, 193.3969, 1920.3186, 17.3298, 180.0000,131, 131, 300);
	CreateVehicle(470, 211.3786, 1920.3186, 17.3298, 180.2400, 131, 131, 300);
	CreateVehicle(470, 202.6242, 1920.3186, 17.3298, 180.3000, 131, 131, 300);
	army_car[1] = CreateVehicle(470, 220.5735, 1920.3186, 17.3298, 180.2400,131, 131, 300);

    fbi_car[0] = CreateVehicle(427,-2441.3005,523.5311,30.0553,179.9364,0,0, 600); //
	CreateVehicle(490,-2425.7998,518.2865,29.8609,220.9706,0,0, 600); //
	CreateVehicle(490,-2429.6963,515.4611,29.8795,215.7738,0,0, 600); //
    CreateVehicle(490,-2422.3557,521.4836,29.8831,225.1303,0,0, 600); //
	CreateVehicle(490,-2419.1292,524.8925,29.9017,230.1783,0,0, 600); //
	CreateVehicle(490,-2416.4453,528.4032,29.9028,238.2431,0,0, 600); //
	CreateVehicle(445,-2415.0222,532.1198,29.7547,249.6213,0,0, 600); //
	CreateVehicle(415,-2414.0459,535.9401,29.7066,257.7313,0,0, 600); //
	CreateVehicle(482,-2413.7783,539.9514,30.0778,267.6446,0,0, 600); //
	fbi_car[1] = CreateVehicle(487,-2439.2722,523.6176,34.3661,180.0013,0,0, 600); //
	
	
    lvpd_car[0] = CreateVehicle(598,2272.5278,2430.7625,3.0029,0.0011,125,1,900);
	CreateVehicle(598,2268.1873,2430.7576,3.0056,359.8773,125,1,900);
	CreateVehicle(598,2263.6909,2430.7607,3.0042,359.9790,125,1,900);
	CreateVehicle(598,2259.5288,2430.7576,3.0023,0.1146,125,1,900);
	CreateVehicle(598,2239.5972,2437.4282,3.0449,269.9994,125,1,900);
	CreateVehicle(598,2239.5930,2442.3853,3.0380,270.0208,125,1,900);
	CreateVehicle(598,2239.5986,2447.0454,3.0465,269.9959,125,1,900);
	CreateVehicle(598,2239.5989,2452.0015,3.0463,269.9926,125,1,900);
	CreateVehicle(415,2239.5964,2456.8318,2.9965,267.3014,1,1,900);
	CreateVehicle(599,2239.5793,2466.3608,3.3981,269.9940,125,1,900);
	CreateVehicle(528,2314.0913,2495.2166,-7.4943,89.9962,125,1,900);
	CreateVehicle(427,2314.0862,2480.0293,-7.2966,90.0000,125,1,900);
	lvpd_car[1] = CreateVehicle(427,2314.0859,2475.1082,-7.2915,90.0897,125,1,900);
	sfpd_car[0] = CreateVehicle(497,-1679.8148,705.7831,30.7790,90.0109,125,1,900);
	CreateVehicle(597,-1573.1211,742.8321,-5.5223,90.9742,125,1,900);
	CreateVehicle(597,-1573.1511,738.7425,-5.4791,91.1489,125,1,900);
	CreateVehicle(597,-1573.1152,734.8708,-5.4727,91.7343,125,1,900);
	CreateVehicle(597,-1573.1600,730.4979,-5.5373,88.0672,125,1,900);
	CreateVehicle(597,-1573.0562,726.3375,-5.5381,85.1793,125,1,900);
	CreateVehicle(523,-1608.5082,693.3780,-5.4683,183.2357,125,1,900);
	CreateVehicle(523,-1612.4927,693.3866,-5.4868,182.7922,125,1,900);
	CreateVehicle(523,-1616.5481,693.4748,-5.4875,177.8815,125,1,900);
	CreateVehicle(523,-1620.9077,693.3848,-5.4624,181.6400,125,1,900);
	CreateVehicle(523,-1624.9263,693.3171,-5.4729,177.6892,125,1,900);
	CreateVehicle(427,-1638.6704,661.6256,-5.0797,271.1700,125,1,900);
	CreateVehicle(415,-1639.7462,674.0609,-5.4735,269.5934,125,1,900);
	CreateVehicle(528,-1639.2843,669.9789,-5.4730,268.9637,125,1,900);
	sfpd_car[1] = CreateVehicle(427,-1638.6851,657.9620,-5.0789,269.8145,125,1,900);
	lspd_car[0] = CreateVehicle(596,1595.5294,-1710.4364,5.5554,359.9512,125,1,900);
	CreateVehicle(596,1591.4102,-1710.4376,5.5512,359.9007,125,1,900);
	CreateVehicle(596,1587.3835,-1710.4337,5.6186,0.0181,125,1,900);
	CreateVehicle(596,1583.4680,-1710.4301,5.5567,359.9969,125,1,900);
	CreateVehicle(596,1578.5658,-1710.4299,5.5568,359.9970,125,1,900);
	CreateVehicle(596,1574.4985,-1710.4314,5.5677,359.9968,125,1,900);
	CreateVehicle(596,1570.2262,-1710.4408,5.6353,359.9994,1,1,900);
	CreateVehicle(523,1544.9449,-1684.5110,5.6010,90.0019,125,1,900);
	CreateVehicle(523,1544.9449,-1680.4857,5.5985,90.0023,125,1,900);
	CreateVehicle(523,1544.9290,-1675.8738,5.5502,89.9997,125,1,900);
	CreateVehicle(523,1544.9286,-1672.1986,5.5487,90.1238,125,1,900);
	CreateVehicle(523,1544.9312,-1668.0057,5.6191,90.3254,125,1,900);
	CreateVehicle(528,1544.9625,-1659.0891,5.8918,90.1139,125,1,900);
	CreateVehicle(427,1538.4792,-1645.9200,6.0634,180.0354,125,1,900);
	CreateVehicle(427,1534.7783,-1645.9224,6.0509,179.6709,125,1,900);
	CreateVehicle(415,1544.9933,-1654.9775,5.6121,88.5840,125,1,900);
	lspd_car[1] = CreateVehicle(497,1551.4473,-1609.3640,13.5117,90.0019,125,1,900);
	
	
	carDelivery[0] = CreateVehicle(440,-62.7492,-325.0581,5.5497,269.1944,22,22,17); //
	CreateVehicle(440,-62.7492,-321.4382,5.5785,269.194,22,22,17);//
	CreateVehicle(440,-62.7492,-317.8929,5.5889,269.194,22,22,17);//
	CreateVehicle(440,-62.7492,-314.4144,5.6647,269.194,22,22,17); //
	CreateVehicle(440,-62.7492,-310.8945,5.7938,269.194,22,22,17); //
	CreateVehicle(440,-62.7492,-307.3140,5.8164,269.194,22,22,17); //
	carDelivery[1] = CreateVehicle(440,-62.7492,-303.8643,5.8273,269.194,22,22,17); //

	
	carGasTanker[0] = CreateVehicle(584, -23.0804, -376.9839, 6.4484, 0.0000, -1, -1, 100);//прицепы
	CreateVehicle(584, -29.8005, -376.9619, 6.4484, 0.0000, -1, -1, 100);
	CreateVehicle(584, -36.4805, -376.9893, 6.4484, 0.0000, -1, -1, 100);
	CreateVehicle(584, -43.3408, -376.9375, 6.4484, 0.0000, -1, -1, 100);//прицепы
    CreateVehicle(515,-1.5898,-301.1262,6.4482,89.6845,1,1,17);// фура
	CreateVehicle(515,-1.3278,-308.3546,6.4500,89.9675,1,1,17); // фура
	CreateVehicle(515,-1.6004,-315.2599,6.4486,89.2910,1,1,17); // фура
	carGasTanker[1] = CreateVehicle(515,-1.3334,-322.3853,6.4510,88.9287,1,1,17); // фура

    BUS[0] = CreateVehicle(437,1081.4485,-1755.0521,13.1568,90.2653,125,1,17); //
	CreateVehicle(437,1081.4485,-1757.9365,13.1514,90.2124,125,1,17); //
	CreateVehicle(437,1081.4485,-1760.8590,13.1462,90.2767,125,1,17); //
	CreateVehicle(437,1081.4485,-1763.7651,13.1404,89.4898,125,1,17); //
	CreateVehicle(437,1673.3000488,-1111.3000488,24.27,90.0,3,6,17); // Coach
	CreateVehicle(437,1673.3000488,-1115.8000488,24.27,90.0,3,6,17); // Coach
	CreateVehicle(437,1673.3000488,-1120.3000488,24.27,90.0,3,6,17); // Coach
	BUS[1] = CreateVehicle(437,1673.3000488,-1129.3000488,24.27,90.0,3,6,17);
	
	TAXI[0] = CreateVehicle(420,1062.5682,-1737.3088,13.2596,269.3669,6,1,30); //
	CreateVehicle(420,1062.5293,-1740.2609,13.2506,270.3073,6,1,30); //
	CreateVehicle(420,1062.8466,-1743.2697,13.2413,269.5359,6,1,30); //
	CreateVehicle(420,1062.9149,-1746.1710,13.2376,270.3739,6,1,30); //
	TAXI[1] = CreateVehicle(420,1062.5900,-1749.0957,13.2291,270.1335,6,1,30); //
	
	dSchoolCar[0] =  CreateVehicle(436,-2068.5632,-84.3722,34.9247,0.0,2,1,15); //
	dSchoolCar[1] =  CreateVehicle(436,-2072.8613,-84.3771,34.9239,0.0,2,1,15); //
	dSchoolCar[2] =  CreateVehicle(436,-2077.1477,-84.3704,34.9227,0.0,2,1,15); //
	dSchoolCar[3] =  CreateVehicle(436,-2081.4104,-84.3706,34.9260,0.0,2,1,15); //
	dSchoolCar[4] =  CreateVehicle(436,-2085.6968,-84.3700,34.9182,0.0,2,1,15); //
	dSchoolCar[5] =  CreateVehicle(436,-2089.9785,-84.3745,34.9292,0.0,2,1,15); //
	dSchoolCar[6] =  CreateVehicle(436,-2094.2437,-84.3714,34.9323,0.0,2,1,15); //
	dSchoolCar[7] =  CreateVehicle(436,-2064.2437,-84.3714,34.9323,0.0,2,1,15); //
	//автосалон (добавляйте свои авто, это как пример взял координаты со своей копии Advance RP)
	salonCar[0] = CreateVehicle(466,524.09997559,-1291.19995117,17.20000076,358.00000000,-1,-1,15); //Glendale
	CreateVehicle(542,520.09997559,-1291.00000000,17.10000038,0.00000000,-1,-1,15); //Clover
	CreateVehicle(492,528.20001221,-1291.19995117,17.10000038,358.00000000,-1,-1,15); //Greenwood
	CreateVehicle(517,532.50000000,-1291.50000000,17.20000076,0.00000000,-1,-1,15); //Majestic
	CreateVehicle(516,537.20001221,-1291.19995117,17.10000038,0.00000000,-1,-1,15); //Nebula
	CreateVehicle(467,528.40002441,-1281.50000000,17.10000038,218.00000000,-1,-1,15); //Oceanic
	CreateVehicle(600,532.00000000,-1278.40002441,17.10000038,218.00000000,-1,-1,15); //Picador
	CreateVehicle(549,535.50000000,-1275.30004883,17.10000038,218.00000000,-1,-1,15); //Tampa
	CreateVehicle(529,538.90002441,-1272.50000000,17.00000000,217.99951172,-1,-1,15); //Willard
	CreateVehicle(404,542.29998779,-1270.00000000,17.10000038,218.00000000,-1,-1,15); //Perenniel
	CreateVehicle(474,546.09997559,-1267.30004883,17.10000038,214.00000000,-1,-1,15); //Hermes
	CreateVehicle(410,549.40002441,-1264.30004883,17.00000000,214.00000000,-1,-1,15); //Manana
	CreateVehicle(422,562.90002441,-1266.90002441,17.29999924,102.00000000,-1,-1,15); //Bobcat
	CreateVehicle(439,566.59997559,-1284.09997559,17.20000076,102.00000000,-1,-1,15); //Stallion
	CreateVehicle(479,565.50000000,-1280.00000000,17.10000038,102.00000000,-1,-1,15); //Regina
	CreateVehicle(535,563.79998779,-1271.09997559,17.10000038,102.00000000,-1,-1,15); //Slamvan
	CreateVehicle(543,564.79998779,-1275.69995117,17.20000076,102.00000000,-1,-1,15); //Sadler
	CreateVehicle(575,567.40002441,-1288.40002441,17.00000000,102.00000000,-1,-1,15); //Broadway
	CreateVehicle(545,541.70001221,-1291.90002441,17.20000076,0.00000000,-1,-1,15); //Hustler
	//Авторынок ЛВ
	CreateVehicle(415,2464.8501,1336.8545,10.5703,179.9057,92,1,15); // Cheetah
	CreateVehicle(451,2458.4028,1336.6525,10.5423,180.5343,75,75,15); // Turismo
	CreateVehicle(402,2452.0537,1336.4951,10.6452,179.9693,22,22,15); // Buffalo
	CreateVehicle(603,2441.4016,1335.8466,10.5739,269.7882,75,77,15); // Phoenix
	CreateVehicle(602,2441.4912,1342.3033,10.6432,269.9018,75,77,15); // Alpha
	CreateVehicle(587,2441.6323,1348.5996,10.5534,269.9821,43,1,15); // Euros
	CreateVehicle(565,2441.0203,1355.0502,10.4424,269.9498,53,53,15); // Flash
	CreateVehicle(506,2452.0708,1357.9529,10.5094,180.3630,76,76,15); // Super GT
	CreateVehicle(559,2458.5916,1357.9718,10.4974,183.3553,60,1,15); // Jester
	CreateVehicle(541,2464.9209,1358.2946,10.4560,179.8829,36,8,15); // Bullet
	CreateVehicle(560,2471.2883,1358.0541,10.5271,181.0412,37,0,15); // Sultan
	CreateVehicle(429,2464.9260,1345.6094,10.4979,0.6739,3,1,15); // Banshee
	CreateVehicle(480,2458.5212,1345.6292,10.6045,0.1458,2,2,15); // Comet
	CreateVehicle(477,2452.1135,1345.8264,10.6067,0.0098,101,1,15); // ZR-350
	//Авторынок в сф номер 2
	CreateVehicle(566,-1671.2559,1204.9709,13.4947,269.2117,52,8,15); // Tahoma
	CreateVehicle(567,-1679.2067,1209.1857,13.5766,224.3819,88,64,15); // Savanna
	CreateVehicle(475,-1667.8605,1222.2292,13.5229,225.2104,2,39,15); // Sabre
	CreateVehicle(418,-1664.4630,1225.2429,13.7967,225.2743,117,227,15); // Moonbeam
	CreateVehicle(496,-1658.5544,1218.8135,13.4196,133.6771,66,72,15); // Blista Compact
	CreateVehicle(533,-1656.0592,1216.0837,13.4135,133.3281,75,1,15); // Feltzer
	CreateVehicle(536,-1653.4425,1212.9457,13.4017,133.6770,12,1,15); // Blade
	CreateVehicle(580,-1665.9937,1223.8846,20.9756,224.2425,81,81,15); // Stafford
	CreateVehicle(534,-1656.7417,1215.8145,20.9038,134.4879,42,42,15); // Remington
	CreateVehicle(576,-1653.6145,1212.0641,20.8028,134.4139,68,96,15); // Tornado
	CreateVehicle(412,-1650.1639,1208.3586,21.0374,134.4998,10,8,15); // Voodoo
	CreateVehicle(589,-1679.4344,1210.1141,20.7956,224.3956,22,22,15); // Club
	//Авторынок в сф номер 1
	CreateVehicle(547,-1972.2865,305.8050,34.9069,180.5431,125,1,15); // Primo
	CreateVehicle(550,-1976.1804,305.7805,34.9786,180.6377,62,62,15); // Sunrise
	CreateVehicle(546,-1987.0177,305.6963,34.9074,266.2863,2,62,15); // Intruder
	CreateVehicle(540,-1987.1372,301.2328,35.0054,268.4373,62,62,15); // Vincent
	CreateVehicle(505,-1989.3586,274.2094,35.2675,265.5293,76,102,15); // Rancher
	CreateVehicle(458,-1989.5117,269.0619,35.0854,265.1158,109,1,15); // Solair
	CreateVehicle(445,-1989.9922,264.6067,35.0518,265.0577,39,39,15); // Admiral
	CreateVehicle(436,-1990.4752,260.7113,34.9809,262.3014,87,1,15); // Previon
	CreateVehicle(426,-1990.9091,256.5869,34.9336,263.4109,10,10,15); // Premier
	CreateVehicle(421,-1991.0225,252.4608,35.0522,263.3984,30,1,15); // Washington
	CreateVehicle(405,-1991.6276,248.5987,35.0724,265.2712,123,1,15); // Sentinel
	CreateVehicle(401,-1992.6053,244.6761,34.9261,268.0730,52,52,15); // Bravura
	CreateVehicle(400,-1992.9794,240.6355,35.2693,269.3254,75,1,15); // Landstalker
	CreateVehicle(526,-1983.4913,242.6596,34.9355,2.9345,17,1,15); // Fortune
	CreateVehicle(500,-1978.9174,243.0224,35.3096,3.2297,28,119,15); // Mesa
	CreateVehicle(527,-1974.1005,242.7277,34.8914,2.9718,66,1,15); // Cadrona
	CreateVehicle(585,-1971.6727,257.0345,34.7690,91.2679,53,53,15); // Emperor
	CreateVehicle(579,-1971.7782,261.8631,35.1700,90.2035,7,7,15); // Huntley
	salonCar[1] = CreateVehicle(562,-1971.2888,266.3994,34.8029,94.8772,101,1,15); // Elegy
}

load_other ()
{
    for(new as = 0; as < sizeof(dSchoolCar); as++)
    {
        dSchool3D[as] = Create3DTextLabel("УЧЕБНАЯ\n"W"Соблюдай дистанцию", error, 9999.0, 9999.0, 9999.0, 25.0, 0, 1);
        Attach3DTextLabelToVehicle(dSchool3D[as], dSchoolCar[as], 0, 0, 1.0);
	}
    
    //Кнопки армии
    knopka[0] = CreateButton(281.3709, 1826.7655, 18.1108,178.0);
	knopka[1] = CreateButton(288.5241, 1812.0925, 18.1108,0.0);
	knopka[2] = CreateButton( 341.02509, 1795.83496, 18.66630,-60.0000);
	knopka[3] = CreateButton(123.85858, 1934.96924, 19.81080,270.0000);
	knopka[4] = CreateButton(142.52209, 1941.69434, 19.84940,0.0000);
	knopka[5] = CreateButton(94.98350, 1919.27246, 18.55519, 180.0);
	knopka[6] = CreateButton(96.4407, 1918.2512, 18.6816,-90.0);
	//Кнопки армии
	new texts[256];
    format(texts,sizeof(texts),"\n"A"Металл: "W"%d кг.\n"A"Патроны: "W"%d шт.",army_material,army_patr);
	sv_3d = CreateDynamic3DTextLabel(texts,-1,308.0300,-168.6971,999.5938,25.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,0,-1,-1,-1,100.0);
	
	format(texts,sizeof(texts),""A"Боеприпасы: %d ящиков",avia_boe);
	avia_3d = CreateDynamic3DTextLabel(texts,-1,-1229.6161,442.3829,7.2921,25.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,0,-1,-1,-1,100.0);
	
	format(texts,sizeof(texts),"Количество сырья на складе: "I"%d кг\n"W"Готовых продуктов: "I"%d шт\n"W"Топливо: "I"%d л.\n\n"W"Загрузить продукты: /load",zmet,zprod,zfuel);
	factory_3D = CreateDynamic3DTextLabel(texts,white,-116.9392,-316.1367,2.7646,40.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,0,-1,-1,-1,100.0);

 	format(texts,sizeof(texts),"Склад:\n"W"Готовых продуктов: "I"%d шт.\n"W"Топливо: "I"%d л.",zmet,zprod);
	factory_int_3D = CreateDynamic3DTextLabel(texts,white,2565.5071,-1293.0293,1045.0704,40.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,0,2,-1,-1,100.0);
	//


	pd_actor[0] = CreateActor(301, 236.8725,79.7435,1005.0391,182.6003); // Actor as salesperson in Ammunation
	pd_actor[1] = CreateActor(301, 221.5632,124.3533,999.0156,183.1305); // Actor as salesperson in Ammunation
	pd_actor[2] = CreateActor(301, 269.5615,184.1093,1008.1719,4.6782); // Actor as salesperson in Ammunation
	pd_actor[3] = CreateActor(301, 269.5615,184.1093,1008.1719,4.6782); // Actor as salesperson in Ammunation
	ApplyActorAnimation(pd_actor[0], "SMOKING", "M_SMKLEAN_LOOP", 4.1, true, false, false, false, 0);//
	ApplyActorAnimation(pd_actor[1], "SMOKING", "M_SMKLEAN_LOOP", 4.1, true, false, false, false, 0);//
	ApplyActorAnimation(pd_actor[2], "SMOKING", "M_SMKLEAN_LOOP", 4.1, true, false, false, false, 0);//
	ApplyActorAnimation(pd_actor[3], "SMOKING", "M_SMKLEAN_LOOP", 4.1, true, false, false, false, 0);//
    SetActorVirtualWorld(pd_actor[0],1);//
    SetActorVirtualWorld(pd_actor[1],2);//
    SetActorVirtualWorld(pd_actor[2],3);//
    SetActorVirtualWorld(pd_actor[3],1);//
    Create3DTextLabel("Рик {CECFCE}(Оружейник)\nнажмите л.ALT", accept, 236.3725,79.7435,1005.0391+1.2, 15.0,1,1);
    Create3DTextLabel("Ричард {CECFCE}(Оружейник)\nнажмите л.ALT", accept, 221.5632,124.3533,999.0156+1.2, 15.0,2,1);
    Create3DTextLabel("Генри {CECFCE}(Оружейник)\nнажмите л.ALT", accept, 269.5615,184.1093,1008.1719+1.2, 15.0,3,1);
    Create3DTextLabel("Томми {CECFCE}(Помощник/Оружейник)\nнажмите л.ALT", accept, 269.5615,184.1093,1008.1719+1.2, 15.0,1,1);
    
    
}
load_pickup()
{
	//банды
	new texts[256];
	grove_pickup[0] = CreatePickup(1559,23,2459.4924,-1691.4744,13.5451);//стрелка3
    grove_pickup[1] = CreatePickup(1559,23,2468.4163,-1698.2432,1013.5078,6);//стрелка4
    grove_pickup[2] = CreateDynamicCP(2454.7349,-1706.6416,1013.5078,1.0,6, 2, -1,10.0);
    format(texts,sizeof(texts),"Склад Grove St.:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[0][0],s_band[0][1],s_band[0][2]);
	store_b3D[0] = CreateDynamic3DTextLabel(texts,info,2454.7349,-1706.6416,1013.5078,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,6,2,-1,100.0);

    ballas_pickup[0] = CreatePickup(1559,23,-68.8021,1351.1979,1080.2109,5);//Ballas на улицу
    CreateObject(3648, 2258.64819, -1435.54578, 25.66650,   0.00000, 0.00000, -188.00000);//дом баллас
	ballas_pickup[1] = CreatePickup(1559,23,2263.9446,-1437.5864,24.4232);//Ballas в интерьр
	ballas_pickup[2] = CreateDynamicCP(-71.3852,1366.8890,1080.2185,1.0,5, 6, -1,10.0);
	format(texts,sizeof(texts),"Склад E.S Ballas:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[1][0],s_band[1][1],s_band[1][2]);
	store_b3D[1] = CreateDynamic3DTextLabel(texts,info,-71.3852,1366.8890,1080.2185,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,5,6,-1,100.0);

	rifa_pickup[0] = CreatePickup(1559,23,2807.6199,-1174.7549,1025.5703,8);//Рифа вход на улицу
	rifa_pickup[1] = CreatePickup(1559,23,2522.7188,-2019.0292,14.0744);//Рифа вход
	rifa_pickup[2] = CreateDynamicCP(2807.6169,-1165.1321,1025.5703,1.0,8, 8, -1,10.0);
	format(texts,sizeof(texts),"Склад The Rifa:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[2][0],s_band[2][1],s_band[2][2]);
	store_b3D[2] = CreateDynamic3DTextLabel(texts,info,2807.6169,-1165.1321,1025.5703,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,8,8,-1,100.0);
	
	el_corona_pickup[0] = CreatePickup(1559,23,1684.8256,-2098.4854,13.8343);//Банда ел коронос
	el_corona_pickup[1] = CreatePickup(1559,23,-42.5856,1405.4747,1084.4297,6);//Банда ел коронос
    el_corona_pickup[2] = CreateDynamicCP(-45.6859,1412.7735,1084.4297,1.0,6,8, -1,10.0);
    format(texts,sizeof(texts),"Склад El Corona:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[3][0],s_band[3][1],s_band[3][2]);
	store_b3D[3] = CreateDynamic3DTextLabel(texts,info,-45.6859,1412.7735,1084.4297,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,6,8,-1,100.0);

    vagos_pickup[0] = CreatePickup(1559,23,2407.9475,-1106.9360,40.2957);//Vagos вход
	vagos_pickup[1] = CreatePickup(1559,23,299.7803,310.0724,1003.3047,7);//Vagos выход
	vagos_pickup[2] = CreateDynamicCP(310.6903,304.4453,1003.3047,1.0,7, 4, -1,10.0);
	format(texts,sizeof(texts),"Склад L.S Vagos:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[4][0],s_band[4][1],s_band[4][2]);
	store_b3D[4] = CreateDynamic3DTextLabel(texts,info,310.6903,304.4453,1003.3047,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,7,4,-1,100.0);

	//мафии
	rm_pickup[0] = CreatePickup(1559,23,-2721.1475,-320.5466,7.8438);
	rm_pickup[1] = CreatePickup(1559,23,1298.9436,-796.6907,1084.0078,1);
	rm_pickup[2] = CreateDynamicCP(1265.8268,-779.6341,1084.0078,1.0,1, 5, -1,10.0);
	format(texts,sizeof(texts),"Склад Русской мафии:\n\n"W"Наркотики:"I" %d гр.\n"W"Деньги: "I"%d$",store_mafia[0][0],store_mafia[0][1]);
	store_m3D[0] = CreateDynamic3DTextLabel(texts,info,1265.8268,-779.6341,1084.0078,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,1,5,-1,100.0);

	lcn_pickup[0] = CreatePickup(1559,23,1456.7430,2773.3560,10.8203);
	lcn_pickup[1] = CreatePickup(1559,23,1298.9436,-796.6907,1084.0078,2);
	lcn_pickup[2] = CreateDynamicCP(1265.8268,-779.6341,1084.0078,1.0,2, 5, -1,10.0);
	format(texts,sizeof(texts),"Склад La Cosa Nostra:\n\n"W"Наркотики:"I" %d гр.\n"W"Деньги: "I"%d$",store_mafia[1][0],store_mafia[1][1]);
	store_m3D[1] = CreateDynamic3DTextLabel(texts,info,1265.8268,-779.6341,1084.0078,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,2,5,-1,100.0);

	yakuza_pickup[0] = CreatePickup(1559,23,2481.5222,1525.4670,11.7535);
	yakuza_pickup[1] = CreatePickup(1559,23,1298.9436,-796.6907,1084.0078,3);
	yakuza_pickup[2] = CreateDynamicCP(1265.8268,-779.6341,1084.0078,1.0,3,5, -1,10.0);
	format(texts,sizeof(texts),"Склад Yakuza:\n\n"W"Наркотики:"I" %d гр.\n"W"Деньги: "I"%d$",store_mafia[2][0],store_mafia[2][1]);
	store_m3D[2] = CreateDynamic3DTextLabel(texts,info,1265.8268,-779.6341,1084.0078,15.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,1,3,5,-1,100.0);

	//радиоцентр
    smi_pickup[0] = CreatePickup(1559,23,1653.9308,-1655.2087,22.5156);//сми гл. входw
    smi_pickup[1]  = CreatePickup(1559,23,1700.6999511719,-1667.9000244141,20.2,1);//сми гл. выход
	//Армия  склад
    _stock[0] = CreatePickup(1559,23,143.4809,1895.2067,18.4457);//стрелка3
    _stock[1] = CreatePickup(1559,23,316.3806,-170.2857,999.938,4);//стрелка4
    cp_sv = CreateDynamicCP(308.0300,-168.6971,999.5938,1.0,4, 6, -1,10.0);
    non_pick_boe = CreatePickup(19300,23,308.0300,-168.6971,999.5938,4);//
	//fbi
	fbi[0] = CreatePickup(1559,2,-2455.3201,503.9391,30.0781);//фбр вход
	fbi[1] = CreatePickup(1559,2,288.7791,166.9667,1007.1719,1);//фбр выход
    //_cop
    lspd[0] = CreatePickup(1559,23,1555.1332,-1675.7180,16.1953);//Lspd вход
	lspd[1] = CreatePickup(1559,23,246.7096,62.8786,1003.6406,1);//Lspd выход
	lspd[4] = CreatePickup(1559,23,316.6778,-170.0422,999.5938,1);//Lspd вых из аммо
	lspd[5] = CreatePickup(1559,23,1568.6144,-1689.9901,6.2188);//Lspd Вход из гаража
	lspd[3] = CreatePickup(1559,23,242.2486,66.3598,1003.6406,1);//Lspd выход в гараже
	sfpd[0]  = CreatePickup(1559,23,316.3047,-170.2971,999.5938,2);//sfpd выход в гараже
	sfpd[1]  = CreatePickup(1559,23,213.9762,120.8990,999.0156,2);//sfpd выход в гараже
	sfpd[2] = CreatePickup(1559,23,-1594.2096,716.1803,-4.9063);//sfpd
	sfpd[3] = CreatePickup(1559,23,246.4636,107.2969,1003.2188);//sfpd
	lvpd[0] = CreatePickup(1559,23,2282.3262,2423.2681,3.4766);//lvpd вход с гаража
	lvpd[1] = CreatePickup(1559,23,238.7510,138.6254,1003.0234,3);//lvpd вход в гараж
	lvpd[2] = CreatePickup(1559,23,2337.1335,2459.3105,14.9742);//Центральный вход
	lvpd[3] = CreatePickup(1559,23,288.8456,166.9235,1007.1719,3);//Центральный выход

	//__банк
	bank_pick[0] = CreatePickup(1559,23,1411.9696,-1699.7964,13.5395);//банк вход
	bank_pick[1] = CreatePickup(1559,23,2304.6724,-16.0176,26.7422,2);//банк выход
	bank_pick[2] = CreateDynamicCP(2316.6177,-12.6103,26.7422,1.5, 2, 0, -1,15.0);//услуги
	bank_pick[3] = CreateDynamicCP(-2166.1099,646.1111,1052.3750,1.5, 2, 0, -1,15.0);//услуги
	//ЗАВОД
    pickFactory[0] = CreatePickup(1559,23,-86.2907,-299.8330,2.7646);// Aoia
	pickFactory[1] = CreatePickup(1559,23,2577.1343,-1289.8965,1044.1,2);//Выход
	pickFactory[2] = CreatePickup(2704,23,2569.6714,-1283.5266,1044.1250,2);//Устройство
	CreateDynamic3DTextLabel("Устройство на работу",info,2569.6714,-1283.5266,1044.1250,10.0,INVALID_PLAYER_ID,INVALID_PLAYER_ID,0,2,-1,-1,100.0);
	
	useProd[1] = CreatePickup(1559,23,2551.1204,-1300.0930,1044.1250,2);
    useProd[2] = CreatePickup(1559,23,2559.1130,-1300.0895,1044.1250,2);
    useProd[3] = CreatePickup(1559,23,2543.0723,-1300.0941,1044.1250,2);
    useProd[4] = CreatePickup(1559,23,2543.1548,-1287.2231,1044.1250,2);
    useProd[5] = CreatePickup(1559,23,2551.1267,-1287.2209,1044.1250,2);
    useProd[0] = CreatePickup(1559,23,2559.1338,-1287.2196,1044.1250,2);
	CreateDynamicCP(2558.5881,-1295.8517,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2556.1011,-1295.8510,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2553.7939,-1295.8531,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2544.3843,-1295.8563,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2541.9963,-1295.8523,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2542.2380,-1290.9963,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2544.4521,-1290.9703,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2553.8679,-1291.0043,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2556.1863,-1291.0042,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2558.4622,-1290.9938,1044.1250,0.3,-1,-1,-1,0.5);
    CreateDynamicCP(2564.7886,-1292.9886,1044.1250,2.0,-1,-1,-1,3.0);
	//
	
	

    meria[0] = CreatePickup(1559, 23, 1481.1272,-1771.6830,18.7958);
	meria[1] = CreatePickup(1559, 23, 390.7655,173.7115,1008.3828,1);

    job_invite = CreateDynamicCP(370.1880,187.5764,1008.3893,1.0, -1, -1, -1,20.0);
    
    pick_as[0] = CreatePickup(1559,23,-2026.5902,-101.8477,35.1641);//автошкола вход
	pick_as[1] = CreatePickup(1559,23,-2026.8085,-103.6107,1035.1798,1);//автошкола выход
	pick_as[2] = CreateDynamicCP(-2026.8127,-114.4434,1035.1719,1.5, 1, 3, -1,10.0); //автошкола тест
	
	metro_pick_vhod[0] = CreatePickup(1559, 23, 1207.5380,-1754.8390,13.5882); // метро вход 1
	metro_pick_vhod[1] = CreatePickup(1559, 23, 1211.5953,-1750.2222,13.5941); // метро вход 2
	CreateDynamic3DTextLabel("Метро\n{FFFFFF}Для входа встаньте на пикап", COLOR_GREEN, 1207.5380,-1754.8390,13.5882, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
	CreateDynamic3DTextLabel("Метро\n{FFFFFF}Для входа встаньте на пикап", COLOR_GREEN, 1211.5953,-1750.2222,13.5941, 10.0, INVALID_PLAYER_ID,INVALID_VEHICLE_ID,1,-1,-1);
	CreateDynamicMapIcon(1205.1257,-1748.0521,13.5926,26,0,-1,-1,-1, 200.0);
	
	
    
}

map_load_spawn()
{
	CreateObject(3861,1220.59802,-1696.80701,13.719,0,0,0); /// object (marketstall01_SFXRF) (1) ///
	CreateObject(2222,1221.79199,-1697.63403,13.433,0,0,0); /// object (rustyhigh) (1) ///
	CreateObject(2647,1220.10596,-1697.18396,13.521,0,0,0); /// object (CJ_BS_CUP) (1) ///
	CreateObject(2814,1220.63306,-1697.72803,13.365,0,0,0); /// object (GB_takeaway01) (1) ///
	CreateObject(2838,1223.06934,-1697.37988,12.30482,0,0,0); /// object (GB_takeaway03) (1) ///
	CreateObject(2837,1224.66699,-1700.34302,12.547,0,0,0); /// object (GB_takeaway02) (1) ///
	CreateObject(2838,1217.04895,-1699.53003,12.547,0,0,0); /// object (GB_takeaway03) (2) ///
	CreateObject(2769,1221.68896,-1697.91296,13.384,0,0,0); /// object (CJ_CJ_BURG2) (1) ///
	CreateObject(2768,1220.36499,-1697.14197,13.407,0,0,0); /// object (CJ_CB_BURG) (1) ///
	CreateObject(2453,1219.41101,-1697.52405,13.743,0,0,0); /// object (CJ_PIZZA_DISPf) (1) ///
}

forward timer_sec();
public timer_sec()
{
	new tf[3];
	gettime(tf[0],tf[1],tf[2]);
	if(tf[1] == 0 && tf[2] == 0) PayDay();
	
	gz_timer();//единный таймер gz
	
	foreach(Player, i)
	{
	    new stringF[50];
	  	if(GetPVarInt(i,"AFK_Tick") > 10000) SetPVarInt(i,"AFK_Tick",1), SetPVarInt(i,"AFK_Check",0);
	  	if(GetPVarInt(i,"AFK_Check") < GetPVarInt(i,"AFK_Tick") && GetPlayerState(i)) SetPVarInt(i,"AFK_Check",GetPVarInt(i,"AFK_Tick")), SetPVarInt(i,"AFK_Time",0);
	  	if(GetPVarInt(i,"AFK_Check") == GetPVarInt(i,"AFK_Tick") && GetPlayerState(i))
	  	{
	        SetPVarInt(i,"AFK_Time",GetPVarInt(i,"AFK_Time") + 1);
		    if(GetPVarInt(i, "AFK_Time") > 2)
	        {
	            format(stringF,sizeof(stringF), "ESC: %s",ConvertTime(GetPVarInt(i,"AFK_Time")-2));
				SetPlayerChatBubble(i, stringF, info, 30.0, 1200);
	        }
	  	}
	  	if(GetPVarInt(i,"AFK_Time") >= 1200 && p_info[i][admin] == 0) SendClientMessage(i,error, "Вы слишком долго находитесь в AFK. Отключены от сервера (/q)"), Kick(i);//1200 - 20 мин
	  	
	  	if(GetPlayerSpecialAction(i) == SPECIAL_ACTION_DRINK_WINE || GetPlayerSpecialAction(i) == SPECIAL_ACTION_DRINK_BEER)
		{
		    SetPVarInt(i, "drink",GetPVarInt(i, "drink")+1);
			if(GetPVarInt(i, "drink") == 25) SetPlayerSpecialAction(i,0);
		}
		if(GetPVarInt(i,"Conv")) OnPlayerInConvoi(i);
	}
	if(tf[2] == 0)
	{
	    avia_boe += 2;
	    _@3DTEXT();
		for(new v = 0;v<MAX_VEHICLES;v++) {
			if(GetVehicleModel(v) != 481 || GetVehicleModel(v) != 510 || GetVehicleModel(v) != 509)
			{
				GetVehicleParamsEx(v,engine,lights,alarm,doors,bonnet,boot,objective);
				if(engine == 1)
				{
					if(fuel_car[v] > 0) fuel_car[v]--;
					else SetVehicleParamsEx(v,0,lights,alarm,doors,bonnet,boot,objective);
				}
			}
		}
		tf[2] = 1;
	}
}

public OnGameModeExit()
{
    for(new h = 0; h < totalhouses; h++) save_house(h);
    biz_save();
    other_save();
    SaveVehicles();
	return 1;
}

public OnPlayerRequestClass(playerid, classid)
{
	SendClientMessage(playerid, white, "Добро пожаловать на "I""SERVER"");
    GetPlayerName(playerid, p_info[playerid][name], MAX_PLAYER_NAME);
	new query_string[52+MAX_PLAYER_NAME];
	format(query_string, sizeof(query_string), "SELECT * FROM `accounts` WHERE `name` = '%s'", p_info[playerid][name]);
	mysql_tquery(con_bd, query_string, "find_table","i", playerid);
	SetSpawnInfo(playerid, 255, p_info[playerid][skin], 0, 0, 0, 1.0, -1, -1, -1, -1, -1, -1);
	SetPlayerCameraPos(playerid, 1678.2035, -1481.4669, 110.1527);// положение камеры при регистрации
    SetPlayerCameraLookAt(playerid, 1614.6501, -1576.7792, 88.1527);// положение камеры при регистрации
	return 1;
}

public OnPlayerConnect(playerid)
{
	//обнуление
    GetPlayerRentBus[playerid] = 	-1;
    GetPlayerRentTaxi[playerid] = 	-1;
    GetCarDelivery[playerid] = 		-1;
    p_info[playerid][veh_id] = 		60605;
    SetPVarInt(playerid, "race_check",-1);
    SetPVarInt(playerid, "called",60605);
    SetPVarInt(playerid, "biz_zakaz", -1);
	SetPVarInt(playerid,"pred",60605);
	SetPVarInt(playerid,"id_gang",INVALID_PLAYER_ID);
	//
	
	set_TextDrawPlayer(playerid);//Показываем текстдрав
	remove_build(playerid);//Удаляем объекты
	PreloadAllAnims(playerid);//Загружаем анимаци
	//
	
	for(new i = 0; i < TOTALGZ; i++) GangZoneShowForPlayer(playerid, GangZone[i], gz_color(i));//отображаем гангзоны
    return 1;
}

public OnPlayerDisconnect(playerid, reason)
{
	EndPlayerCasualJob(playerid);//Увольняем с работы
    if(GetPVarInt(playerid, "MASK_ON")) @maskOFF(playerid); //удаляем таймер
    save_player(playerid);//сохраняем аккаунт
    
    if(GetPVarInt(playerid,"Conv"))// если под конвоем был, оповещаем копа
	{
		SendClientMessage(GetPVarInt(playerid,"Ved"), server, "Конвой: "E"Арестованный погиб. Конвой прекращён.");
  		SetPVarInt(playerid,"Ved",0);
		SetPVarInt(playerid,"Conv",0);
		TogglePlayerControllable(playerid, true);
		ClearAnimations(playerid);
	}
    if(GetPVarInt(playerid,"cuff") == 1) //выход при арресте
    {
        new string[144];
		p_info[playerid][jail_time] += 300*4;
		p_info[playerid][jail] = 1;
		format(string,sizeof(string),"%s выходит при аресте (+20 минут тюрьмы)",get_name(playerid));
		SendClientMessageToAll(0x007fffff, string);
	}
    //
    if(GetPVarInt(playerid,"called") != 60605)//собеседник по телефону вышел
    {
        SendClientMessage (GetPVarInt(playerid,"called"), error, "Игрок вышел с сети, звонок прекращен" );
        SetPlayerSpecialAction (GetPVarInt(playerid,"called"), SPECIAL_ACTION_STOPUSECELLPHONE );
        DeletePVar(GetPVarInt(playerid,"called"), "talk");
        SetPVarInt(GetPVarInt(playerid,"called"), "called" ,60605);
    }
    return 1;
}
stock PayDay()
{
	new hour,minute,second;
	gettime(hour,minute,second);
	SetWorldTime(hour+1);
	if(hour == 21)
	{
	    for(new h = 0; h < totalhouses; h++)
		{
			if(h_info[h][h_owned] == 1)
			{
			    h_info[h][h_rent] --;
			    save_house(h);
			}
		}
		for(new b = 0; b < totalbiz; b++)
		{
			if(b_info[b][_owned] == 1)
			{
			    b_info[b][_colvo] --;
			    biz_save();
			}
		}
	}
	for(new i = GetMaxPlayers() - 1; i != -1; i--)
	{
		if(IsPlayerConnected(i))
		{
		    new str[128];
			p_info[i][exp] ++;
			if(p_info[i][exp] == (p_info[i][level]+1)*4)
			{
				p_info[i][level] += 1;
				p_info[i][exp] = 0;
				SendClientMessage(i,info,"Поздравляем! Ваш уровень повысился.");
				SetPlayerScore(i,p_info[i][level]);
				continue;
			}
			format(str,sizeof(str),"Текущее время: {42aaff}%s%d:%s%d", (hour < 10) ? ("0") : (""), hour, (minute < 10) ? ("0") : (""), minute, (second < 10) ? ("0") : (""), second);
			SendClientMessage(i, -1,str);
			SendClientMessage(i, info,"  БАНКОВСКИЙ ЧЕК");
			SendClientMessage(i, white,"_____________________________");
			if(gos(i)) format(str,sizeof(str),"Зарплата: "I"%d$",p_info[i][rang]*100),SendClientMessage(i, white,str);
			format(str,sizeof(str),"Текущий баланс счета: "I"%d$",p_info[i][bank]),SendClientMessage(i, white,str);
			SendClientMessage(i, white,"_____________________________");
		}
	}
	return true;
}

public OnPlayerSpawn(playerid)
{
    if(GetPVarInt(playerid, "LOGGED") == 0) return Kick(playerid);//Проверка на авторизацию | Если не авторизовался, но нажал SPAWN - кик
   	SetPlayerHealth(playerid,20+random(30)); // Выдача жизни 20+ рандом от 0 до 30
	SetPlayerScore(playerid,p_info[playerid][level]); //выдача LVL в tab статистику
	
	SetPVarInt(playerid, "HouseOffer",60635);
	SetPVarInt(playerid, "bizOffer",60635);
	SetPVarInt(playerid, "my_id",60635);
	SetPVarInt(playerid, "pred",60605);
	
	if(cop(playerid)) SetPVarInt(playerid,"KEYS",1);//Если коп, выдаем ключ от дверей.
	
	
   	if(GetPVarInt(playerid, "@skin_reg") == 1)
    {
        SetPlayerPos(playerid, 1097.9906,1622.2844,12.5469);//позиция игрока
    	SetPlayerFacingAngle(playerid, 0.4727);//поворот
    	SetPlayerCameraPos(playerid, 1097.7706,1625.2844,12.5469);//позиция камеры
    	SetPlayerCameraLookAt(playerid, 1098.7706,1600.2844,15.5469);//позиция камеры
	   	SetPlayerSkin(playerid, skinMan[0][0]);
	   	SetPVarInt(playerid, "@clothes",0);
	    TogglePlayerControllable(playerid, 0);
		TextDrawShowForPlayer(playerid,skinTextDraw[playerid][1]);
	    TextDrawShowForPlayer(playerid,skinTextDraw[playerid][2]);
	    TextDrawShowForPlayer(playerid,skinTextDraw[playerid][0]);
		SelectTextDraw(playerid, 0x4169E1FF);
		return 1;
	}
	
	if(p_info[playerid][member] >= 1) SetPlayerSkin(playerid,p_info[playerid][fskin]); //выдаем фракционный скин
	if(p_info[playerid][member] == 0) SetPlayerSkin(playerid,p_info[playerid][skin]);//выдаем скин если без фракции
	switch(p_info[playerid][spawn])
	{
	    case 0:
	    {
	        SetPlayerInterior(playerid,0);
			SetPlayerVirtualWorld(playerid,0);
			SetCameraBehindPlayer(playerid);
			switch(random(2))
			{
			    case 0:
			    {
					SetPlayerPos(playerid, 1239.2157, -1692.6080, 16.1868);
					SetPlayerFacingAngle(playerid, 269.7984);
			    }
			    case 1:
			    {
					SetPlayerPos(playerid, 1246.4846,-1692.6262,16.2064);
					SetPlayerFacingAngle(playerid, 88.0215);
			    }
			}
		}
		case 2:
		{
		    SetPlayerInterior(playerid,h_info[p_info[playerid][keyh]][h_int]);
			SetPlayerPos(playerid, h_info[p_info[playerid][keyh]][h_exit][0], h_info[p_info[playerid][keyh]][h_exit][1],h_info[p_info[playerid][keyh]][h_exit][2]);
			SetPlayerVirtualWorld(playerid, p_info[playerid][keyh]+50);
		}
		case 3: fracSpawn(playerid);
	}
	return 1;
}

public OnPlayerDeath(playerid, killerid, reason)
{
    for(new i; i < 6; i ++) PlayerTextDrawHide(playerid,speedTD[playerid][i]);
    KillTimer(GetPVarInt(playerid, "SPEED"));
    EndPlayerCasualJob(playerid);
    if(GetPVarInt(playerid, "MASK_ON")) @maskOFF(playerid);
    if(INVALID_PLAYER_ID != killerid)
	{
		new bandkiller = (p_info[killerid][leader] != 0) ? (p_info[killerid][leader]) : (p_info[killerid][member]);
		new bandkill = (p_info[playerid][leader] != 0) ? (p_info[playerid][leader]) : (p_info[playerid][member]);
        for(new i = 0; i < sizeof(gangzone_Info); i++)
        {
            if(IsPlayerToSquare(playerid,gangzone_Info[i][gCoords][0], gangzone_Info[i][gCoords][1],gangzone_Info[i][gCoords][2],gangzone_Info[i][gCoords][3]))
            {
				if(bandkiller != bandkill)
				{
				    if(bandkiller < sizeof(capture_info) && bandkill < sizeof(capture_info))
				    {
						if(capture_info[bandkiller][capture] && capture_info[bandkill][capture] == 1)
						{
							if(capture_info[bandkiller][captureid] == capture_info[bandkill][captureid])
							{
								new str[128];
								capture_info[bandkiller][score] = capture_info[bandkiller][score]+1;
						        format(str,sizeof(str),"%s[%d] погиб на территории",get_name(playerid),playerid);
						        SendFamilyMessage(p_info[playerid][member],0xFF6600FF,str);
						        format(str,sizeof(str),"%s[%d] убил на территории %s",get_name(killerid),killerid,get_name(playerid),playerid);
						        SendFamilyMessage(p_info[killerid][member],accept,str);
							}
						}
					}
				}
			}
		}
	}
    if(p_info[playerid][wanted] > 0 && killerid != INVALID_PLAYER_ID)
	{
		if(cop(killerid))
		{
            p_info[playerid][jail] = 1;
			p_info[playerid][jail_time] = GetPlayerWantedLevel(playerid)*300;
			if(p_info[playerid][jail] == 1)
			{
				SetPlayerInterior(playerid, 6);
			  	SetPlayerVirtualWorld(playerid, 1),SetPlayerPos(playerid, 264.6288,77.5742,1001.0391);
			  	SetPVarInt(playerid,"Cuff",0);
				SetPlayerCuffed(playerid, false);
				TogglePlayerControllable(playerid, true);
				p_info[playerid][wanted] = 0;
				SetPlayerWantedLevel(playerid, 0);
			}
		}
	}
	SetPVarInt(playerid, "weap_cop",0);
    if(GetPVarInt(playerid,"Conv")) SendClientMessage(GetPVarInt(playerid,"Ved"), server, "Конвой: "E"Арестованный вышел из игры. Конвой прекращён.");
	return 1;
}

public OnVehicleSpawn(vehicleid)
{
    if(boats@pripas[vehicleid] != 0) Delete3DTextLabel(boats3dtext[vehicleid]), boats@pripas[vehicleid] = 0;
    engine_car[vehicleid] =0;
    VehSpwn(vehicleid);
	return 1;
}

public OnVehicleDeath(vehicleid, killerid)
{
    if(boats@pripas[vehicleid] != 0) Delete3DTextLabel(boats3dtext[vehicleid]), boats@pripas[vehicleid] = 0;
    foreach(Player, i)
	{
	    if(IsPlayerConnected(i))
	    {
    		if(vehicleid == GetCarDelivery[i] || vehicleid == GetPlayerRentBus[i] || vehicleid == GetPlayerRentTaxi[i])
			{
			    EndPlayerCasualJob(i);
			    SendClientMessage(i,error, "Твой рабочий транспорт был уничтожен. Работа завершена!");
				break;
			}
		}
	}
	return 1;
}


public OnPlayerText(playerid, text[])
{
    if(p_info[playerid][mute] > 0)
	{
		SendClientMessage(playerid, error, "Время молчанки еще не истекло");
		return 0;
	}
	new str[144];
	if(GetPVarInt(playerid,"news") == 1)
	{
    	format(str,sizeof(str),"[ЭФИР] %s[%d]: %s",get_name(playerid),playerid,text),SendClientMessageToAll(0x007fffff, str);
		return 0;
	}
    if(GetPVarInt(playerid, "called") != 60605)
    {
        if (IsPlayerConnected(GetPVarInt(playerid, "called")) )
        {
            if(GetPVarInt(GetPVarInt(playerid, "called"),"talk"))
            {
                f(str, "[Телефон] %s: %s", get_name(playerid), text );
                SendClientMessage(GetPVarInt(playerid, "called"),white,str);
                SendClientMessage(playerid,white, str);
                return false;
            }
        }
    }
	return 1;
}

public OnPlayerCommandText(playerid, cmdtext[]) return 1;
public OnPlayerCommandPerformed(playerid, cmdtext[], success)
{
    if(GetPVarInt(playerid, "LOGGED") == 0) return SendClientMessage(playerid,error, "Необходимо авторизоваться!");
	return 1;
}

CMD:menu(playerid) return ShowPlayerDialog(playerid, 4, DIALOG_STYLE_LIST, "Меню персонажа", "Статистика\nНастройки\nКоманды\nОтправить жалобу/вопрос", "Выбор", "Закрыть");
CMD:m(playerid) return cmd_menu(playerid);

CMD:gps(playerid)
{
    if(GetCarDelivery[playerid] != -1 || GetPlayerRentBus[playerid] != -1 || GetPlayerRentTaxi[playerid] != -1) return SendClientMessage(playerid, error, "Нельзя использовать во время активной работы");
	DisablePlayerRaceCheckpoint(playerid);
	return ShowPlayerDialog(playerid, 111,2, "Навигатор", "Общественные места\nФракции","Далее","Закрыть");
}

CMD:pay(playerid,params[])
{
	new str[144];
    if(!IsPlayerConnected(playerid)) return 1;
    if(sscanf(params, "dd", params[0], params[1])) return SendClientMessage(playerid,error, "Используйте: /pay [id] [cумма]");
    if(p_info[playerid][level] < 2) return SendClientMessage(playerid, error, "Команда доступна с 2-го уровня.");
    if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не найден");
	if(params[1] > 5000) return SendClientMessage(playerid, error, "Нельзя передать больше 5.000$");
    if(distance(playerid, params[0]) > 5.0) return SendClientMessage(playerid, error,"Игрок далеко от Вас");
	if(p_info[playerid][cash] < params[1]) return SendClientMessage(playerid, error,"У вас нет столько денег");
	set_money(playerid, -params[1]);
	set_money(params[0], params[1]);
	f(str,"Вы передали %s деньги в размере %d$",get_name(params[0]),params[1]);
	SendClientMessage(playerid, error,str);
	f(str,"%s передал Вам деньги в размере %d$",get_name(playerid),params[1]);
	SendClientMessage(params[0], error,str);
	ApplyAnimation(playerid,"DEALER","shop_pay",4.1, 0, 1, 1, 0, 0, 1);
	return 1;
}
CMD:sellmybiz(playerid,params[])
{
	new string[144];
    if(b_info[p_info[playerid][key]][_zakaz] > 0)return SendClientMessage(playerid, error, "Вы не можете продать бизнес, т.к заказали продукты, откажитесь от заказа");
 	if(GetPVarInt(playerid,"pred") != 60605) return SendClientMessage(playerid, error, "Вы уже делали предложение. Чтобы отменить его нажмите N");
 	
	if (!IsPlayerInRangeOfPoint(playerid, 5.0,b_info[p_info[playerid][key]][b_enter][0],b_info[p_info[playerid][key]][b_enter][1], b_info[p_info[playerid][key]][b_enter][2]))return SendClientMessage(playerid, error, "Вы далеко от своего бизнеса");
    if(sscanf(params, "dd", params[0], params[1])) return SendClientMessage(playerid, error, "Используйте /sellmybiz [id] [cyмма]");
	if(params[1] < 1000) return SendClientMessage(playerid, error, "Нельзя продать меньше чем за 1000$!");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Игрок не найден!");
	if(p_info[params[0]][key] != -1) return SendClientMessage(playerid, error, "У игрока уже есть бизнес");
	if (!IsPlayerInRangeOfPoint(params[0], 5.0, b_info[p_info[playerid][key]][b_enter][0],b_info[p_info[playerid][key]][b_enter][1], b_info[p_info[playerid][key]][b_enter][2]))return SendClientMessage(playerid, error, "Игрок которому вы хотите продать, далеко от вашего бизнеса");
	if(params[0] == playerid) return SendClientMessage(playerid,error, "Запрещено продавать самому себе");
	f(string, "Вы предложили %s купить Ваш бизнес за "W"%d$.",get_name(params[0]),params[1]);
	SendClientMessage(playerid, info, string);
	f(string, "%s предлагает Вам купить его бизнес за "W"%d$.",get_name(playerid),params[1]);
	SendClientMessage(params[0], info, string);
	SendClientMessage(params[0], -1, "Нажмите {03c03c}Y "W"чтобы купить его или {ff7518}N "W"для отказа");
	SetPVarInt(params[0],"bizOffer", playerid);
	SetPVarInt(params[0],"bizPrice", params[1]);
	SetPVarInt(params[0],"bizpokup",1);
	SetPVarInt(playerid,"pred",60605);
	return 1;
}

CMD:sellgun(playerid,params[])
{
	new str[144],weap[32],
	 			   result;
    if(!IsPlayerConnected(playerid)) return 1;
    if(!gang(playerid)) return SendClientMessage(playerid,error, "Вам не доступна данная функция!");
    if(GetPVarInt(playerid,"pred") != 60605) return SendClientMessage(playerid,error, "Вы уже делали предложение, нажмите N для отмены!");
    if(sscanf(params, "uiii", params[0], params[1], params[2], params[3])) return SendClientMessage(playerid,error, "Используй /sellgun [ID] [номер оружия] [кол-во патрон] [цена]");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid,error, "Данный игрок не найден");
	if(distance(playerid, params[0]) > 6.0) return SendClientMessage(playerid,error, "Данный игрок находится далеко от Вас");
	
	if(params[2] > p_info[playerid][patr]) return SendClientMessage(playerid,error,"Недостаточно патрон");
	if(params[1] == 1) SetPVarInt(playerid, "material", 5);
	if(params[1] == 2) SetPVarInt(playerid, "material", 7);
	if(params[1] == 3) SetPVarInt(playerid, "material", 9);
	if(params[1] == 4) SetPVarInt(playerid, "material", 11);
	if(params[1] == 5) SetPVarInt(playerid, "material", 13);
	if(params[1] == 6) SetPVarInt(playerid, "material", 14);
	if(params[1] == 7) SetPVarInt(playerid, "material", 16);
	switch(params[1])
	{
	    case 1: result = 23;
	    case 2: result = 24;
	    case 3: result = 29;
	    case 4: result = 25;
	    case 5: result = 30;
	    case 6: result = 31;
	    case 7: result = 33;
	}
	if(p_info[playerid][material] < GetPVarInt(playerid, "material")) return SendClientMessage(playerid,error,"Недостаточно материалов");
	SetPVarInt(params[0],"gun_id",result);
	GetWeaponName(result,weap,sizeof(weap));
	f(str, "%s предлагает вам купить %s [%d патрон] за %d$", get_name(playerid), weap,params[2],params[3]);
	SendClientMessage(params[0], accept, str);
	SendClientMessage(params[0], white, "Нажмите {03c03c}Y "W"для согласия или {ff7518}N "W"для отказа");
	f(str, "Вы предложили %s купить %s [%d патрон] за %d$", get_name(params[0]), weap,params[2],params[3]);
	SendClientMessage(playerid, accept, str);

	SetPVarInt(params[0],"patron",params[2]);
    SetPVarInt(params[0],"price_gun",params[3]);
    SetPVarInt(params[0],"id_gang",playerid);
    SetPVarInt(playerid,"pred",params[0]);
    return 1;
}
		
CMD:makegun(playerid,params[])
{
	new str[144],weap[32],
	 			   result;
    if(!IsPlayerConnected(playerid)) return 1;
    if(p_info[playerid][member] == 6 || gang(playerid))
    {
	    if(sscanf(params, "dd", params[0], params[1]))
		{
			ShowPlayerDialog(playerid,0,0,"Список оружия",""W"\
				Sdpistol(№1)\t 5 кг. металла\n\
				Deagle(№2)\t 7 кг. металла\n\
				Mp5(№3)\t 9 кг. металла\n\
				Shotgun(№4)\t 5 кг. металла\n\
				AK47(№5)\t 13 кг. металла\n\
				M4(№6)\t 5 кг. металла\n\
				Rifle(№7)\t 5 кг. металла","Закрыть","");
			SendClientMessage(playerid, error, "Используйте: /makegun [Номер оружия] [кол-во патрон]");
			return 1>0;
		}

		if(params[1] > p_info[playerid][patr]) return SendClientMessage(playerid,error,"Недостаточно патрон");
		if(params[0] == 1) SetPVarInt(playerid, "material", 5);
		if(params[0] == 2) SetPVarInt(playerid, "material", 7);
		if(params[0] == 3) SetPVarInt(playerid, "material", 9);
		if(params[0] == 4) SetPVarInt(playerid, "material", 11);
		if(params[0] == 5) SetPVarInt(playerid, "material", 13);
		if(params[0] == 6) SetPVarInt(playerid, "material", 14);
		if(params[0] == 7) SetPVarInt(playerid, "material", 16);
		switch(params[0])
		{
		    case 1: result = 23;
		    case 2: result = 24;
		    case 3: result = 29;
		    case 4: result = 25;
		    case 5: result = 30;
		    case 6: result = 31;
		    case 7: result = 33;
		}
	    if(GetPlayerWeapon(playerid) == result)
		{
			GivePlayerWeapon(playerid, result, params[1]);
			GetWeaponName(result,weap,sizeof(weap));
			p_info[playerid][patr] -= params[1];
			f(str,"Вы добавили к %s - %d патрон", weap,params[1]);
			SendClientMessage(playerid, accept, str);
			return 1;
		}

		if(p_info[playerid][material] < GetPVarInt(playerid, "material")) return SendClientMessage(playerid,error,"Недостаточно материалов");
		GetWeaponName(result,weap,sizeof(weap));
		f(str,"Вы изготовили %s с %d боеприпасами", weap,params[1]);
		SendClientMessage(playerid, accept, str);
		PlayerPlaySound(playerid, 1052, 0.0, 0.0, 0.0);
		GivePlayerWeapon(playerid,result,params[1]);
		p_info[playerid][material] -= GetPVarInt(playerid,"material");
		p_info[playerid][patr] -= params[1];
	}
	else return SendClientMessage(playerid,error,"Вам не доступна данная функция");
    return 1;
}



CMD:tempzone(playerid, params[])
{
	if(p_info[playerid][admin] < 4) return 1;
	else if(sscanf(params, "i", params[0])) return SendClientMessage(playerid, error, "Введите: /tempzone [id банды]");
	for(new i = 0; i < sizeof(gangzone_Info); i++)
	{
		if(IsPlayerToSquare(playerid,gangzone_Info[i][gCoords][0], gangzone_Info[i][gCoords][1],gangzone_Info[i][gCoords][2],gangzone_Info[i][gCoords][3]))
		{
			gangzone_Info[i][gang_terr] = params[0];
			GangZoneStopFlashForAll(GangZone[i]);
			GangZoneHideForAll(GangZone[i]);
			GangZoneShowForAll(GangZone[i],gz_color(i));
			save_gz(i);
			break;
		}
	}
	return 1;
}
CMD:capture(playerid, params[])
{
	if(!gang(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	if(p_info[playerid][rang] < 7) return SendClientMessage(playerid,error,"Захват территории доступен с 7 ранга и выше");
	new h; gettime(h);
	if(h < 12 || h > 21) return SendClientMessage(playerid, error, "Проводить захват можно только с 12:00 до 22:00");
	new faction = p_info[playerid][member];
	if(FrakCD != 0)
	{
		new fd[128];
		format(fd,sizeof(fd),"Следующий захват территории возможен через %d минут(ы)", FrakCD/60);
		SendClientMessage(playerid,error,fd);
		return 1;
	}
	if(!IsInAllowed(playerid)) return SendClientMessage(playerid, error, "Ваша банда уже участвует в захвате зон");
	new str[144];
	for(new i = 5; i < sizeof(gangzone_Info); i++)//с 5, ибо первые 5 это территории банд
	{
		if(IsPlayerToSquare(playerid, gangzone_Info[i][gCoords][0], gangzone_Info[i][gCoords][1],gangzone_Info[i][gCoords][2],gangzone_Info[i][gCoords][3]) && ZoneOnBattle[i] == 0)
		{
			if(IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, error, "Нельзя использовать в машине");
			{
				if(gangzone_Info[i][gang_terr] == faction) return SendClientMessage(playerid, error, "Вы не можете захватывать зону вашей банды");
				if(gangzone_Info[i][gang_terr] == 5) return SendClientMessage(playerid, error, "Нельзя захватить эту территорию");
				if(get_capture == true) return SendClientMessage(playerid, error, "Уже происходит захват одной из зон. Дождитесь окончания");
				if(IsPlayerInBandOnline(faction) < 3) return SendClientMessage(playerid, error, "В вашей банде мало игроков онлайн, нужно минимум 3");
				if(IsPlayerInBandOnline(gangzone_Info[i][gang_terr]) < 3)
				{
					format(str, sizeof(str), "У банды \"%s\" мало игроков,нужно минимум 3", gang_name(gangzone_Info[i][gang_terr]));
					SendClientMessage(playerid, error, str);
					return 1;
				}
				format(str, sizeof(str), "Банда %s напала на одну из ваших территорий.", fracName(playerid));
				SendFamilyMessage(gangzone_Info[i][gang_terr], 0xFDE910AA, str);
				format(str, sizeof(str), "У вас 10 минут, чтобы отбить территорию, если по истечению времени вас не будет на территории, она перейдет к {FDE910}%s",fracName(playerid));
				SendFamilyMessage(gangzone_Info[i][gang_terr], info, str);
				format(str, sizeof(str), "%s[%d] напал на территорию банды %s",get_name(playerid),playerid,gang_name(gangzone_Info[i][gang_terr]));
				SendFamilyMessage(faction, iAdm, str);
				format(str, sizeof(str), "У вас 10 минут, чтобы захватить территорию, если по истечению времени вас не будет на территории, она перейдет к {FDE910}%s",gang_name(gangzone_Info[i][gang_terr]));
				SendFamilyMessage(faction, info, str);
				GZSafeTime[i] = 30;//600
				FrakCD = 32;//7200
				gangzone_Info[i][gang_attack] = faction;
				GangZoneFlashForAll(GangZone[i],gz_color_Attack(p_info[playerid][member]));
				ZoneOnBattle[i] = 1;
				capture_info[faction][capture] = 1;
				capture_info[gangzone_Info[i][gang_terr]][capture] = 1;
				capture_info[gangzone_Info[i][gang_terr]][captureid] = faction;
				capture_info[faction][captureid] = faction;
				capture_info[faction][gangnumber] = 1;
				capture_info[gangzone_Info[i][gang_terr]][gangnumber] = 0;
				capt_start(faction, gangzone_Info[i][gang_terr]);
			}
		}
	}
	return 1;
}

CMD:ad(playerid)
{
	p_info[playerid][material] += 25;
	p_info[playerid][drugs] += 25;
	p_info[playerid][patr] += 25;
	ShowPlayerDialog(playerid,90,DIALOG_STYLE_INPUT,"Подача объявления","Введите текст вашего объявления:\n\n(прим. объявление будет подано после проверки)","Подать","Закрыть");
	return 1;
}
CMD:edit(playerid)
{
    new string[364];
	if(p_info[playerid][member] != 6) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
    if(ADVERTISE == INVALID_PLAYER_ID) return SendClientMessage(playerid,error,"Никто не подавал объявление");
    format(string, sizeof(string), ""W"Отправитель:{3a75c4} %s\n"W"Текст:{3a75c4} %s\n\n{ffffff}1. Чтобы подать объявление, нажмите {3a75c4}\"Готово\""W"\n2. Чтбы отредактировать его\
     введите текст, после нажмите {3a75c4}\"Готово\".\n"W"3. Заменить слова через знак {3a75c4}'=' (старое=новое)\n"W"4. Чтобы отклонить объявление, введите причину и нажмите{3a75c4} \"Отклонить\"",get_name(ADVERTISE),msg_adv);
    ShowPlayerDialog(playerid,91,DIALOG_STYLE_INPUT,"{3caa3c}Публикация",string,"Готово","Отклонить");
    return 1;
}
CMD:news(playerid)
{
    if(p_info[playerid][member] != 6) return SendClientMessage(playerid,error, "Вам не достпна данная функция");
    if(GetPlayerVehicleID(playerid) >= smi_car[0] && GetPlayerVehicleID(playerid) <= smi_car[1] || GetPlayerInterior(playerid) == 18)
    {
    	if(GetPVarInt(playerid, "news") == 0) SetPVarInt(playerid, "news",1),SendClientMessage(playerid,accept,"Вы в эфире. Микрофон включен, все что вы пишите будет отображаться в новостях. "E"Введите /news еще раз чтобы закрыть эфир");
		else SetPVarInt(playerid, "news",0),SendClientMessage(playerid,error, "Вы закрыли эфир.");
	}
	else SendClientMessage(playerid,error, "Функция доступна только в помещении Радиоцентра или в фургоне/ветолете.");
	return 1;
}
	
	
CMD:anim(playerid)
{
	if(GetPVarInt(playerid, "ANIM")) return SetPlayerSpecialAction(playerid, 0),ClearAnimations(playerid),DeletePVar(playerid, "ANIM"),SendClientMessage(playerid, accept, "Анимация сброшена, введите команду еще раз");
    if(GetPVarInt(playerid,"cuff") == 0) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", "- Анимации оружия\n- Анимации пищеварения\n- Анимации ранений\n- Анимации SWAT\n- Анимации передазировки \n- Сесть/Лечь \n- Анимации Танцев\n- Жесты\n- Прочие Анимации", "Выбрать", "Отмена");
	else SendClientMessage(playerid, error, "Нельзя использовать в наручниках");
	return true;
}



CMD:offset(playerid)
{
	if(IsPlayerAttachedObjectSlotUsed(playerid,6)) RemovePlayerAttachedObject(playerid,6),SendClientMessage(playerid, error, "Вы сняли щит");
	return 1;
}



CMD:take(playerid,params[])
{
	if(p_info[playerid][member] == 5 && GetVehicleModel(GetPlayerVehicleID(playerid)) == 470 )
	{
	    new string[44];
	    if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "/take [кол-во ящиков 1-5]");
		if(params[0] < 1 || params[0] > 5) return SendClientMessage(playerid, error, "Количество ящиков от 1 до 5");
		if(params[0] > avia_boe) return SendClientMessage(playerid, error, "Такого количество ящиков нет в ангаре (корабль скоро приплывет)");
		if(boats@pripas[GetPlayerVehicleID(playerid)]+params[0] > 5) return SendClientMessage(playerid,error,"Максимально количество ящиков - 5");
		if(boats@pripas[GetPlayerVehicleID(playerid)] == 0)
		{
			format(string,sizeof(string),"Загружено ящиков: %d", boats@pripas[GetPlayerVehicleID(playerid)]);
			boats3dtext[GetPlayerVehicleID(playerid)]= Create3DTextLabel(string, 0xFFFF00FF, 0.0, 7.77, 7.77, 30.0,0,1);
			Attach3DTextLabelToVehicle(boats3dtext[GetPlayerVehicleID(playerid)], GetPlayerVehicleID(playerid), 0.0, 0.0, 2.0 );
		}
		boats@pripas[GetPlayerVehicleID(playerid)] += params[0];
		format(string,sizeof(string),"Загружено ящиков: %d", boats@pripas[GetPlayerVehicleID(playerid)]),
		Update3DTextLabelText(boats3dtext[GetPlayerVehicleID(playerid)],0xFFFF00FF, string);
		f(string, "Вы загрузили %d ящик(ов)",params[0]);
		SendClientMessage(playerid,error,string);
	}
	return 11>1;
}

CMD:put(playerid)
{
	if(p_info[playerid][member] == 5 && GetVehicleModel(GetPlayerVehicleID(playerid)) == 470 && IsPlayerInRangeOfPoint(playerid, 5.0,146.3309,1911.5781,21.0484 ) )
	{
		new string[128];
		if(boats@pripas[GetPlayerVehicleID(playerid)] == 0) return SendClientMessage(playerid,error,"В машине нет боеприпасов");
		army_material += boats@pripas[GetPlayerVehicleID(playerid)]*100;
		army_patr 	  += boats@pripas[GetPlayerVehicleID(playerid)]*200;
		f(string, "Вы выгрузили %d ящик(ов) с боеприпасами.",boats@pripas[GetPlayerVehicleID(playerid)]);
		SendClientMessage(playerid,accept,string);
		f(string, "%s доставил %d ящик(ов) боеприпасов на склад.",get_name(playerid),boats@pripas[GetPlayerVehicleID(playerid)]),
		SendFamilyMessage(5, accept, string);
		boats@pripas[GetPlayerVehicleID(playerid)] = 0;
		Delete3DTextLabel(boats3dtext[GetPlayerVehicleID(playerid)]);
		_@3DTEXT();
	}
	return true;
}

CMD:clear(playerid,params[])
{
	if(p_info[playerid][member] !=4) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
    if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /clear [id]");
    if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не найден");
    if(distance(playerid, params[0]) > 6.0) return SendClientMessage(playerid, error, "Игрок далеко от вас");
    if(p_info[params[0]][wanted] == 0) return SendClientMessage(playerid, error, "Данный игрок не в розыске");
	SetPlayerWantedLevel(params[0],0);
	p_info[params[0]][wanted] = 0;
	SendClientMessage(playerid, accept, "Вы сняли розыск с игрока");
	return true;
}
CMD:su(playerid,params[])
{
	new string[144];
	if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	if(p_info[playerid][jail_time] > 0) return SendClientMessage(playerid, error, "Находясь в тюрьме, Вы не можете давать звёзды");
	if(sscanf(params, "ds[128]", params[0],params[1])) return SendClientMessage(playerid, error, "Используйте: /su [id] [причина]");
  	if(!IsPlayerConnected(params[0])) SendClientMessage(playerid, error, "Данный игрок не найден");
    if(playerid == params[0]) return SendClientMessage(playerid, error, "Вы не можете выдать розыск самому себе");
	if(cop(params[0])) return SendClientMessage(playerid, error, "Нельзя выдать розыск гос. служащему");
	if(p_info[params[0]][jail] > 0) return SendClientMessage(playerid, error, "Игрок находится в тюрьме");
	if(p_info[params[0]][wanted] >= 5)return SendClientMessage(playerid, error, "Максимальное значение звезд: 6");
	
	f(string,"Вы повысили уровень розыска игроку - {ffff00}%s{FFFFFF}. {ffffff}Причина: {ffff00}%s",get_name(params[0]),params[1]);
	SendClientMessage(playerid, -1, string);
	f(string,"%s объявил преступнику %s уровень розыска: %d. Причина: %s",get_name(playerid),get_name(params[0]),p_info[params[0]][wanted]+1,params[1]);
    SendClientMessage(playerid,0xffff00ff,string);
    f(string, "Вас объявили в розыск. Уровень розыска: %d | Причина: %s",p_info[params[0]][wanted]+1,params[1]);
    SendClientMessage(params[0],0xffff00ff, string);
    p_info[params[0]][wanted] += 1;
    SetPlayerWantedLevel(params[0], p_info[params[0]][wanted]);
  	return true;
}

CMD:arrest(playerid,params[])
{
    new string[256];
    if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /arrest [id]");
	if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	if(playerid == params[0]) return SendClientMessage(playerid, error, "Нельзя аррестовать самого себя");
	if(p_info[params[0]][wanted] < 1) return SendClientMessage(playerid, error, "Игрок не состоит в розыске");
	if(!arrest(playerid)) return SendClientMessage(playerid, error, "Вы далеко от тюрьмы");
 	if(!arrest(params[0])) return SendClientMessage(playerid, error, "Игрок далеко от тюрьмы");
	PlayerPlaySound(params[0], 17004, 0.0, 0.0, 0.0);
	f(string,"%s аррестовал вас | Время заключения: %s", get_name(playerid), ConvertTime(GetPlayerWantedLevel(params[0])*300));
	SendClientMessage(params[0], -1, string);
	f(string, " %s арестовал %s | Время заключения: %s", get_name(playerid), get_name(params[0]),ConvertTime(GetPlayerWantedLevel(params[0])*300));
	SendFamilyMessage(cop(playerid), -1, string);
	ResetPlayerWeapons(params[0]);
	p_info[params[0]][wanted] = 0;
	p_info[params[0]][jail] = 1;
	p_info[params[0]][jail_time] = GetPlayerWantedLevel(params[0])*300;
	if(p_info[params[0]][jail] == 1)
	{
		SetPlayerInterior(params[0], 6);
	  	SetPlayerVirtualWorld(params[0], 1),SetPlayerPos(params[0], 264.6288,77.5742,1001.0391);
	  	SetPVarInt(params[0],"Cuff",0);
		SetPlayerCuffed(params[0], false);
		TogglePlayerControllable(params[0], true);
		p_info[params[0]][wanted]  = 0;
		SetPlayerWantedLevel(params[0], 0);
	}
	return true;
}
CMD:cuff(playerid,params[])
{
	new string[144];
	if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	if(sscanf(params, "d", params[0])) return  SendClientMessage(playerid, error, "Используйте: /cuff [id]");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не найден");
    if(playerid == params[0]) return SendClientMessage(playerid, error, "Вы не можете одеть наручники себе");
	if(distance(playerid, params[0]) > 3.0) return SendClientMessage(playerid, error, "Игрок далеко от Вас");
	if(IsPlayerInAnyVehicle(params[0])) return SendClientMessage(playerid, error, "Указанный тобой игрок находится в машине");
    if(cop(params[0])) return SendClientMessage(playerid, error, "Нельзя одеть наручники гос. служащему");
	if(GetPVarInt(params[0],"Cuff") == 1) return SendClientMessage(playerid, error, "На этом игроке уже одеты наручники");
	f(string, "{B17FC8}Полицейский %s одел наручники на %s", get_name(playerid), get_name(params[0]));
	SendDistanceChat(playerid, 20.0, string);
	GameTextForPlayer(params[0], "~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~r~CUFFED", 3000, 3);
	SetPVarInt(params[0],"Cuff",1);
	SetPlayerCuffed(params[0], true);
	TogglePlayerControllable(params[0], false);
	return true;
}
CMD:uncuff(playerid,params[])
{
	new string[144];
	if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	if(sscanf(params, "d", params[0])) return  SendClientMessage(playerid, error, "Используйте: /uncuff [id]");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не найден");
    if(playerid == params[0]) return SendClientMessage(playerid, error, "Вы не можете снимать наручники себе");
	if(distance(playerid, params[0]) > 3.0) return  SendClientMessage(playerid, error, "Игрок далеко от вас");
	if(GetPVarInt(params[0],"Cuff") == 0) return  SendClientMessage(playerid, error, "На этом игроке не одеты наручники");
	f(string, "{B17FC8}Полицейский %s cнимает наручники с %s",get_name(playerid), get_name(params[0]));
	SendDistanceChat(playerid, 20.0, string);
	GameTextForPlayer(params[0], "~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~g~UNCUFFED", 3000, 3);
	SetPVarInt(params[0],"Cuff",0);
	SetPlayerCuffed(params[0], false);
	TogglePlayerControllable(params[0], true);
  	return true;
}
CMD:convoy(playerid,params[])
{
	new string[80];
	if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /convoy [id]");
	if(IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, error, "Вы находитесь в машине");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не найден");
	if(playerid == params[0]) return SendClientMessage(playerid, error, "Ты не можешь взять под конвой себя");
	if(cop(params[0])) return SendClientMessage(playerid, error, "Нельзя взять под конвой гос. служащего");
	if(IsPlayerInAnyVehicle(params[0])) return SendClientMessage(playerid, error, "Указанный тобой игрок находится в машине");
	if(distance(playerid, params[0]) > 3.0) return SendClientMessage(playerid, error,"Игрок далеко от Вас");
	if(GetPVarInt(params[0],"Conv") != 1)
	{
		if(!GetPVarInt(params[0],"Cuff")) return SendClientMessage(playerid, error, "На игроке должны быть надеты наручники!");
		f(string, "{B17FC8}Полицейский %s ведет за собой %s", get_name(playerid), get_name(params[0]));
		SendDistanceChat(playerid, 20.0, string);
		SetPVarInt(params[0],"Conv",1);
		SetPVarInt(params[0],"Ved", playerid);
	}
	else
	{
	    f(string, "{B17FC8}Полицейский %s отпустил %s", get_name(playerid), get_name(params[0]));
		SendDistanceChat(playerid, 20.0, string);
		SetPVarInt(params[0],"Conv",0);
		SetPVarInt(params[0],"Ved", 0);
	}
	return true;
}
CMD:incar(playerid,params[])
{
    if(!IsPlayerConnected(playerid)) return 1;
    if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
    if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /incar [id]");
	if(params[0] == INVALID_PLAYER_ID || !IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не найден");
    if(IsPlayerInAnyVehicle(params[0])) return SendClientMessage(playerid, error, "Данный игрок уже в машине!");
	if(GetPVarInt(params[0],"cuff") == 0) return SendClientMessage(playerid, error, "На игроке должны быть надеты наручники!");
	if(distance(playerid,params[0]) < 5.0) return SendClientMessage(playerid, error, "Вы далеко от игрока");
	if(GetPlayerState(playerid) == PLAYER_STATE_ONFOOT)
	{
	    new vehicleid = INVALID_VEHICLE_ID;
	    new Float:POS[3];
		for(new i=0; i<MAX_VEHICLES; i++)
		{
			GetVehiclePos(i, POS[0], POS[1], POS[2]);
			if(IsPlayerInRangeOfPoint( playerid,3.0, POS[0], POS[1], POS[2]))
			{
				vehicleid = i;
				break;
			}
		}
		if(vehicleid != INVALID_VEHICLE_ID)
		{
   			new bool:seat[4],getter = 999;
			for(new i=0; i<GetMaxPlayers(); i++)
			{
		   		if(IsPlayerConnected(i) && GetPlayerVehicleID(i) == vehicleid)
		   		{
   			 		if(GetPlayerVehicleSeat(i) == 1) seat[1] = true;
		   			else if(GetPlayerVehicleSeat(i) == 2) seat[2] = true;
		   			else if(GetPlayerVehicleSeat(i) == 3) seat[3] = true;
		   		}
			}
			for(new i=1; i<4; i++)
			{
			    if(!seat[i])
			    {
			       	getter = i;
			        break;
			    }
			}
			if(getter == 999) return SendClientMessage(playerid, error, "В этой машине нет свободных мест");
	    	ClearAnimations(params[0]);
			PutPlayerInVehicle(params[0],vehicleid,getter);
			return true;
		}
	}
	else return SendClientMessage(playerid, error, "Вы не можете затащить в машину, пока сами внутри неё!");
	return 22>13;
}
CMD:meg(playerid,params[])
	{
		new string[144],carid = GetPlayerVehicleID(playerid);
		if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
		if(!(carid >= lspd[0] && carid <= lspd[1] || carid >= sfpd[0] && carid <= sfpd[1] || carid >= lvpd[0] && carid <= lvpd[1])) return SendClientMessage(playerid, error, "Вы должны находиться в полицейской машине");
        if(sscanf(params, "s[144]", params[0])) return SendClientMessage(playerid, error,"Используйте /meg [текст]");
		f(string, "[Рупор] %s: {FFEE00}%s", get_name(playerid), params[0]);
		SendDistanceChat(playerid, 50.0, string);
	  	return true;
	}
CMD:wanted(playerid)
{
	if(!cop(playerid)) return SendClientMessage(playerid, error, "Вам не доступна данная функция");
	new want_text[256],
		want,string[144];
	for(new i=0; i<GetMaxPlayers(); i++)
	{
	    if(IsPlayerConnected(i) && p_info[i][wanted] > 0)
		{
	        f(want_text, "%s"W"ID:"A"%d "W"| Имя: "W"%s {FFFFFF}| Уровень розыска: {007fff}%d\n",want_text, i, get_name(i), p_info[i][wanted]);
	        strcat(string, want_text);
			want += 1;
	    }
	}
	if(want == 0) f(string, ""E"Список подозреваемых пуст");
	ShowPlayerDialog(playerid, 0, DIALOG_STYLE_MSGBOX, "Список подозреваемых", string, "Закрыть", "");
	return true;
}
//ЛИДЕР/MEMBER


CMD:lmenu(playerid)
{
        if(!IsPlayerConnected(playerid)) return 1;
        if(p_info[playerid][leader] == 0) return SendClientMessage(playerid,error, "Вам не доступна данная функция");
        return ShowPlayerDialog(playerid, 65, DIALOG_STYLE_LIST, "Панель лидера:", "Список всех сотрудников\n-Уволить игрока (offline)", "Выбор", "Закрыть");
}

forward members_offline(playerid);
public members_offline(playerid)
{
        new rows,string[1256],named[MAX_PLAYER_NAME],rangs;
        cache_get_row_count(rows);
        for(new i = 0; i < rows; i++)
		{
                cache_get_value_name(i, "Name",named,24);
                cache_get_value_name_int(i, "rang",rangs);
                format(string,sizeof(string),""W"%s\t"A"Ранг: %d\n%s",named,rangs,string); // Форматируем диалог
                ShowPlayerDialog(playerid, 000, DIALOG_STYLE_TABLIST, "Панель лидера: Сотрудники",string, "Закрыть", ""); // Выводим диалог
        }
        if !rows*then return SendClientMessage(playerid,error, "В вашей организации никто не состоит");
        return true;
}
forward leave_offline(playerid,names[]);
public leave_offline(playerid,names[])
{
    new query[128],members;
    cache_get_value_name_int(0, "member",members);
    if(p_info[playerid][member] != members) return SendClientMessage(playerid,error,"Информация: Данный игрок состоит не в Вашей организации");
    format(query,sizeof(query),"UPDATE accounts SET `leader` = '0',`member` = '0',`rang` = '0',`fskin` = '0',`spawn` = '0' WHERE `name` = '%s'",names);
    mysql_tquery(con_bd, query, "", "");
    f(query, "Вы уволили %s из организации (в режиме offline)",names);
    SendClientMessage(playerid, error,query);
    return true;
}
CMD:invite(playerid, params[])
{
	if(IsPlayerConnected(playerid) && p_info[playerid][leader] >= 1)
	{
	    new string[144];
		if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /invite [id]");
		if(distance(playerid, params[0]) > 6.0) return SendClientMessage(playerid,error,"Информация: "W"Игрок с таким ID - далеко от вас");
		if(params[0] == INVALID_PLAYER_ID || !IsPlayerConnected(params[0])) return SendClientMessage(playerid,error,"Информация: "W"Игрок с таким ID - не найден");
		if (p_info[params[0]][member] != 0) return SendClientMessage(playerid,error, "Игрок с таким ID - состоит в организации");
		//
		f(string, "Организация: "W"Вы были приглашены в{d0f0c0} %s лидером {d0f0c0}%s", fracName(playerid), get_name(playerid));
		SendClientMessage(params[0], info,string);
		SendClientMessage(params[0], white, "Нажмите {03c03c}Y "W"для согласия или {ff7518}N "W"для отказа");
		f(string,"Организация: "W"Вы пригласили игрока {d0f0c0}%s{ffffff} в вашу организацию", get_name(params[0]));
		SendClientMessage(playerid, info,string);
		SetPVarInt(params[0],"GET_ID",playerid);
		SetPVarInt(params[0],"YES",11001);
	}
	return true;
}
CMD:uninvite(playerid, params[])
{
	if(IsPlayerConnected(playerid))
	{
	    new string[144];
		if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /uninvite [id]");
		//if(params[0] == playerid) return SendClientMessage(playerid,server,"Информация: "W"Нельзя уволить самого себя");
		if (p_info[playerid][rang] < 9) return SendClientMessage(playerid,error,"Вам не доступна данная команда");
		if(!IsPlayerConnected(params[0]) && params[0] != INVALID_PLAYER_ID) return SendClientMessage(playerid,error,"Игрок с таким ID - не найден");
		if (p_info[params[0]][member] != p_info[playerid][member]) return  SendClientMessage(playerid,error,"Игрок с таким ID - не состоит в вашей организации");
		f(string,"Организация: "W"%s уволил вас из организации %s",get_name(playerid),fracName(playerid));
		SendClientMessage(params[0], info,string);
		p_info[params[0]][member] = 0;
		p_info[params[0]][rang] = 0;
		p_info[params[0]][fskin] = 0;
		if p_info[params[0]][keyh] != 60635*then p_info[params[0]][spawn] = 2;
		else p_info[params[0]][spawn] = 0;
		SetPlayerSkin(params[0],p_info[params[0]][skin]);
		f(string, "Организация: "W"Вы уволили %s из организации.", get_name(params[0]));
		SendClientMessage(playerid, info,string);
	}
	return true;
}

CMD:r(playerid, params[])
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
	if(!gos(playerid)) return SendClientMessage(playerid,error, "Вы не состоите в гос. организации.");
    if(sscanf(params, "s[144]", params[0])) return SendClientMessage(playerid,error,"Используйте: /r(adio) [текст]");
	if(strlen(params[0]) > 144) return SendClientMessage(playerid,error, "Слишком длинное предложение.");
	new string[144];
	f(string, "R: %s %s[%i]:"W" %s", RankName(playerid), get_name(playerid), playerid, params[0]);
	SendFamilyMessage(p_info[playerid][member], accept, string);
	return 1;
}
CMD:d(playerid, params[])
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
	if(!gos(playerid) || p_info[playerid][member] == 7) return SendClientMessage(playerid,error, "Вы не состоите в гос. организации.");
    if(sscanf(params, "s[144]", params[0])) return SendClientMessage(playerid,error,"Используйте: /d(eportament) [текст]");
	if(strlen(params[0]) > 144) return SendClientMessage(playerid,error, "Слишком длинное предложение.");
	new string[144];
	f(string, "D: %s %s[%i]:"W" %s", RankName(playerid), get_name(playerid), playerid, params[0]);
	for(new i=1; i<5; i++)SendFamilyMessage(i, accept, string);
	return 1;
}
CMD:f(playerid, params[])
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
	if(!gang(playerid) && !mafia(playerid)) return SendClientMessage(playerid,error, "Вы не состоите в банде/мафии.");
    if(sscanf(params, "s[144]", params[0])) return SendClientMessage(playerid,error,"Используйте: /f(amily) [текст]");
	if(strlen(params[0]) > 144) return SendClientMessage(playerid,error, "Слишком длинное предложение.");
	new string[144];
	f(string, "F: %s %s[%i]: %s", RankName(playerid), get_name(playerid), playerid, params[0]);
	SendFamilyMessage(p_info[playerid][member], accept, string);
	return 1;
}
CMD:rang(playerid, params[])
{
	new str[128];
	if(p_info[playerid][leader] == 0) return true;
	if(sscanf(params, "ds[5]", params[0], params[1])) return SendClientMessage(playerid,error,  "Используйте: /rang [id] [+/-]");
	if(params[0] == INVALID_PLAYER_ID) return SendClientMessage(playerid,error,"Игрок с таким ID - не найден");
	//if(params[0] == playerid) return SendClientMessage(playerid,error, "Запрещено использовать на себе");
	if(p_info[params[0]][member] != p_info[playerid][leader]) return SendClientMessage(playerid, error, "Игрок с таким ID - не состоит в вашей организации");
    if(strcmp(params[1],"+",true) == 0)
	{
		if(p_info[params[0]][rang] == 9) return SendClientMessage(playerid,error, "У игрока уже 9 ранг, больше нельзя!");
		p_info[params[0]][rang] += 1;
		f(str, "Лидер %s повысил вас до %d ранга (%s)", get_name(playerid), p_info[params[0]][rang],RankName(params[0]));
		SendClientMessage(params[0], info,str);
		f(str, "Вы повысили %s до %d ранга (%s)", get_name(params[0]),p_info[params[0]][rang],RankName(params[0]));
		SendClientMessage(playerid, info,str);
        fracSkin(params[0]);
	}
	else if(strcmp(params[1],"-",true) == 0)
	{
	    if(p_info[params[0]][rang] == 1) return SendClientMessage(playerid,error, "У игрока уже 1 ранг, ниже нельзя!");
		p_info[params[0]][rang] -= 1;
		f(str,"Лидер %s понизил вас до %d ранга (%s)", get_name(playerid), p_info[params[0]][rang],RankName(params[0]));
		SendClientMessage(params[0], info,str);
		f(str,"Вы понизили %s до %d ранга (%s)", get_name(params[0]),p_info[params[0]][rang],RankName(params[0]));
		SendClientMessage(playerid, info,str);
		fracSkin(params[0]);
	}
	return true;
}
CMD:gov(playerid, params[])
{
	if(IsPlayerConnected(playerid))
	{
		new string[156];
		if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
        if (!gos(playerid)) return SendClientMessage(playerid,error,  "Вам не доступна данная команда.");
		if(p_info[playerid][rang] < 9) return SendClientMessage(playerid,error, "Вам не доступна данная команда.");
        if(sscanf(params, "s[154]", params[0])) return SendClientMessage(playerid,error, "Используйте: /gov [текст]");
		f(string, "Новости | %s: %s", get_name(playerid), params[0]);
		SendClientMessageToAll(0x0087FF65, string);
	}
	return true;
}


//ТЕЛЕФОН
CMD:sms(playerid,params[])
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
	new str[164];
    if(p_info[playerid][phone] != 1) return SendClientMessage(playerid, error, "У Вас нет телефона, приобретите его в супермаркете");
	if(sscanf(params, "is[128]", params[0],params[1])) return SendClientMessage(playerid, error, "Используйте: /sms [номер телефона] [текст]" );
	if (strlen(params [1]) > 128) return SendClientMessage ( playerid, error, "Вы превысили лимит. Разрешено не более 128 букв." );
    for(new i; i<GetMaxPlayers();i++)
    {
        if(p_info[i][p_number] == params[0])
        {
            f(str, "СМС: %s (Получатель: %s[%i] [т. %d])",params [1],get_name(i),i,p_info[i][p_number]);
            SendClientMessage (playerid, server, str);
            PlayerPlaySound(playerid, 1052, 0.0, 0.0, 0.0 );
            //
            f(str, "CМС: %s (Отправитель: %s[%i] [т. %d])",params[1],get_name(playerid),playerid,p_info[playerid][p_number]);
            SendClientMessage(i,server, str);
			PlayerPlaySound(i,1052, 0.0, 0.0, 0.0 );
			return true;

        }
		else SendClientMessage(playerid, -1, "Неверный номер абонента");
    }
    return true;
}
CMD:call(playerid, params[])
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
	new str[144];
    if(!p_info[playerid][phone]) return SendClientMessage(playerid, error,"У Вас нет телефона, приобретите его в супермаркете");
    if(sscanf(params, "i", params[0])) return SendClientMessage (playerid,error, "/call [номер]" );
	if(!params[0]) return true;
    if(params[0] == p_info[playerid][p_number]) return SendClientMessage(playerid, error, "Вы указали свой номер");

    for(new i; i<GetMaxPlayers();i++)
    {
        if (p_info[i][p_number] == params[0])
        {
            if(GetPVarInt (i,"called") != 60605) return SendClientMessage ( playerid, error,"Абонент разговаривает по телефону.");
            f(str,"Вы звоните на номер: %d "E"Ожидайте ответ от %s", p_info[i][p_number], get_name(i));
            SendClientMessage ( playerid,server,str);
            //
            f(str, "Входящий звонок от номера: %d", p_info[playerid][p_number]);
            SendClientMessage (i,server,str);
            SendClientMessage (i,error, "Начать разговор - /p | cбросить - /h");

            SetPVarInt (playerid,"called",i);
            SetPVarInt (i,"called",playerid);
			SetPlayerChatBubble(playerid, "достал(а) телефон", error, 5, 7500);
            SetPlayerChatBubble(i, "Звонит телефон", error, 5, 7500);
			SetPlayerSpecialAction (playerid, SPECIAL_ACTION_USECELLPHONE);
            return true;
        }
    }
    SendClientMessage ( playerid, -1, !"Номер вне зоны доступа сети");
    return true;
}
CMD:h(playerid)
{
	new str[64];
    if(GetPVarInt(playerid, "called") == playerid ) return true;
    if(GetPVarInt(playerid, "called") == 60605) return SendClientMessage(playerid, error,"Ошибка, вам никто не звонит");

    f(str, "%s положил(а) трубку", get_name(playerid));
    SendClientMessage (GetPVarInt(playerid, "called"), error,str);
    SendClientMessage (playerid, error, "Вы положили трубку." );
	SetPlayerChatBubble(playerid, "положил(а) трубку", error, 5, 7500);
	SetPlayerSpecialAction ( playerid, SPECIAL_ACTION_STOPUSECELLPHONE );
    SetPlayerSpecialAction ( GetPVarInt(playerid, "called"), SPECIAL_ACTION_STOPUSECELLPHONE );
    
        
    DeletePVar(GetPVarInt(playerid, "called"), "talk" );
    SetPVarInt(GetPVarInt(playerid, "called"), "called",60605);
	DeletePVar(playerid, "talk" );
    SetPVarInt(playerid, "called",60605);
    return true;
}
CMD:p(playerid)
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
	new str[64];
    if(GetPVarInt(playerid,"called") == playerid ) return true;
	if (!IsPlayerConnected(GetPVarInt(playerid,"called"))) return SendClientMessage (playerid,error, "Вам никто не звонит" );
    f(str, "%s ответил(а) на звонок", get_name(playerid));
    SendClientMessage ( GetPVarInt(playerid, "called"), info, str );
    SendClientMessage ( playerid, info, "Вы приняли входящий вызов");
    SetPlayerSpecialAction ( playerid, SPECIAL_ACTION_USECELLPHONE );
	SetPlayerChatBubble(playerid, "Ответил(а) на звонок", info, 5, 7500);
    SetPVarInt(playerid,"talk",true);
    SetPVarInt(GetPVarInt(playerid,"called"),"talk",true);
    return true;
}


//ТАКСИ
CMD:accept(playerid,params[])
{
    new string[144];
    if(p_info[playerid][job] != 2) return SendClientMessage(playerid,error, "Вам не доступна данная функция");
	if(GetPlayerRentTaxi[playerid] == -1) return SendClientMessage(playerid,error, "Вы не начанали работу таксиста");
	if( !(GetPlayerVehicleID(playerid) >= TAXI[0] && GetPlayerVehicleID(playerid) <= TAXI[1])) return SendClientMessage(playerid,error, "Вы должны находиться в такси и быть за рулём");
	if(sscanf(params, "i", params[0])) return SendClientMessage(playerid, server, "Используйте: /accept [ ид ]");
	if(!GetPVarInt(params[0],"taxiOrder")) return SendClientMessage(playerid, error, "Этот игрок не вызывал такси");
	new Float:POS[3];
	format(string, sizeof(string),"Ваш вызов принял таксист "W"%s "I"Он направляется к вам.", get_name(playerid));
	SendClientMessage(params[0], info, string);
	format(string, sizeof(string),"Вы приняли вызов такси от "W"%s", get_name(params[0]));
	SendClientMessage(playerid, info, string);
	SetPVarInt(params[0],"taxiOrder",0);
	SetPVarInt(playerid, "taxi_checkpoint",1);
	GetPlayerPos(params[0], POS[0], POS[1], POS[2]);
	SetPlayerRaceCheckpoint(playerid,1, POS[0], POS[1], POS[2],0.0,0.0,0.0,6.0);
	return 1;
}
CMD:taxi(playerid)
{
    if(p_info[playerid][mute] > 0) return SendClientMessage(playerid, error, "Время молчанки еще не истекло");
    new string[144],Float:pos[3];
    GetPlayerPos(playerid,pos[0],pos[1],pos[2]);
    SendClientMessage(playerid, server, "Вы успешно вызвали такси. Дождитесь принятия вызова");
	format(string, sizeof(string),"%s вызывает такси! Он сейчас в г. %s район %s. "I"Принять вызов: /accept %d", get_name(playerid),gSAZonesCity[GetCityName(pos[0],pos[1])][SAZONE_NAME],gSAZones[GetZonaName(pos[0],pos[1])][SAZONE_NAME],playerid);
	SetPVarInt(playerid,"taxiOrder",1);
	SetTimerEx("RemovePlayerCallTaxi", 120000, false, "i", playerid);
	for(new i=0; i<GetMaxPlayers(); i++)
	{
		if(IsPlayerConnected(i))
		{
		    if(p_info[i][job] == 2 && GetPlayerRentTaxi[i] != -1)
		    {
            	SendClientMessage(i, 0xC0EDC8FF, string);
			}
		}
	}
	return 1;
}


//РАЗВОЗЧИК ПРОДУКТОВ
CMD:load(playerid)
{
	new str[128];
	if(!IsPlayerInRangeOfPoint(playerid, 6.0,-116.9392,-316.1367,2.7646 )) return SendClientMessage(playerid, error, "Вы должны находиться на месте загрузки (/gps)");
	if(GetPlayerVehicleID(playerid) != GetCarDelivery[playerid]) return SendClientMessage(playerid, error, "Вы должны находиться в Рабочем транспорте");
	if(GetVehicleModel(GetPlayerVehicleID(playerid)) == 515) {
		if(!IsTrailerAttachedToVehicle(GetPlayerVehicleID(playerid))) return SendClientMessage(playerid,error,"Вы не в фуре или у вас нет цистерны");
		if(zfuel < GetPVarInt(playerid, "zakaz")) return SendClientMessage(playerid, error, "На заводе нет такого количества топлива");
	}
	else if(GetVehicleModel(GetPlayerVehicleID(playerid)) == 440){
		if(zprod < GetPVarInt(playerid, "zakaz")) return SendClientMessage(playerid, error, "На заводе нет такого количества продуктов");
	}
	if(!GetPVarInt(playerid, "zakaz")) return SendClientMessage(playerid, error, "Вы еще не взяли заказ ( /list )");
	if(loadCar[GetCarDelivery[playerid]] > 0) return SendClientMessage(playerid, error, "Вы уже загрузили продукты/топливо отправляйтесь на доставку (красная метка на карте)");
	loadCar[GetCarDelivery[playerid]] = GetPVarInt(playerid, "zakaz");
    if(b_info[GetPVarInt(playerid, "biz_zakaz")][_tip] ==4) f(str, "Вы загрузили %d литров топлива, отправляйтесь на доставку (красная метка на карте)",loadCar[GetCarDelivery[playerid]]);
    else f(str, "Вы загрузили %d продуктов, отправляйтесь на доставку (красная метка на карте)",loadCar[GetCarDelivery[playerid]]);
    SendClientMessage(playerid, info, str);
    SendClientMessage(playerid, error, "Если вы разрушите рабочий транспорт или потеряете груз, с вас будет списан штраф (500$)");
    if(GetVehicleModel(GetPlayerVehicleID(playerid)) == 515) zfuel -= GetPVarInt(playerid, "zakaz");
    else zprod -= GetPVarInt(playerid, "zakaz");
    _@3DTEXT();
    return 1;
}
CMD:list(playerid, params[])
{
	if(!IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, error, "Вы должны находиться в рабочем транспорте");
	if(GetCarDelivery[playerid] == -1) return SendClientMessage(playerid, error, "Вы должны начать рабочий день");
	if(GetPVarInt(playerid, "zakaz") != 0) return ShowPlayerDialog(playerid,52,DIALOG_STYLE_MSGBOX,"Информация",""W"Вы уже приняли заказ, если вы хотите отменить принятый и начать новый, нажмите 'Да'\nC Вас будет списан штраф 500$ если у вас уже есть груз\nНажмите 'Нет' для закрытия диалога", "Да","Нет");
    list_delivery(playerid);
	return true;
}

//БИЗНЕСЫ
CMD:healme(playerid)
{
	if(GetPVarInt(playerid, "HEAL") == 0) return SendClientMessage(playerid,error, "У Вас нет аптечки");
	SetPlayerChatBubble(playerid, "+ 60 HP", 0x0099FFAA, 10.0, 2000);
	GameTextForPlayer(playerid, "~b~+ 60 hp", 1000, 1);
	SendClientMessage(playerid,0x0099FFAA, "Вы использовали аптечку.Здоровье поплнено на 60 единиц");
	SetPVarInt(playerid, "HEAL", GetPVarInt(playerid, "HEAL") -1);
	p_info[playerid][health] += 60.0;
	SetPlayerHealth(playerid, p_info[playerid][health]);
	ApplyAnimation(playerid,"ped","gum_eat",4.0,0,0,0,0,0,1);
	if(p_info[playerid][health] > 100.0) //pAirb
	{
		p_info[playerid][health] = 100.0;
		SetPlayerHealth(playerid, 100.0);
	}
	return 1;
}
CMD:mask(playerid)
{
	if(!GetPVarInt(playerid,"MASK")) return SendClientMessage(playerid,error, "У Вас нет маски");
	if(GetPVarInt(playerid, "MASK_ON") == 1) return SendClientMessage(playerid,error,"На Вас уже одета маска");
	SetPlayerChatBubble(playerid, "Одевает маску", error, 10.0, 2000);
	ApplyAnimation(playerid, "SHOP", "ROB_Shifty", 4.0, 0, 0, 0, 0, 0);
	SetPlayerColor(playerid, 0x4F4F4F00);
	DeletePVar(playerid,"MASK");
	SetPVarInt(playerid, "MASKON", 1);
	SetPVarInt(playerid, "MASK_TIME",SetTimerEx("@maskOFF", 1000*600, true, "i", playerid));//10 минут
	SendClientMessage(playerid,info, "Ваше местоположение на карте скрыто на 10 минут");
	return 1;
}

forward @maskOFF(playerid);
public @maskOFF(playerid)
{
    DeletePVar(playerid,"MASK_ON");
    KillTimer(GetPVarInt(playerid,"MASK_TIME"));
    DeletePVar(playerid,"MASK_TIME");
    SendClientMessage(playerid,info, "С вас снята маска");
    return 1;
}
CMD:bizmenu(playerid)
{
	if(p_info[playerid][key] == -1) return SendClientMessage(playerid,error, "Вам недоступна данная функция!");
	if(!IsPlayerInRangeOfPoint(playerid,3.0,b_info[p_info[playerid][key]][b_enter][0],b_info[p_info[playerid][key]][b_enter][1],b_info[p_info[playerid][key]][b_enter][2])) return SendClientMessage(playerid, error, "Вы должны находиться рядом со своим бизнесом");
	biz_m(playerid);
	return 1;
}
stock biz_m(playerid)
{
    if(b_info[p_info[playerid][key]][_tip] != 4) ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес","Далее","Отмена");
	else ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес\n"W"Указать цену за 1л. бензина","Далее","Отмена");
	return 1>0;
}
CMD:house(playerid)
{
	new squar[ 9 ],str[ 364 ];
    if(p_info[playerid][keyh] != 60635)
	{
    	switch(h_info[p_info[playerid][keyh]][h_squar])
		{
			case 1: squar = "15 кв.м";
			case 2: squar = "36 кв.м";
			case 3: squar = "72 кв.м";
			case 4: squar = "120 кв.м";
		}
		new city = GetCityName ( h_info[p_info[playerid][keyh]][h_enter][0], h_info[p_info[playerid][keyh]][h_enter][1] ),
			area = GetZonaName ( h_info[p_info[playerid][keyh]][h_enter][0], h_info[p_info[playerid][keyh]][h_enter][1] );
		f(str, ""W"Статистика дома \t№%d\n\n"W"Общая площадь:\t"I"%s\n"W"Город:\t\t\t"I"%s\n"W"Район:\t\t\t"I"%s\n"W"Cтоимость:\t\t"I"%d$\n"W"Статус дверей:\t"I"%s\n\n",p_info[playerid][keyh],squar,gSAZonesCity[city][SAZONE_NAME],gSAZones[area][SAZONE_NAME],h_info[p_info[playerid][keyh]][h_value],(h_info[p_info[playerid][keyh]][h_lock] == 0)?("Открыты"):("Закрыты"));
		f(str, "%s"W"Дом оплачен - \t"I"%d/30 дней\n\n"E"Для управление домом нажмите 'Меню' или 'Закрыть' для закрытие панели",str,h_info[p_info[playerid][keyh]][h_rent]);
		ShowPlayerDialog(playerid, 19, DIALOG_STYLE_MSGBOX, "Cтатистика дома", str, "Меню", "Закрыть");
	}
	else SendClientMessage(playerid, error, "Вам не доступна данная команда");
}
//Админ команды_____________
CMD:ahelp(playerid)
{
	if(p_info[playerid][admin] != 0)
	{
	    SendClientMessage(playerid, iAdm, "1 ур.:"E" /ans /a");
	    SendClientMessage(playerid, iAdm, "2 ур.:"E" /veh /kick /mute /goto /aob");
	    SendClientMessage(playerid, iAdm, "3 ур.:"E" /ban /warn /gethere /setname");
	    SendClientMessage(playerid, iAdm, "4 ур.:"E" /dellveh /unwarn ");
        SendClientMessage(playerid, iAdm, "5 ур.:"E" /gmoney /setjob /create /unban");
 	}
}
CMD:setname(playerid, params[])
{
	if(p_info[playerid][admin] < 3) return true;
	if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Введите: /setname [id]");
	if(GetPVarInt(params[0], "ChangeNickQuery") == 0) return SendClientMessage(playerid, error, "Данный игрок не запрашивал смену ника");
	new named[24], text[128];
	GetPVarString(params[0], "NewNickName", named, sizeof(named));
	format(text, sizeof(text), "SELECT * FROM `accounts` WHERE `name` = '%s'", named);
	mysql_tquery(con_bd, text, "NickName", "d",params[0]);
	return true;
}
stock SetPlayerNickName(playerid, nick[])
{
	new query[169];
	format(query, sizeof(query), "UPDATE `accounts` SET `name`='%s' WHERE `name`='%s'", nick, p_info[playerid][name]);
	mysql_tquery(con_bd, query, "", "");
	for(new i=0; i<MAX_VEHICLES; i++)
	{
		if(veh_info[i][v_if_buy] == 1 && !strcmp(veh_info[i][v_owner], get_name(playerid), true))
		{
			f(query, "Владелец: %s", nick);
			UpdateDynamic3DTextLabelText(player_owner[i], error,query);
			strmid(veh_info[i][v_owner], nick, 0, strlen(nick), 255);
			break;
		}
	}
	if(p_info[playerid][key] != -1)
	{
		strmid(b_info[p_info[playerid][keyh]][_owner], nick, 0, strlen(nick), 255);
		biz_save();
		Update3DTexts();
	}
	if(p_info[playerid][keyh] != -1)
	{
		strmid(h_info[p_info[playerid][keyh]][h_owner], nick, 0, strlen(nick), 255);
		update_house(p_info[playerid][keyh]),save_house(p_info[playerid][keyh]);
	}
	SetPlayerName(playerid, nick);
}
forward NickName(playerid);
public NickName(playerid)
{
	new rows, text[84],named[24];
	cache_get_row_count(rows);
	if(rows) return SendClientMessage(playerid, error, "Данный ник уже занят");
	GetPVarString(playerid, "NewNickName", named, sizeof(named));
	format(text, sizeof(text), "Игрок %s сменил(а) имя на %s", p_info[playerid][name], named);
	SendClientMessageToAll(info, text);
 	SetPlayerNickName(playerid, named);
	return 1;
}
CMD:aad(playerid,params[])
{
	if(p_info[playerid][admin] < 2) return 1;
	new string[144];
    if(sscanf(params, "s[128]", params[0])) return SendClientMessage(playerid,error, "Используйте: /aob [текст]");
	format(string, sizeof(string), "Администратор %s: %s",get_name(playerid), params[0]);
	return SendClientMessageToAll(iAdm, string);
}

CMD:a(playerid,params[])
{
    if(p_info[playerid][admin] == 0) return 1;
    if(sscanf(params, "s[70]", params[0])) return SendClientMessage(playerid,error, "Используйте: /a [текст]");
    new string[144];
	f(string,"[%d] %s[%d]: %s.", p_info[playerid][admin], get_name(playerid), playerid, params[0]);
	return SendAdminMessage(0xefd334ff, string);
}
CMD:gethere(playerid,params[])
{
  	if (p_info[playerid][admin] < 3) return true;
  	if(sscanf(params, "dd", params[0])) return SendClientMessage(playerid, error, "Используйте: /gethere [ид игрока]");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не в сети");
	if(playerid == params[0]) return true;
	new Float:POS[3],str[128];
	if(GetPlayerState(params[0]) == PLAYER_STATE_DRIVER)
	{
		new vehicleid = GetPlayerVehicleID(params[0]);
		GetPlayerPos(playerid, POS[0], POS[1], POS[2]);
		SetVehiclePos(vehicleid, POS[0], POS[1]+1, POS[2]);
		LinkVehicleToInterior(vehicleid, GetPlayerInterior(playerid));
		SetVehicleVirtualWorld(vehicleid, GetPlayerVirtualWorld(playerid));
		SetPlayerInterior(vehicleid, GetPlayerInterior(playerid));
		SetPlayerVirtualWorld(vehicleid, GetPlayerVirtualWorld(playerid));
	}
	else
	{
		GetPlayerPos(playerid, POS[0], POS[1], POS[2]);
		SetPlayerPos(params[0], POS[0], POS[1]+1, POS[2]);
		SetPlayerInterior(params[0], GetPlayerInterior(playerid));
		SetPlayerVirtualWorld(params[0], GetPlayerVirtualWorld(playerid));
	}
	SetCameraBehindPlayer(params[0]);
	f(str, "Ты был телепортирован к администратору %s", get_name(playerid));
	SendClientMessage(params[0],iAdm, str);
	return true;
}
CMD:goto(playerid,params[])
{
	if (p_info[playerid][admin] < 2) return 1;
	if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /goto [ид игрока]");
	if (!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок не в сети");
	if(playerid == params[0]) return true;
	new Float:x, Float:y, Float:z;
	GetPlayerPos(params[0], x, y, z);
	SetPlayerInterior(playerid, GetPlayerInterior(params[0]));
	SetPlayerVirtualWorld(playerid, GetPlayerVirtualWorld(params[0]));
	if (IsPlayerInAnyVehicle(playerid))
	{
		SetVehiclePos(GetPlayerVehicleID(playerid), x+1,y+1,z);
		return true;
	}
	SetPlayerPos(playerid, x+1, y+1, z);
	return true;
}
CMD:kick(playerid,params[])
{
    new string[144];
    if(p_info[playerid][admin] < 2) return 1;
    if(sscanf(params, "ds[44]", params[0],params[1])) return SendClientMessage(playerid, error, "Используйте /kick [id] [причина]");
	if(params[0] == INVALID_PLAYER_ID) return SendClientMessage(playerid, error, "Данный игрок оффлайн");
    if(strfind(params[1], "-", true) != -1)
    {
	    format(string, sizeof(string), "[SKick] %s был кикнут администратором %s",get_name(params[0]) ,get_name(playerid),params[1]);
		SendAdminMessage(error,string);
		Kick(params[0]);
	}
 	else
	{
	    format(string, sizeof(string), "%s был кикнут администратором %s. Причина: %s",get_name(params[0]) ,get_name(playerid),params[1]);
		SendClientMessageToAll(iAdm, string);
		Kick(params[0]);
		return true;
	}
    return true;
}

CMD:unwarn(playerid,params[])
{
   if(p_info[playerid][admin] >= 4)
   {
   	  new str[144];
      if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, error, "Используйте: /unwarn [id]");
      if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Данный игрок оффлайн");
	  p_info[params[0]][warn] = 0;
	  f(str, "Вы сняли все предупреждения с %s",get_name(params[0]));
	  SendClientMessage(playerid, iAdm,str);
	  f(str,"Администратор %s cнял с ваc все предупреждения",get_name(playerid));
	  SendClientMessage(params[0], iAdm,str);
   }
   return true;
}
CMD:warn(playerid,params[])
{
    new string[144];
	if(p_info[playerid][admin] < 3) return 1;
	if(sscanf(params, "ds[44]", params[0],params[1])) return SendClientMessage(playerid, error, "Используйте: /warn [id] [причина]");
	if(params[0] == INVALID_PLAYER_ID) return SendClientMessage(playerid, error, "Данный игрок не найден");
	p_info[params[0]][warn] += 1;
	if(p_info[params[0]][warn] >= 3)
	{
		format(string, sizeof(string), "%s забанен администратором %s на 3 дня. Причина: 3 Предупреждения",get_name(params[0]) ,get_name(playerid));
		SendClientMessageToAll(iAdm, string);
		p_info[params[0]][ban] = gettime()+(84600*3);
		Kick(params[0]);
		return true;
	}
	else
	{
	    format(string, sizeof(string), "%s получил %d/3 предупреждение от %s. Причина: %s",get_name(params[0]),p_info[params[0]][warn] ,get_name(playerid),params[1]);
		SendClientMessageToAll(iAdm, string);
		Kick(params[0]);
		return true;
	}
}
CMD:mute(playerid,params[])
{
    new string[144];
	if(p_info[playerid][admin] <= 1) return true;
    if(sscanf(params, "dds[44]", params[0],params[1],params[2])) return SendClientMessage(playerid, error, "Используйте: /mute [id] [время 1-60] [причина]");
	if(params[1] < 0 || params[1] > 60) return SendClientMessage(playerid, error, "Используй время от 0 до 60");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error,  "Игрок с таким id не найден");
	p_info[params[0]][mute] = params[1]*60;
	if(params[1] == 0)
	{
	    
		f(string, "Администратор %s снял молчанку у %s.", get_name(playerid),get_name(params[0]));
		SendClientMessageToAll(iAdm, string);
	}
	else
	{
		f(string, "Администратор %s выдал молчанку %s на %d минут. Причина: %s", get_name(playerid),get_name(params[0]), params[1], params[2]);
		SendClientMessageToAll(iAdm, string);
	}
	return true;
}
CMD:ban(playerid,params[])
{
    if(p_info[playerid][admin] < 3) return 1;
    if(sscanf(params, "dds[44]", params[0],params[1],params[2])) return SendClientMessage(playerid, error, "Используйте: /ban [id] [дни] [причина]");
	if(params[0] == INVALID_PLAYER_ID) return SendClientMessage(playerid, error,  "Игрок с таким id не найден");
    if(params[1] > 30 || params[1] < 1) return SendClientMessage(playerid, error, "Кол-во дней бана - от 1 до 30");
	new string[144];
	
 	if(p_info[params[0]][admin] != 0) return SendClientMessage(playerid, error,"Нельзя выдать бан администратору!");
   	format(string, sizeof(string), "%s забанен администратором %s на %d дней. Причина: %s",get_name(params[0]) ,get_name(playerid),params[1],params[2]);
	SendClientMessageToAll(iAdm, string);
	p_info[playerid][ban] = gettime()+(86400*params[1]);
	Kick(params[0]);
   	return true;
}
CMD:unban(playerid,params[])
{
	if(p_info[playerid][admin] != 5) return 1;
	new qstring[144];
    if(sscanf(params, "s[24]", params[0])) return SendClientMessage(playerid, error, "Используйте /ban [Имя]");
    format(qstring,sizeof(qstring), "SELECT * FROM accounts WHERE `name`='%s'", params[0]);
	mysql_tquery(con_bd, qstring, "un_ban", "is", playerid, params[0]);
	return 1;
}

forward un_ban(playerid,names[]);
public un_ban(playerid,names[])
{
    new query[128],_ban;
    cache_get_value_name_int(0, "ban",_ban);
    if(_ban <= 0) return SendClientMessage(playerid,error,"Информация: У данного игрока нет бана");
    format(query,sizeof(query),"UPDATE accounts SET `ban` = '0' WHERE `name` = '%s'",names);
    mysql_tquery(con_bd, query, "", "");
    f(query, "%s разбанил игрока %s (в режиме offline)",get_name(playerid),names);
    SendAdminMessage(error,query);
    return true;
}
CMD:ans(playerid, params[])
{
	new str[144];
    if(p_info[playerid][admin] == 0) return 1;
    if(sscanf(params,"us[150]",params[0],params[1])) return SendClientMessage(playerid, error, "Используйте: /ans [id] [ответ]");
    if(!IsPlayerConnected(params[0])) return 1;
	f(str,"Администратор %s ответил вам:{FFFFFF} %s",get_name(playerid),params[1]);
    SendClientMessage(params[0],iAdm,str);
    f(str,"[A] %s[%d] ответил игроку %s[%d]: %s",get_name(playerid),playerid,get_name(params[0]),params[0],params[1]);
    SendAdminMessage(iAdm,str);
    return true;
}

new vehAdmin[MAX_VEHICLES char],ADMCAR;
CMD:veh(playerid,params[])
{
	new Float: pos[3];
    if(p_info[playerid][admin] < 2 ) return true;
	if(sscanf(params, "id", params[0],params[1])) return SendClientMessage(playerid, server, "Используйте: /veh [ ид ] [ цвет ]");
	GetPlayerPos(playerid,pos[0],pos[1],pos[2]);
	vehAdmin[ADMCAR] = CreateVehicle(params[0],pos[0],pos[1],pos[2],90.0000000,params[1],params[1],1500);
	ADMCAR++;
	return 1;
}
CMD:dellveh(playerid)
{
	if(p_info[playerid][admin] < 4 ) return true;
	for(new i; i<ADMCAR; i++) DestroyVehicle(vehAdmin[i]);
	return	SendClientMessage(playerid, error, "Вы удалили весь транспорт созданный администраторами");
}
CMD:gmoney(playerid, params[])
{
	new str[124];
    if(p_info[playerid][admin] != 5) return true;
	if(sscanf(params, "id", params[0],params[1])) return SendClientMessage(playerid, server, "Используйте: /gmoney [ ид ] [ деньги ]");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error,  "Игрок с таким id не найден");
	set_money(params[0], params[1]);
	format(str, sizeof(str),"Администратор %s выдал вам %d$",get_name(playerid),params[1]);
	SendClientMessage(params[0],iAdm, str);
	return 1;
}
CMD:setjob(playerid, params[])
{
    new str[24],string[128];
    if(p_info[playerid][admin] != 5) return true;
	if(sscanf(params, "id", params[0],params[1])) return SendClientMessage(playerid, server, "Используйте: /setjob [ ид ] [ id работы ]"),SendClientMessage(playerid, server, "ID 1: Водитель автобуса / ID 2: Водитель такси / ID 3: Развозчик Продуктов");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error,  "Игрок с таким id не найден");
	if(p_info[params[0]][member] != 0) return SendClientMessage(playerid, error,  "Данный игрок состоит во фракции");
	p_info[params[0]][job] = params[1];
	
	if(params[1] == 1) format(str, sizeof(str), "'Водитель автобуса'");
	if(params[1] == 2) format(str, sizeof(str), "'Таксист'");
	if(params[1] == 3) format(str, sizeof(str), "'Развозчик Продуктов'");
	
	format(string, sizeof(string), "Администратор %s устроил вас на работу %s", get_name(playerid), str);
	SendClientMessage(playerid, iAdm, string);
	format(string, sizeof(string), "Вы устроили %s на работу %s", get_name(params[0]), str);
	SendClientMessage(playerid, info, string);
	return 1>0;
}
CMD:makeleader(playerid, params[])
{
    new string[144];
    if(p_info[playerid][admin] != 5) return true;
	if(sscanf(params, "d", params[0])) return SendClientMessage(playerid, server, "Используйте: /makeleader [ id ]");
	if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Игрок не подключен к серверу");
	f(string, "Назначить %s лидером фракции:",get_name(params[0]));
	ShowPlayerDialog(playerid, 15, DIALOG_STYLE_LIST, string, "– Снять лидерство\nПолиция Лос-Сантос\nПолиция Cан Фиерро\nПолиция Лас Вентурас\nФедеральное Бюро Расследований\nАрмия\nРадиоцентр\
	\nРусская мафия\nLa Cosa Nostra\nYakuza\nGrove St.\nE.S Ballas\nThe Rifa\nEl`Corona\nVagos Gang", "Выдать", "Закрыть");
	SetPVarInt(playerid, "@idLeader",params[0]);
	return 1;
}
CMD:create(playerid)
{
	if(p_info[playerid][admin] != 5) return 1;
	new str[128];
	f(str, "Создать дом\tCоздано: %d\nСоздать бизнес\tСоздано: %d",totalhouses,totalbiz);
    return ShowPlayerDialog(playerid, 16, DIALOG_STYLE_TABLIST, "Меню создания:", str, "Выбор","Закрыть");
}

CMD:findcar(playerid)
{
    if(p_info[playerid][veh_id] == 60605) return SendClientMessage(playerid, error, "Вы не владеете машиной");
	new Float:POS[3];
	GetVehiclePos(p_info[playerid][veh_id], POS[0], POS[1], POS[2]);
	if(GetPVarInt(playerid, "GPS_CAR"))
	{
		DisablePlayerCheckpoint(playerid);
		SetPVarInt(playerid, "GPS_CAR",0);
		SendClientMessage(playerid,error,"Метка вашего транспорта отключена");
		return 1;
	}
	SetPlayerCheckpoint(playerid,POS[0], POS[1], POS[2],5.0);
	SetPVarInt(playerid, "GPS_CAR",1);
	return SendClientMessage(playerid,server,"Транспорт отмечен на карте красной меткой (для отмены повторите ввод команды)");
}

CMD:deltune(playerid)
{
    new Float:POS[4],getcar = 60605;
	GetVehiclePos(p_info[playerid][veh_id], POS[0], POS[1], POS[2]);
    if(IsPlayerInRangeOfPoint(playerid,5.0, POS[0], POS[1], POS[2])) getcar = p_info[playerid][veh_id];
	if(getcar == 60605) return SendClientMessage(playerid, error, "Вы находитесь слишком далеко от своей машины");
    for(new i; i<13;i++) RemoveVehicleComponent(p_info[playerid][veh_id],veh_info[p_info[playerid][veh_id]][v_tun][i]),
    veh_info[p_info[playerid][veh_id]][v_tun][i] = 0;
	return 1;
}
CMD:park(playerid)
{
    if(p_info[playerid][veh_id] == 60605) return SendClientMessage(playerid, error, "Вы не владеете машиной");
	new Float:POS[4],getcar = 60605;
	GetVehiclePos(p_info[playerid][veh_id], POS[0], POS[1], POS[2]);
    if(IsPlayerInRangeOfPoint(playerid,5.0, POS[0], POS[1], POS[2])) getcar = p_info[playerid][veh_id];
	if(getcar == 60605) return SendClientMessage(playerid, error, "Вы находитесь слишком далеко от своей машины");
	GetVehicleZAngle(p_info[playerid][veh_id], POS[3]);
	veh_info[p_info[playerid][veh_id]][v_pos][0] = POS[0];
	veh_info[p_info[playerid][veh_id]][v_pos][1] = POS[1];
	veh_info[p_info[playerid][veh_id]][v_pos][2] = POS[2];
	veh_info[p_info[playerid][veh_id]][v_pos][3] = POS[3];
	return SendClientMessage(playerid,error, "Машина успешно припаркована");
}
CMD:fixcar(playerid)
{
    if(p_info[playerid][veh_id] == 60605) return SendClientMessage(playerid, error, "Вы не владеете машиной");
	if(p_info[playerid][cash] < 300) return SendClientMessage(playerid, error,"Недостаточно денег. Требуется 350$");
	VehSpwn(p_info[playerid][veh_id]);
	PlayerPlaySound(playerid, 1052, 0.0, 0.0, 0.0);
	set_money(playerid, -350);
	return SendClientMessage(playerid, info, "Ваш транспорт доставлен к дому");
}
CMD:lock(playerid)
{
	new Float:POS[3],getcar = 60605;
	if(p_info[playerid][veh_id] == 60605) return SendClientMessage(playerid, error, "Вы не владеете машиной");
	GetVehiclePos(p_info[playerid][veh_id], POS[0], POS[1], POS[2]);
	if(IsPlayerInRangeOfPoint(playerid, 5,POS[0], POS[1], POS[2])) getcar = p_info[playerid][veh_id];
	if(getcar == 60605) return SendClientMessage(playerid, error, "Ты находишься слишком далеко от своей машины");
	if(!veh_info[getcar][v_lock])
	{
		GameTextForPlayer(playerid, "~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~r~vehicle locked", 1000, 3);
	    PlayerPlaySound(playerid, 1145, 0.0, 0.0, 0.0);
	    GetVehicleParamsEx(getcar,engine,lights,alarm,doors,bonnet,boot,objective);
	    SetVehicleParamsEx(getcar,engine,lights,alarm,true,bonnet,boot,objective);
        SetPlayerChatBubble(playerid, "Закрыл машину", error, 30.0, 5000);
		veh_info[getcar][v_lock] = 1;
		if(IsPlayerInAnyVehicle(playerid)) PlayerTextDrawColor(playerid, speedTD[playerid][1], 0xFF0000FF),
		PlayerTextDrawShow(playerid, speedTD[playerid][1]);
	}
	else
	{
	    GameTextForPlayer(playerid, "~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~g~vehicle unlocked", 1000, 3);
        PlayerPlaySound(playerid, 1145, 0.0, 0.0, 0.0);
	    GetVehicleParamsEx(getcar,engine,lights,alarm,doors,bonnet,boot,objective);
	    SetVehicleParamsEx(getcar,engine,lights,alarm,false,bonnet,boot,objective);
        SetPlayerChatBubble(playerid, "Открыл машину", error, 30.0, 5000);
		veh_info[getcar][v_lock] = 0;
		if(IsPlayerInAnyVehicle(playerid)) PlayerTextDrawColor(playerid, speedTD[playerid][1],8388863),
		PlayerTextDrawShow(playerid, speedTD[playerid][1]);
	}
	return true;
}
CMD:sellmycar(playerid, params[])
{
    new string[256],
        Float:POS[3];
 	if(GetPVarInt(playerid,"pred") != 60605) return SendClientMessage(playerid, error, "Вы уже делали предложение. Чтобы отменить его нажмите N");
	if(p_info[playerid][veh_id] == 60605) return SendClientMessage(playerid, error, "Вы не владеете собственной машиной");
	GetVehiclePos(p_info[playerid][veh_id], POS[0], POS[1], POS[2]);
	if(!IsPlayerInRangeOfPoint(playerid,8,  POS[0], POS[1], POS[2])) return SendClientMessage(playerid, error, "Вы находитесь слишком далеко от своей машины");
    if(sscanf(params, "dd", params[0], params[1])) return SendClientMessage(playerid, error,   "Используйте /sellmycar [id] [ цена ]");
	if(params[1] < 500 || params[1] > 25000000) return  SendClientMessage(playerid, error,  "Нельзя продать меньше чем за 500$!");
	if(p_info[params[0]][veh_id] != 60605) return SendClientMessage(playerid, error, "У этого игрока уже есть автомобиль!");
	if(params[0] == INVALID_PLAYER_ID ||  !IsPlayerConnected(params[0])) return SendClientMessage(playerid, -1, "Игрок не найден");

    f(string,"Вы предложили "W"%s "I"купить ваш автомобиль за "W"%d$",get_name(params[0]),params[1]);
	SendClientMessage(playerid,info,string);
	f(string,"%s "I"предлагает вам купить его автомобиль за "W"%d$",get_name(playerid),params[1]);
    SendClientMessage(params[0],white,string),
	SendClientMessage(params[0], white, "Нажмите {03c03c}Y "W"чтобы купить его или {ff7518}N "W"для отказа");
	
    SetPVarInt(params[0], "my_id",playerid);
	SetPVarInt(params[0], "price_car",params[1]);
	SetPVarInt(params[0],"auto_buy",1);
	SetPVarInt(playerid,"pred",playerid);
	return true;
}
CMD:sellcar(playerid)
{
    if(p_info[playerid][veh_id] == 60605) return SendClientMessage(playerid, error, "Вы не владеете машиной");
    new Float:POS[4],getcar = 60605;
	GetVehiclePos(p_info[playerid][veh_id], POS[0], POS[1], POS[2]);
    if(IsPlayerInRangeOfPoint(playerid,5, POS[0], POS[1], POS[2])) getcar = p_info[playerid][veh_id];
	if(getcar == 60605) return SendClientMessage(playerid,error, "Вы находитесь слишком далеко от своей машины");
    new string[144];
    f(string, ""W"Вы уверены что хотите продать Ваш личный транспорт (%s) государству за %d$?",VehicleNames[veh_info[p_info[playerid][veh_id]][v_model]-400],veh_info[p_info[playerid][veh_id]][v_price]/2);
	ShowPlayerDialog(playerid, 23, DIALOG_STYLE_MSGBOX, "Продажа транспорта", string, "Да", "Нет");
	return 1;
}
	
public OnPlayerEnterVehicle(playerid, vehicleid, ispassenger)
{
    if((GetPlayerRentTaxi[playerid] != -1 || GetPlayerRentBus[playerid] != -1 || GetCarDelivery[playerid] != -1) && ExitCount[playerid] > 0)
	{
		if((GetPlayerRentTaxi[playerid] == vehicleid || GetPlayerRentBus[playerid] == vehicleid || GetCarDelivery[playerid] == vehicleid) && ExitCount[playerid] > 0)
		{
		}
		else return SendClientMessage(playerid, error, "Вы не закончили рабочий день на другом транспорте"),TogglePlayerControllable(playerid,true);
	}
    return 1;
}
public OnPlayerExitVehicle(playerid, vehicleid)
{
    
	return 1;
}

public OnPlayerStateChange(playerid, newstate, oldstate)
{

    if(newstate == PLAYER_STATE_DRIVER)
	{
	    if(GetPlayerVehicleID(playerid) >= lspd_car[0] && GetPlayerVehicleID(playerid) <= lspd_car[1] && p_info[playerid][member] != 1)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Вам запрещено управлять транспортом \"Полиции Лос Сантос\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= sfpd_car[0] && GetPlayerVehicleID(playerid) <= sfpd_car[1] && p_info[playerid][member] != 2)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Вам запрещено управлять транспортом \"Полиции Сан Фиерро\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= lvpd_car[0] && GetPlayerVehicleID(playerid) <= lvpd_car[1] && p_info[playerid][member] != 3)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Вам запрещено управлять транспортом \"Полиции Лас Вентурас\"");
			return 1;
		}
        if(GetPlayerVehicleID(playerid) >= fbi_car[0] && GetPlayerVehicleID(playerid) <= fbi_car[1] && p_info[playerid][member] != 4)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Вам запрещено управлять транспортом \"Федерального Бюро Расследований\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= army_car[0] && GetPlayerVehicleID(playerid) <= army_car[1] && p_info[playerid][member] != 5)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"Армии\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= smi_car[0] && GetPlayerVehicleID(playerid) <= smi_car[1] && p_info[playerid][member] != 6)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"Радиоцентра\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= rm_car[0] && GetPlayerVehicleID(playerid) <= rm_car[1] && p_info[playerid][member] != 7)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"Русская мафия\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= lcn_car[0] && GetPlayerVehicleID(playerid) <= lcn_car[1] && p_info[playerid][member] != 8)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"La Cosa Nostra\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= yakuza_car[0] && GetPlayerVehicleID(playerid) <= yakuza_car[1] && p_info[playerid][member] != 9)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"Якудза\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= grove_car[0] && GetPlayerVehicleID(playerid) <= grove_car[1] && p_info[playerid][member] != 10)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"Grove Street\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= ballas_car[0] && GetPlayerVehicleID(playerid) <= ballas_car[1] && p_info[playerid][member] != 11)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"E.S Ballas\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= rifa_car[0] && GetPlayerVehicleID(playerid) <= rifa_car[1] && p_info[playerid][member] != 12)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"The Rifa\"");
			return 1;
		}
		if(GetPlayerVehicleID(playerid) >= el_corona_car[0] && GetPlayerVehicleID(playerid) <= el_corona_car[1] && p_info[playerid][member] != 13)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"El Corona\"");
			return 1;
		}
  		if(GetPlayerVehicleID(playerid) >= vagos_car[0] && GetPlayerVehicleID(playerid) <= vagos_car[1] && p_info[playerid][member] != 14)
		{
			RemovePlayerFromVehicle(playerid);
			SendClientMessage(playerid, error, "Тебе запрещено управлять транспортом \"L.S Vagos\"");
			return 1;
		}
        if(GetPlayerVehicleID(playerid) >= dSchoolCar[0] && GetPlayerVehicleID(playerid) <= dSchoolCar[7]) //__автошкола
        {
		    if(p_info[playerid][lic] == 0 && GetPVarInt(playerid, "EKZAMEN") == 1411)
			{
				SetPlayerRaceCheckpoint(playerid,0,-2046.8743,-98.0073,34.7391,-2046.7941,-77.9387,34.7326,5.0);
				SetPVarInt(playerid,"LESCAR", CHECKPOINT_1);
				SendClientMessage(playerid, info, "Выезжайте на дорогу и проедте по красным меткам");
				SendClientMessage(playerid, error, "Правила: Не превышайте допустимую скорость! Не ударьте автомобиль!");
			}
			else RemovePlayerFromVehicle(playerid);
		}
	    if(GetVehicleModel(GetPlayerVehicleID(playerid)) != 481 || GetVehicleModel(GetPlayerVehicleID(playerid)) != 531 || GetVehicleModel(GetPlayerVehicleID(playerid)) != 510)
	    {
	        SendClientMessage(playerid, info, "Для того чтобы завести двигатель нажмите 'Ctrl'");
	        GetVehicleParamsEx(GetPlayerVehicleID(playerid),engine,lights,alarm,doors,bonnet,boot,objective);
			if doors == 1*then PlayerTextDrawColor(playerid,speedTD[playerid][1],0xFF0000FF );
			else PlayerTextDrawColor(playerid,speedTD[playerid][1],8388863);
        	for(new i; i < 6 ; i ++) PlayerTextDrawShow(playerid,speedTD[playerid][i]);
			SetPVarInt(playerid, "SPEED",SetTimerEx("SpeedoUpdate", GetPlayerPing(playerid) * 10, true, "d", playerid));
		}
		if( GetPlayerVehicleID(playerid) >= BUS[0] && GetPlayerVehicleID(playerid) <= BUS[1])
		{
		    if(p_info[playerid][job] != 1)
			{
		    	RemovePlayerFromVehicle(playerid);
		    	KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
				return SendClientMessage(playerid, error, "Вы не устроились на работу водителя автобуса!");
			}
			if(bus_info[GetPlayerVehicleID(playerid)] == 1 && GetPlayerRentBus[playerid] != GetPlayerVehicleID(playerid)) return SendClientMessage(playerid,error, "Данный автобус уже кем-то занят"),RemovePlayerFromVehicle(playerid);
            if(GetPlayerVehicleID(playerid) != GetPlayerRentBus[playerid] && GetPlayerRentBus[playerid] != -1) return SendClientMessage(playerid,error, "Вами уже занят другой автобус"),RemovePlayerFromVehicle(playerid);
			if(GetPlayerRentBus[playerid] != GetPlayerVehicleID(playerid))
			{
				KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
    			ShowPlayerDialog(playerid, 11, DIALOG_STYLE_MSGBOX, "Автопарк", ""W"Чтобы взять автобус, необходимо заплатить городскому автопарку 200$\n\
				Вы действительно хотите взять автобус в аренду?\
				", "Да", "Нет");
			}
			else
			{
			    ExitCount[playerid] = 0;
				KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
			}
		}
		if( GetPlayerVehicleID(playerid) >= TAXI[0] && GetPlayerVehicleID(playerid) <= TAXI[1])
		{
		    if(p_info[playerid][job] != 2)
			{
		    	RemovePlayerFromVehicle(playerid);
		    	KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
				return SendClientMessage(playerid, error, "Вы не устроились на работу таксиста!");
			}
			if(taxi_info[GetPlayerVehicleID(playerid)] == 1 && GetPlayerRentTaxi[playerid] != GetPlayerVehicleID(playerid)) return SendClientMessage(playerid,error, "Данный транспорт уже кем-то занят"),RemovePlayerFromVehicle(playerid);
            if(GetPlayerVehicleID(playerid) != GetPlayerRentTaxi[playerid] && GetPlayerRentTaxi[playerid] != -1) return SendClientMessage(playerid,error, "Вами уже занят другой транспорт"),RemovePlayerFromVehicle(playerid);
			if(GetPlayerRentTaxi[playerid] != GetPlayerVehicleID(playerid))
			{
				KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
    			ShowPlayerDialog(playerid, 56, DIALOG_STYLE_MSGBOX, "Автопарк", ""W"Чтобы взять машину, необходимо заплатить городскому автопарку 200$\n\
				Вы действительно хотите взять его в аренду?\
				", "Да", "Нет");
			}
			else
			{
   				ExitCount[playerid] = 0;
				KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
			}
		}
		if( GetPlayerVehicleID(playerid) >= carDelivery[0] && GetPlayerVehicleID(playerid) <= carDelivery[1] || GetPlayerVehicleID(playerid) >= carGasTanker[0] && GetPlayerVehicleID(playerid) <= carGasTanker[1])
		{
		    if(p_info[playerid][job] != 3)
			{
		    	RemovePlayerFromVehicle(playerid);
		    	KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
				return SendClientMessage(playerid, error, "Вы не устроились на работу развозчик продуктов/топлива!");
			}
			if(dlv_info[GetPlayerVehicleID(playerid)] == 1 && GetCarDelivery[playerid] != GetPlayerVehicleID(playerid)) return SendClientMessage(playerid,error, "Данный транспорт уже кем-то занят для развозки"),RemovePlayerFromVehicle(playerid);
            if(GetPlayerVehicleID(playerid) != GetCarDelivery[playerid] && GetCarDelivery[playerid] != -1) return SendClientMessage(playerid,error, "Вами уже занят другой транспорт для развозки"),RemovePlayerFromVehicle(playerid);
			if(GetCarDelivery[playerid] != GetPlayerVehicleID(playerid))
			{
				KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
				ShowPlayerDialog(playerid, 48, DIALOG_STYLE_MSGBOX, "Работа 'Развозчик'", ""W"Вы хотите начать работу развозчиком?", "Да", "Нет");
			}
			else
			{
			    GetVehicleParamsEx(GetCarDelivery[playerid],engine,lights,alarm,doors,bonnet,boot,objective);
		    	SetVehicleParamsEx(GetCarDelivery[playerid],engine,lights,alarm,true,bonnet,boot,objective);
			    ExitCount[playerid] = 0;
				KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
			}
		}
	    if(GetPlayerVehicleID(playerid) >= salonCar[0] && GetPlayerVehicleID(playerid) <= salonCar[1])
		{
			new string[174];
			format(string, sizeof(string), "Марка автомобиля:\t "I"%s [ID: %d]{ffffff}\n- Стоимость автомобиля:\t "I"%d$\n\n\n{ffffff} * Для покупки нажмите "I"'Купить'",VehicleNames[GetVehicleModel(GetPlayerVehicleID(playerid))-400],GetVehicleModel(GetPlayerVehicleID(playerid)), PriceCar(GetPlayerVehicleID(playerid)));
			ShowPlayerDialog(playerid,22,DIALOG_STYLE_MSGBOX,"Автоcалон",string,"Купить","Отмена");
		}
	}
	if(oldstate == 2)
	{
	    if(GetPlayerRentTaxi[playerid] != -1)
		{
		    KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
		    ExitCount[playerid] = 15;
		    SendClientMessage(playerid,error, "У вас есть 15 секунд чтобы вернуться в такси");
	    	SetPVarInt(playerid, "ExitCarTimer",SetTimerEx("OnPlayerExitCar", 1000, true, "i", playerid));
		}
	    if(GetPlayerRentBus[playerid] != -1)
		{
			KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
		    ExitCount[playerid] = 15;
		    SendClientMessage(playerid,error, "У вас есть 15 секунд чтобы вернуться в автобус");
	    	SetPVarInt(playerid, "ExitCarTimer",SetTimerEx("OnPlayerExitCar", 1000, true, "i", playerid));
		}
		if(GetCarDelivery[playerid] != -1)
		{
			KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
		    ExitCount[playerid] = 15;
		    GetVehicleParamsEx(GetCarDelivery[playerid],engine,lights,alarm,doors,bonnet,boot,objective);
			SetVehicleParamsEx(GetCarDelivery[playerid],engine,lights,alarm,false,bonnet,boot,objective);
	    	SendClientMessage(playerid,error, "У вас есть 15 секунд чтобы вернуться в фургон/фуру");
	    	SetPVarInt(playerid, "ExitCarTimer",SetTimerEx("OnPlayerExitCar", 1000, true, "i", playerid));
		}
	    if(GetPVarInt(playerid,"EKZAMEN") == 1411)
	    {
	        SendClientMessage(playerid,error, "Во время сдачи на права, нельзя выходить из автомобиля! Экзамен завершен.");
	        DisablePlayerRaceCheckpoint(playerid);
	        SetPVarInt(playerid,"EKZAMEN",0);
	        SetVehicleToRespawn(GetPlayerVehicleID(playerid));
	    }
	    for(new i; i < 6; i ++) PlayerTextDrawHide(playerid,speedTD[playerid][i]);
    	KillTimer(GetPVarInt(playerid, "SPEED"));
	}
	if(newstate == PLAYER_STATE_PASSENGER)
	{
  	    if(GetPlayerVehicleID(playerid) >= TAXI[0] && GetPlayerVehicleID(playerid) <= TAXI[1])//Данную функцию надо TEST
    	{
   			for(new i=0; i<GetMaxPlayers(); i++)
   			{
   			    if(IsPlayerConnected(i) && GetPlayerVehicleSeat(i) == 0 && GetPlayerVehicleID(i) == GetPlayerVehicleID(playerid) && GetPlayerRentTaxi[i] != -1 && GetPVarInt(i, "@startJob"))
    			{
					if(p_info[playerid][cash] < GetPVarInt(i, "@payment")) return SendClientMessage(playerid, error, "У Вас не хватает денег на проезд");
    			    new string[256];
					format(string, sizeof(string),"%s сел в ваше такси. Оплата произведена", get_name(playerid));
					SendClientMessage(i, error, string);
					format(string, sizeof(string),"Вы сели в такси к %s. Оплата произведена", get_name(i));
					SendClientMessage(playerid, error, string);
 					set_money(playerid, -GetPVarInt(i, "@payment"));
					set_money(i , GetPVarInt(i, "@payment"));
                    SetPVarInt(i, "@passenger",GetPVarInt(i, "@passenger")+1);
					break;
   			    }
   			}
    	}
		if(GetPlayerVehicleID(playerid) >= BUS[0] && GetPlayerVehicleID(playerid) <= BUS[1])//Данную Функцию надо TEST
		{
		    if(bus_info[GetPlayerVehicleID(playerid)] == 1)
		    {
			    for(new i=0; i<GetMaxPlayers(); i++)
				{
					if(IsPlayerConnected(i) && GetPlayerVehicleSeat(i) == 0 && GetPlayerVehicleID(i) == GetPlayerVehicleID(playerid) && GetPlayerRentBus[i] != -1 && GetPVarInt(i, "@startJob"))
	  			    {

				    	if(p_info[playerid][cash] >= GetPVarInt(i, "@payment")) set_money(playerid, -GetPVarInt(i, "@payment"));
						else return RemovePlayerFromVehicle(playerid),SendClientMessage(playerid, error, "У Вас не хватает денег на проезд");
			   			SetPVarInt(i, "@passenger",GetPVarInt(i, "@passenger")+1);
			   			GameTextForPlayer(i,"+passenger", 1000, 3);
						break;
			   		}
				}
		    }
		}
	}
	return 1;
}
public OnPlayerEnterCheckpoint(playerid)
{
    if(GetPVarInt(playerid, "GPS_CAR")) DisablePlayerCheckpoint(playerid),SetPVarInt(playerid, "GPS_CAR",0);
    if(IsPlayerInRangeOfPoint(playerid, 0.5,2542.2380,-1290.9963,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2544.4521,-1290.9703,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2553.8679,-1291.0043,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2556.1863,-1291.0042,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2558.4622,-1290.9938,1044.1250))
	{
  		if(GetPVarInt(playerid,"zavod") && GetPVarInt(playerid, "kgfor"))
	    {
	        TogglePlayerControllable(playerid, 0);
	        SetPVarInt(playerid, "kgfor",2);
		    SetPVarInt(playerid,"zavod",1),SetPVarInt(playerid,"zav",0);
			SetPVarInt(playerid,"startmolot",1);
			ClearAnimations(playerid);
			SetPlayerFacingAngle(playerid, 180.0);
			new Float:px,Float:py,Float:pz;
			GetPlayerPos(playerid,px,py,pz);
			obje[playerid] = CreateObject(11705,px,py-0.8,pz-0.1,0.00000000,0.00000000,0.00000000);
			SetPlayerAttachedObject(playerid,1, 18635, 14, 0.264531, 0.121060, 0.022172, 279.757507, 164.484985, 184.886245);// дали молоток
			SetPlayerAttachedObject(playerid,2, 18644, 13, 0.334366, 0.015833, -0.035214, 294.913085, 188.347946, 235.000213);// дали otvertku
			ApplyAnimation(playerid,"INT_SHOP","shop_cashier",4.1,1,0,0,1,11000);//    WEAPON_csawlo,
			SetPVarInt(playerid,"zav", 1);
		    SetPVarInt(playerid,"prod",1);
		    SetPVarInt(playerid, "factory_timer", SetTimerEx("factoryFinish", 6000, 0,"d",playerid));
			return 1;
		}
	}
	if(IsPlayerInRangeOfPoint(playerid, 0.5,2558.5881,-1295.8517,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2556.1011,-1295.8510,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2553.7939,-1295.8531,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2544.3843,-1295.8563,1044.1250)
	|| IsPlayerInRangeOfPoint(playerid, 0.5,2541.9963,-1295.8523,1044.1250))
	{
  		if(GetPVarInt(playerid,"zavod") && GetPVarInt(playerid, "kgfor"))
	    {
	        TogglePlayerControllable(playerid, 0);
	        SetPVarInt(playerid, "kgfor",2);
		    SetPVarInt(playerid,"zav",0);
			
			SetPVarInt(playerid,"startmolot",1);
			ClearAnimations(playerid);
			SetPlayerFacingAngle(playerid, 0.0);
			new Float:px,Float:py,Float:pz;
			GetPlayerPos(playerid,px,py,pz);
			obje[playerid] = CreateObject(11705,px,py+0.8,pz-0.1,0.00000000,0.00000000,0.00000000);
			SetPlayerAttachedObject(playerid,1, 18635, 14, 0.264531, 0.121060, 0.022172, 279.757507, 164.484985, 184.886245);// дали молоток
			SetPlayerAttachedObject(playerid,2, 18644, 13, 0.334366, 0.015833, -0.035214, 294.913085, 188.347946, 235.000213);// дали otvertku
			ApplyAnimation(playerid,"INT_SHOP","shop_cashier",4.1,1,0,0,1,11000);//    WEAPON_csawlo,
			SetPVarInt(playerid,"zav", 1);
		    SetPVarInt(playerid,"prod",1);
		    SetPVarInt(playerid, "factory_timer", SetTimerEx("factoryFinish", 6000, 0,"d",playerid));
			return 1;
		}
	}
	if(IsPlayerInRangeOfPoint(playerid,2.0,2564.7886,-1292.9886,1044.1250))
	{
	    if(GetPVarInt(playerid, "meshokin") == 1)
	    {
	        new string[84];
	        SetPVarInt(playerid,"startmolot",0);
	        SetPVarInt(playerid,"meshokin",0);
			SetPVarInt(playerid, "kgfor",0);
			zprod += 2;
			zfuel +=2;//для фуела отдельную систему производства бы
			if(IsPlayerAttachedObjectSlotUsed(playerid,1)) RemovePlayerAttachedObject(playerid,1);
			SetPVarInt(playerid, "kg_zavod",GetPVarInt(playerid, "kg_zavod")+2);
			format(string,sizeof(string),"Вы изготовили продукт. Всего изготовлено: %d",GetPVarInt(playerid, "kg_zavod")/2);
			SendClientMessage(playerid, error, string);
  			_@3DTEXT();
		}
	}
	return 1;
}

public OnPlayerLeaveCheckpoint(playerid)
{
	return 1;
}

public OnPlayerEnterRaceCheckpoint(playerid)
{
	
	if(GetPVarInt(playerid, "biz_zakaz") != -1)
	{
		if(b_info[GetPVarInt(playerid, "biz_zakaz")][_tip] == 4)
		{
			if(!IsTrailerAttachedToVehicle(GetPlayerVehicleID(playerid))) return SendClientMessage(playerid,error,"Вы не в фуре или у вас нет цистерны");
			if(loadCar[GetCarDelivery[playerid]] != GetPVarInt(playerid, "zakaz")) return SendClientMessage(playerid, error, "Вы видимо забыли груз на заводе!");
			b_info[GetPVarInt(playerid, "biz_zakaz")][_bank] -= GetPVarInt(playerid, "zakaz")*2;
			b_info[GetPVarInt(playerid, "biz_zakaz")][_prod] += GetPVarInt(playerid, "zakaz");
			b_info[GetPVarInt(playerid, "biz_zakaz")][_zakaz] = 0;
			b_info[GetPVarInt(playerid, "biz_zakaz")][_status] = 0;
			SendClientMessage(playerid, info, "Вы доставили груз. Получите ваши деньги "E"(Новый заказ: /list)");
			set_money(playerid, GetPVarInt(playerid, "zakaz")*2);
			
			DeletePVar(playerid, "zakaz");
			SetPVarInt(playerid, "biz_zakaz", -1);
			DisablePlayerRaceCheckpoint(playerid);
		}
		else if(b_info[GetPVarInt(playerid, "biz_zakaz")][_tip] != 4)
		{
			if(GetVehicleModel(GetPlayerVehicleID(playerid)) != 440) return SendClientMessage(playerid,error,"Вы не в рабочем транспорте");
			if(loadCar[GetCarDelivery[playerid]] != GetPVarInt(playerid, "zakaz")) return SendClientMessage(playerid, error, "Вы видимо забыли груз на заводе!");
			b_info[GetPVarInt(playerid, "biz_zakaz")][_bank] -= GetPVarInt(playerid, "zakaz")*6;
			b_info[GetPVarInt(playerid, "biz_zakaz")][_prod] += GetPVarInt(playerid, "zakaz");
			b_info[GetPVarInt(playerid, "biz_zakaz")][_zakaz] = 0;
			b_info[GetPVarInt(playerid, "biz_zakaz")][_status] = 0;
			SendClientMessage(playerid, info, "Вы доставили груз. Получите ваши деньги "E"(Новый заказ: /list)");
			set_money(playerid, GetPVarInt(playerid, "zakaz")*6);
			DeletePVar(playerid, "zakaz");
			SetPVarInt(playerid, "biz_zakaz", -1);
            DisablePlayerRaceCheckpoint(playerid);
		}
	}
    if(GetPVarInt(playerid, "EKZAMEN") == 1411)
    {
        switch(GetPVarInt(playerid, "LESCAR"))
        {
            case CHECKPOINT_1: SetPVarInt(playerid, "LESCAR", CHECKPOINT_3),SetPlayerRaceCheckpoint(playerid, 0,-2046.7941,-77.9387,34.7326,-2013.7896,-72.9510,34.7432, 5.0);
			case CHECKPOINT_3: SetPVarInt(playerid, "LESCAR", CHECKPOINT_4),SetPlayerRaceCheckpoint(playerid, 0,-2013.7896,-72.9510,34.7432,-2008.2971,-281.0279,34.8570, 5.0);
			case CHECKPOINT_4: SetPVarInt(playerid, "LESCAR", CHECKPOINT_5),SetPlayerRaceCheckpoint(playerid, 0,-2008.2971,-281.0279,34.8570,-2193.9878,-289.7451,34.9048, 5.0);
			case CHECKPOINT_5: SetPVarInt(playerid, "LESCAR", CHECKPOINT_6),SetPlayerRaceCheckpoint(playerid, 0,-2193.9878,-289.7451,34.9048,-2205.2595,-203.5693,34.9130, 5.0);
			case CHECKPOINT_6: SetPVarInt(playerid, "LESCAR", CHECKPOINT_7),SetPlayerRaceCheckpoint(playerid, 0,-2205.2595,-203.5693,34.9130,-2165.0903,-87.7748,34.7359, 5.0);
			case CHECKPOINT_7: SetPVarInt(playerid, "LESCAR", CHECKPOINT_8),SetPlayerRaceCheckpoint(playerid, 0,-2165.0903,-87.7748,34.7359,-2062.5671,-72.9630,34.7380, 5.0);
			case CHECKPOINT_8: SetPVarInt(playerid, "LESCAR", CHECKPOINT_9),SetPlayerRaceCheckpoint(playerid, 0,-2062.5671,-72.9630,34.7380,-2046.8743,-98.0073,34.7391, 5.0);
			case CHECKPOINT_9: SetPVarInt(playerid, "LESCAR", CHECKPOINT_10),SetPlayerRaceCheckpoint(playerid, 1,-2046.8743,-98.0073,34.7391,0.0,0.0,0.0, 5.0);
			case CHECKPOINT_10:
            {
                new Float: health1;
                GetVehicleHealth(GetPlayerVehicleID(playerid),health1);
                if (health1 >= 950)
                {
                    SetPVarInt(playerid, "LESCAR", 0);
                    SetPVarInt(playerid, "EKZAMEN", 0);
                    p_info[playerid][lic] = 1;
                    DisablePlayerRaceCheckpoint(playerid);
                    SendClientMessage(playerid, info, "Вы успешно сдали практическую часть. Вот Ваши права!");
                    SetVehicleToRespawn(GetPlayerVehicleID(playerid));
                 }
                 else
                 {
                    SetVehicleToRespawn(GetPlayerVehicleID(playerid));
                    DisablePlayerRaceCheckpoint(playerid);
                    ShowPlayerDialog(playerid, 0000,0,"Экзамен провален","К сожалению, Вам не удалось справиться с практической частью экзамена.\nУровень повреждения машины слишком высокий.\nЖдём Вас на пересдаче","Ок","");
					SetPVarInt(playerid, "LESCAR", 0),SetPVarInt(playerid, "EKZAMEN", 0);
                 }
            }
        }
    }
   	if(GetPVarInt(playerid, "race_check") >= 0)
	{
	    /*
		для создания других маpшрутов, объявляйте маршруту допустим "race_check_2" и делайте аналогично этому*/
	    new string[124];
		if(GetPVarInt(playerid, "race_check") == 0
		|| GetPVarInt(playerid, "race_check") == 7
		|| GetPVarInt(playerid, "race_check") == 18) //остановки
		{
		    TogglePlayerControllable(playerid, false);
			SendClientMessage(playerid, info, "Остановка! Подождите пассажиров!");
	        SetTimerEx("freez_bus", 10000, false, "i", playerid);
		}
		if(GetPVarInt(playerid, "race_check") == 20)//Конечная
		{
		    format(string, sizeof(string), "Заработано: "I"%d$",(GetPVarInt(playerid, "@flight_num")*50) + GetPVarInt(playerid, "@payment")*GetPVarInt(playerid, "@passenger"));
			SendClientMessage(playerid, white, string);
			format(string, sizeof(string), "Количество пассажиров:"I" %d | Куплено билетов на %d$",GetPVarInt(playerid, "@passenger"),GetPVarInt(playerid, "@payment")*GetPVarInt(playerid, "@passenger"));
			SendClientMessage(playerid, white, string);
			set_money(playerid,(GetPVarInt(playerid, "@flight_num")*50) + GetPVarInt(playerid, "@payment")*GetPVarInt(playerid, "@passenger")); //количество чекпоинт*50$ + пассажиры*стоимость проезда

	        SendClientMessage(playerid, info, "Вы завершили маршрут 'Автовокзал Los Santos – Автовокзал San Fierro'");
	        SendClientMessage(playerid, info, "Чтобы взять новый маршрут, нажмите '2'");

	        DisablePlayerRaceCheckpoint(playerid);
	        SetPVarInt(playerid, "race_check",-1);
	        SetPVarInt(playerid, "@flight_num",0);
	        SetPVarInt(playerid, "@passenger",0);
	        SetPVarInt(playerid, "@startJob",0);
	        DestroyDynamic3DTextLabel(INFO_VEH[GetPlayerRentBus[playerid]]);
			return 1;
		}
		SetPVarInt(playerid, "@flight_num",GetPVarInt(playerid, "@flight_num") +1);// Количество взятых чекпоинтов для последующей выплаты зп
		set_check_race(playerid);
	}
	if(GetPVarInt(playerid, "GPS")) DisablePlayerRaceCheckpoint(playerid),DeletePVar(playerid, "GPS");
	if(GetPVarInt(playerid, "taxi_checkpoint")) DisablePlayerRaceCheckpoint(playerid),DeletePVar(playerid, "taxi_checkpoint");
	return 1;
}

public OnPlayerLeaveRaceCheckpoint(playerid)
{
	return 1;
}

public OnPlayerPickUpPickup(playerid, pickupid)
{
    if(pickupid == el_corona_pickup[0])//el_corona вход в интерьер
	{
		SetPlayerInterior(playerid,8);
		SetPlayerVirtualWorld(playerid, 6);
		SetPlayerPos(playerid,-42.31,1408.18,1084.43);
		SetPlayerFacingAngle(playerid, 720);
		SetCameraBehindPlayer(playerid);
	}

	if(pickupid == el_corona_pickup[1])//el_corona выход
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,1685.7612,-2101.9949,13.8343); //
		SetPlayerFacingAngle(playerid,184.3); //
		SetCameraBehindPlayer(playerid);
	}
 	if(pickupid == rifa_pickup[0])//Рифа вход на улицу
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,2521.3687,-2017.3411,13.5469);
		SetPlayerFacingAngle(playerid, 43.41);
		SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == rifa_pickup[1])//Рифа вход в интерьер
	{
		SetPlayerInterior(playerid,8);
		SetPlayerVirtualWorld(playerid, 8);
		SetPlayerPos(playerid,2807.619873,-1171.899902,1025.570312);
		SetPlayerFacingAngle(playerid, 338.94);
		SetCameraBehindPlayer(playerid);
	}
    if(pickupid == vagos_pickup[0])//Vagos вход в интерьер
	{
		SetPlayerInterior(playerid,4);
		SetPlayerVirtualWorld(playerid, 7);
		SetPlayerPos(playerid,301.8745,309.9708,1003.3047);
		SetPlayerFacingAngle(playerid, 269.0);
		SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == vagos_pickup[1])//Vagos выход
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,2407.3560,-1100.0127,39.5507);
		SetPlayerFacingAngle(playerid, 1.2);
		SetCameraBehindPlayer(playerid);
	}
    if(pickupid == ballas_pickup[0])//Балас вход на улицу
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,2266.9177,-1438.0424,23.8281);
		SetPlayerFacingAngle(playerid, 263);
		SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == ballas_pickup[1])//Балас вход в дом
	{
		SetPlayerInterior(playerid,6);
		SetPlayerVirtualWorld(playerid, 5);
		SetPlayerPos(playerid,-68.6311,1353.8743,1080.2109);
		SetPlayerFacingAngle(playerid, 1.0);
		SetCameraBehindPlayer(playerid);
	}
    if(pickupid == grove_pickup[0])
	{
		SetPlayerVirtualWorld(playerid,6);
		SetPlayerInterior(playerid, 2);
		SetPlayerPos(playerid,2467.0396,-1698.4911,1013.5078);
		SetPlayerFacingAngle(playerid,86.1908);
		SetCameraBehindPlayer(playerid);
	}

	if(pickupid == grove_pickup[1])
	{
		SetPlayerVirtualWorld(playerid,0);
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid,2459.4851,-1688.3279,13.5340);
		SetPlayerFacingAngle(playerid,354.09);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == rm_pickup[0])
	{
	    SetPlayerInterior(playerid, 5);
   		SetPlayerVirtualWorld(playerid, 1);
		SetPlayerPos(playerid, 1299.3188,-793.3859,1084.0078);
		SetPlayerFacingAngle(playerid,339.2);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == rm_pickup[1])
	{
	    SetPlayerInterior(playerid, 0);
   		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid, -2722.2375,-316.5428,7.5161);
		SetPlayerFacingAngle(playerid,33.2);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == lcn_pickup[0])
	{
	    SetPlayerInterior(playerid, 5);
   		SetPlayerVirtualWorld(playerid, 2);
		SetPlayerPos(playerid, 1299.3188,-793.3859,1084.0078);
		SetPlayerFacingAngle(playerid,339.2);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == lcn_pickup[1])
	{
	    SetPlayerInterior(playerid,0);
   		SetPlayerVirtualWorld(playerid,0);
		SetPlayerPos(playerid, 1461.2188,2773.7329,10.8203);
		SetPlayerFacingAngle(playerid,266.2);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == yakuza_pickup[0])
	{
	    SetPlayerInterior(playerid, 5);
   		SetPlayerVirtualWorld(playerid, 3);
		SetPlayerPos(playerid, 1299.3188,-793.3859,1084.0078);
		SetPlayerFacingAngle(playerid,339.2);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == yakuza_pickup[1])
	{
	    SetPlayerInterior(playerid, 0);
   		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid, 2483.5334,1527.6459,11.1456);
		SetPlayerFacingAngle(playerid,316.2);
		SetCameraBehindPlayer(playerid);
	}
    if(pickupid == smi_pickup[0])//Сми главный
	{
		SetPlayerInterior(playerid,18);
		SetPlayerVirtualWorld(playerid, 1);
		SetPlayerPos(playerid, 1704.6171,-1667.9106,20.2258);
		SetPlayerFacingAngle(playerid, 270.7511);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == smi_pickup[1])//Сми главынй выход
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,1653.8992,-1659.1672,22.5156);
		SetPlayerFacingAngle(playerid, 180.0);
		SetCameraBehindPlayer(playerid);
	}
	
	if(pickupid == non_pick_boe)
	{
	    new str[44],str_patr[22],str_mat[22];
		if(!gang(playerid)) return 1;
	    if(army_material > 0 && p_info[playerid][material] < 20)
		{
			army_material --;
	    	p_info[playerid][material]++;
			SetPVarInt(playerid, "mat",1);
			f(str_mat, "mat %d/20",p_info[playerid][material]);
		}
	    if(army_patr > 1 && p_info[playerid][patr] < 150)
		{
			army_patr -= 2;
        	p_info[playerid][patr]+=2;
        	f(str_patr, "~b~patron %d/150",p_info[playerid][patr]);
		}
        f(str, "%s~n~%s",str_mat,str_patr);
        GameTextForPlayer(playerid, str, 1000, 3);
        _@3DTEXT();
        return 1;
	}
	if(pickupid == _stock[0]) //
	{
		SetPlayerInterior(playerid,6);
		SetPlayerPos(playerid,316.9104,-168.6356,999.5938);
		SetPlayerFacingAngle(playerid, 355.8037);
		SetPlayerVirtualWorld(playerid,4);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == _stock[1]) //
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid,0);
		SetPlayerPos(playerid,146.0164,1895.1124,18.4494);
		SetPlayerFacingAngle(playerid, 258.2485);
		SetCameraBehindPlayer(playerid);
	}
    if(pickupid == fbi[0]) //
	{
        if(p_info[playerid][member] != 4) return 1;
		SetPlayerFacingAngle(playerid, 356.7);
		SetPlayerPos(playerid, 288.745971,169.350997,1007.171875);
		SetPlayerInterior(playerid,3);
		SetPlayerVirtualWorld(playerid,1);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == fbi[1]) //
	{
		SetPlayerPos(playerid,-2451.9124,503.6887,30.0829);
		SetPlayerFacingAngle(playerid, 274.31);
		SetPlayerInterior(playerid, 0);
		SetPlayerVirtualWorld(playerid, 0);
		SetCameraBehindPlayer(playerid);
	}
	
    if(pickupid == lvpd[0]) //lvpd 1 вход в здание с гаража
	{
	    if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerInterior(playerid,3);
		SetPlayerVirtualWorld(playerid, 3);
		SetPlayerPos(playerid,238.5033,141.1578,1003.0234);
		SetPlayerFacingAngle(playerid, 359.1617);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == lvpd[1])//lvpd 2 вход в гараж..
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,2281.9182,2426.1143,3.4692);
		SetPlayerFacingAngle(playerid, 356.8742);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == lvpd[2]) //lvpd 3 в здание
	{
	    if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerInterior(playerid,3);
		SetPlayerVirtualWorld(playerid, 3);
		SetPlayerPos(playerid,288.7445,169.2445,1007.1719);
		SetPlayerFacingAngle(playerid, 9.7598);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == lvpd[3])//lvpd  4 на улицу
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,2340.1965,2455.9792,14.9688);
		SetPlayerFacingAngle(playerid, 178.3347);
	    SetCameraBehindPlayer(playerid);
	}
	if(pickupid == sfpd[0])//
	{
		SetPlayerInterior(playerid,0);
		SetPlayerPos(playerid,-1606.4532,674.2636,-5.2422);
		SetPlayerFacingAngle(playerid, 357.2527);
		SetPlayerVirtualWorld(playerid, 0);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == sfpd[2])//
	{
	    if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerVirtualWorld(playerid, 2);
		SetPlayerInterior(playerid,10);
		SetPlayerPos(playerid,217.3147,121.3382,999.0156);
		SetPlayerFacingAngle(playerid, 272.8898);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == sfpd[3])//
	{
		if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,-1590.8289,716.0479,-5.2422);
		SetPlayerFacingAngle(playerid, 269.9364);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == sfpd[1])//Вход из гаража в sfPD
	{
		if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerInterior(playerid,0);
		SetPlayerPos(playerid,-1590.8289,716.0479,-5.2422);
		SetPlayerFacingAngle(playerid, 269.9364);
		SetPlayerVirtualWorld(playerid, 0);
	    SetCameraBehindPlayer(playerid);
	}
    if(pickupid == lspd[0]) //LSPD вход в городе
	{
		if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerVirtualWorld(playerid, 1);
		SetPlayerInterior(playerid,6);
		SetPlayerPos(playerid,246.6428,65.8026,1003.6406);
		SetPlayerFacingAngle(playerid, 2.2168);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == lspd[1])///LSPD выход в городе
	{
		SetPlayerInterior(playerid,0);
		SetPlayerPos(playerid,1547.14,-1675.85,13.95);
		SetPlayerFacingAngle(playerid, 91.8310);
		SetPlayerVirtualWorld(playerid, 0);
	    SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == lspd[4])//LSPD вых из гаража
	{
		SetPlayerInterior(playerid,0);
		SetPlayerPos(playerid,1528.010864,-1678.141723,5.890625);
		SetPlayerFacingAngle(playerid, 259.617370);
		SetPlayerVirtualWorld(playerid, 0);
	    SetCameraBehindPlayer(playerid);
	}
	if(pickupid == lspd[5])
	{
		if (!GetPVarInt(playerid, "KEYS")) return SendClientMessage(playerid, error, "Информация: У вас нет пропуска в участок");
		SetPlayerInterior(playerid,6);
		SetPlayerVirtualWorld(playerid, 1);
		SetPlayerPos(playerid,244.9234,66.3047,1003.6406);
		SetPlayerFacingAngle(playerid, 278.0311);
	    SetCameraBehindPlayer(playerid);
	}
	if(pickupid == lspd[3])
	{
	    SetPlayerInterior(playerid,0);
		SetPlayerPos(playerid,1568.6962,-1692.2069,5.8906);
		SetPlayerFacingAngle(playerid, 259.617370);
	    SetPlayerVirtualWorld(playerid, 0);
	    SetCameraBehindPlayer(playerid);
	}
    if(pickupid == bank_pick[0])//банк вход в интерьер
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 2);
		SetPlayerPos(playerid,2307.5510,-15.9498,26.7496);
		SetPlayerFacingAngle(playerid, 275.2);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == bank_pick[1])//банк выход
	{
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,1414.0710,-1701.4440,13.5395); //
		SetPlayerFacingAngle(playerid,231.3); //
		SetCameraBehindPlayer(playerid);
	}
    if(pickupid == pickFactory[0])
	{
		SetPlayerInterior(playerid, 2); // интерьер поставить
		SetPlayerVirtualWorld(playerid,2);
		SetPlayerPos(playerid,2575.0310,-1291.0603,1044.1250);
		SetPlayerFacingAngle(playerid,179.4384);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == pickFactory[1])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerVirtualWorld(playerid,0);
		SetPlayerPos(playerid,-91.7779,-300.4467,2.5033);
		SetPlayerFacingAngle(playerid,90.0);
		if(GetPVarInt(playerid,"zavod"))
		{
		    if(IsPlayerAttachedObjectSlotUsed(playerid,1)) RemovePlayerAttachedObject(playerid,1);// забрали отвертку
		    if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);// забрали отвертку
            SetPVarInt(playerid,"zavod",0);
      		SetPVarInt(playerid, "meshokin",0);
	        SetPVarInt(playerid,"startmolot",0);
			SetPVarInt(playerid, "kgfor",0);
	   		if(p_info[playerid][member] >= 1) SetPlayerSkin(playerid,p_info[playerid][fskin]);
		  	if(p_info[playerid][member] == 0) SetPlayerSkin(playerid,p_info[playerid][skin]);
			SendClientMessage(playerid, -1, "Вы покинули завод, вы ничего не заработали.");
			SetPVarInt(playerid, "kg_zavod",0);
		}
	}
	if(pickupid == pickFactory[2])
	{
	    if(GetPVarInt(playerid,"zavod")) ShowPlayerDialog(playerid,47,0,"Работник производственного цеха","Вы действительно желаете закончить рабочий день?","Да","Нет");
		else ShowPlayerDialog(playerid,46,0,"Работник производственного цеха","Вы действительно желаете начать рабочий день?","Да","Нет");
	}
	if(pickupid == useProd[0] || pickupid == useProd[1] || pickupid == useProd[2] || pickupid == useProd[3] || pickupid == useProd[4] ||pickupid == useProd[5])
	{
		if(GetPVarInt(playerid,"zavod") == 1 && GetPVarInt(playerid,"kgfor") == 0 && GetPVarInt(playerid, "meshokin") == 0)
		{
	        if(zmet > 1)
	        {
				new string[10];
				SetPVarInt(playerid, "kgfor",1);
				format(string,sizeof(string),"~n~~n~~n~~n~~n~~n~~n~~n~~n~~n~~g~+ material");
				GameTextForPlayer(playerid, string, 1000, 3);
				return 1;
			}
			else SendClientMessage(playerid, error, "На заводе нет сырья для переработки");
		}
	}
	
    if(pickupid == meria[0]) //вход в мэрию
	{
		SetPlayerPos(playerid,387.4944,173.4876,1008.3828);
		SetPlayerFacingAngle(playerid,89.9938);
		SetPlayerInterior(playerid,3);
		SetPlayerVirtualWorld(playerid,1);
		SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == meria[1]) // выход из мэрии
	{
		SetPlayerPos(playerid,1480.8832,-1769.0471,18.7958);
		SetPlayerFacingAngle(playerid,0.6852);
		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid,0);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == pick_as[0])
	{

		SetPlayerInterior(playerid,3);
		SetPlayerVirtualWorld(playerid, 1);
		SetPlayerPos(playerid,-2029.9407,-105.9314,1035.1719);
		SetPlayerFacingAngle(playerid, 183.1738);
		SetCameraBehindPlayer(playerid);
	}
	else if(pickupid == pick_as[1])
	{

		SetPlayerInterior(playerid,0);
		SetPlayerVirtualWorld(playerid, 0);
		SetPlayerPos(playerid,-2026.9436,-99.6266,35.1641);
		SetPlayerFacingAngle(playerid, 355.8038);
		SetCameraBehindPlayer(playerid);
	}
	if(pickupid == metro_pick_vhod[0] || pickupid == metro_pick_vhod[1])
	{
	    SendClientMessage(playerid, info, "Вы встали на пикап входа в метро.");
	}
	return 1;
}


public OnPlayerKeyStateChange(playerid, newkeys, oldkeys)
{
	if((newkeys & KEY_SPRINT) && GetPVarInt(playerid, "ANIM")) SetPlayerSpecialAction(playerid, 0),ClearAnimations(playerid),DeletePVar(playerid, "ANIM");
    if(newkeys & KEY_WALK)
	{
	    if(IsPlayerInRangeOfPoint(playerid, 1.5,236.3725,79.7435,1005.0391) && p_info[playerid][member] == 1 ||
	    IsPlayerInRangeOfPoint(playerid, 1.5,221.5632,124.3533,999.0156) && p_info[playerid][member] == 2 ||
	    IsPlayerInRangeOfPoint(playerid, 1.5,269.5615,184.1093,1008.1719) && p_info[playerid][member] == 3 && GetPlayerVirtualWorld(playerid) == 3)
		{
            new string[74];
	 		if(GetPVarInt(playerid, "weap_cop") == 1) return SendClientMessage(playerid,error, "Недавно вы уже получали свой набор");
			switch(p_info[playerid][rang])
			{
			    case 1..3:
			    {
			        GivePlayerWeapon(playerid, 3,  1);
			        GivePlayerWeapon(playerid, 23,  50);
					SendClientMessage(playerid, accept, "Вам выдан набор оружия №1 (Дубинка, пистолет 9mm)");
					f(string,"%s[%d] получил набор оружия №1 со склада",get_name(playerid),playerid);
					SendFamilyMessage(p_info[playerid][member], error, string);
				}
				case 4..6:
				{
				    GivePlayerWeapon(playerid, 3,  1);
			        GivePlayerWeapon(playerid, 24,  50);
			        GivePlayerWeapon(playerid, 29,  150);
					SendClientMessage(playerid, accept, "Вам выдан набор оружия №2 (Дубинка, Desert Eagle, п/а MP5)");
					f(string,"%s[%d] получил набор оружия №2 со склада",get_name(playerid),playerid);
					SendFamilyMessage(p_info[playerid][member], error, string);
				}
				case 7..10:
				{
				    GivePlayerWeapon(playerid, 3,  1);
			        GivePlayerWeapon(playerid, 24,  50);
			        GivePlayerWeapon(playerid, 29,  150);
			        GivePlayerWeapon(playerid, 30,  150);
					SendClientMessage(playerid, accept, "Вам выдан набор оружия №3 (Дубинка, Desert Eagle, п/а MP5, AK47)");
					f(string,"%s[%d] получил набор оружия №3 со склада",get_name(playerid),playerid);
					SendFamilyMessage(p_info[playerid][member], error, string);
				}
			}
			SetPVarInt(playerid, "weap_cop",1);
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.5,269.5615,184.1093,1008.1719) && GetPlayerVirtualWorld(playerid) == 1 && p_info[playerid][member] == 4)
		{
		    ShowPlayerDialog(playerid,69, DIALOG_STYLE_LIST, "Меню ФБР:", "Получить оружие\nВыбрать маскировку", "Выбор", "Отмена");
		}
	    if(IsBankomat(playerid) && newkeys == 1024) ShowPlayerDialog(playerid,59,DIALOG_STYLE_TABLIST,"Банк","Операция со счетом\tПоложить/Снять","Выбор","Отмена");
	    for(new idx = 0; idx < totalbiz; idx++)
		{
		    if(IsPlayerInRangeOfPoint(playerid,1.0,b_info[idx][b_enter][0],b_info[idx][b_enter][1],b_info[idx][b_enter][2]) && b_info[idx][_owned] == 0)
		    {
		        new string[144];
	    		format(string,sizeof(string),""W"Цена: %d$\nЕсли вы действительно хотите приобрести данный бизнес, нажмите "I"Купить",b_info[idx][_price]);
	    		return ShowPlayerDialog(playerid,36,DIALOG_STYLE_MSGBOX,"Покупка бизнеса",string,"Купить","Отмена");
			}
			if(b_info[idx][_tip] == 4) continue;
		    if(IsPlayerInRangeOfPoint(playerid,1.0,b_info[idx][b_enter][0],b_info[idx][b_enter][1],b_info[idx][b_enter][2]))
		    {
		        if(b_info[idx][_lock] == 1 && idx != p_info[playerid][key]) return SendClientMessage(playerid,error,"Бизнес закрыт");
        		SetPlayerPos(playerid, b_info[idx][b_exit][0],b_info[idx][b_exit][1],b_info[idx][b_exit][2]);
        		SetPlayerInterior(playerid, b_info[idx][_int]), SetPlayerVirtualWorld(playerid, b_info[idx][_world]);
                SetCameraBehindPlayer(playerid);
        		SetPVarInt(playerid, "bID", idx);
			}
    	}
    	if(IsPlayerInRangeOfPoint(playerid,1.0,b_info[GetPVarInt(playerid, "bID")][b_exit][0],b_info[GetPVarInt(playerid, "bID")][b_exit][1],b_info[GetPVarInt(playerid, "bID")][b_exit][2]))
	    {
    		SetPlayerPos(playerid, b_info[GetPVarInt(playerid, "bID")][b_enter][0],b_info[GetPVarInt(playerid, "bID")][b_enter][1],b_info[GetPVarInt(playerid, "bID")][b_enter][2]);
    		SetPlayerInterior(playerid, 0), SetPlayerVirtualWorld(playerid, 0);
   		}
   		else if(IsPlayerInRangeOfPoint(playerid,1.0,b_info[GetPVarInt(playerid, "bID")][b_menu][0],b_info[GetPVarInt(playerid, "bID")][b_menu][1],b_info[GetPVarInt(playerid, "bID")][b_menu][2]))
	    {
    		if(b_info[GetPVarInt(playerid, "bID")][_owned] == 0) return SendClientMessage(playerid,error,"Магазин не работает");
			MENU_BIZ(playerid,b_info[GetPVarInt(playerid, "bID")][_tip]);
		}
        for(new h = 0; h < sizeof(h_info); h++)
		{
	        new string[255],text[25];
   			if(IsPlayerInRangeOfPoint(playerid,1.0,h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2]))
			{
		    	if(h_info[h][h_owned] == 1)
				{
					format(string, sizeof(string), ""W"Владелец:\t"I"%s\n"W"Номер дома:\t"I"%d",h_info[h][h_owner],h);
					ShowPlayerDialog(playerid,18,DIALOG_STYLE_MSGBOX,"Дом куплен",string,"Далее","Отмена");
				}
				else
				{
					switch(h_info[h][h_squar])
					{
						case 1: text = "15 кв.м";
						case 2: text = "36 кв.м";
						case 3: text = "72 кв.м";
						case 4: text = "120 кв.м";
					}
					format(string, sizeof(string), ""W"Площадь:\t"I"%s\n"W"Номер дома:\t"I"%d\n\n"W"Стоимость:\t"S"%d$\n\n"I"Для приобретения дома нажмите кнопку "I"\"Купить\"",text,h,h_info[h][h_value]);
					ShowPlayerDialog(playerid,18,DIALOG_STYLE_MSGBOX,"Дом свободен",string,"Купить","Отмена");
				}
			}
   			if (IsPlayerInRangeOfPoint( playerid,3.0,h_info[h][h_exit][0], h_info[h][h_exit][1], h_info[h][h_exit][2]))
			{
				if (GetPlayerVirtualWorld(playerid) == h+50)
				{
					SetPlayerInterior(playerid,0);
					SetPlayerVirtualWorld(playerid,0);
					SetPlayerPos(playerid,h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2]);
				}
			}
		}
		if(IsPlayerInRangeOfPoint(playerid, 1.0, 1243.3214 ,-1701.4165, 14.8672))
		{
		    ShowPlayerDialog(playerid, 7054, DIALOG_STYLE_LIST, "{FFFFFF}Чем вам помочь?", "{FFFFFF}Где я?\nЧто мне делать?\n{c1c108}Что ты можешь мне предложить?", "Выбрать", "Закрыть");
		}
		if(IsPlayerInRangeOfPoint(playerid, 2.0, 1220.5631,-1698.5413,13.5469))
		{
		    ShowPlayerDialog(playerid, 7060, DIALOG_STYLE_TABLIST, "{FFFFFF}Чего желаете?", "{FFFFFF}Пончик\t30$\t+10% сытости\nКусок пиццы\t75$\t+25% сытости\nШаурма\t150$\t+45% сытости", "Купить", "Закрыть");
		}
	}
	if(newkeys == KEY_NO)
	{
		if(GetPVarInt(playerid,"pred") != 60605)
		{
			SetPVarInt(GetPVarInt(playerid,"pred"),"auto_buy",0);
			SetPVarInt(GetPVarInt(playerid,"pred"),"housepokup",0);
			SetPVarInt(GetPVarInt(playerid,"pred"),"id_gang",INVALID_PLAYER_ID);
			SendClientMessage(GetPVarInt(playerid,"pred"), error, "Продавец отменил сделку.");
			SetPVarInt(playerid,"pred",60605);
			SendClientMessage(playerid, error, "Вы отменили продажу.");
		}
		if(GetPVarInt(playerid,"id_gang") != INVALID_PLAYER_ID)
		{
			SetPVarInt(GetPVarInt(playerid,"id_gang"),"pred",60605),
			SendClientMessage(GetPVarInt(playerid,"id_gang"),  error, "Игрок отказался от сделки");
			SetPVarInt(playerid, "id_gang",INVALID_PLAYER_ID);
			SendClientMessage(playerid,  error, "Вы отказались от сделки");
		}
		if(GetPVarInt(playerid,"bizpokup") == 1)
		{
			SetPVarInt(playerid,"bizpokup",0);
			SetPVarInt(GetPVarInt(playerid, "bizOffer"),"pred",60605);
			SendClientMessage(GetPVarInt(playerid, "bizOffer"),  error, "Игрок отказался от покупки бизнеса");
			SetPVarInt(playerid, "bizOffer",60635);
			SetPVarInt(playerid, "bizPrice",0);
			SendClientMessage(playerid,  error, "Вы отказались от покупки бизнеса");
		}
		if(GetPVarInt(playerid,"housepokup") == 1)
		{
			SetPVarInt(playerid,"housepokup",0);
			SetPVarInt(GetPVarInt(playerid, "HouseOffer"),"pred",60605);
			SendClientMessage(GetPVarInt(playerid, "HouseOffer"),  error, "Игрок отказался от покупки дома");
			SetPVarInt(playerid, "HouseOffer",60635);
			SetPVarInt(playerid, "HousePrice",0);
			SendClientMessage(playerid,  error, "Вы отказались от покупки дома");
		}
		if(GetPVarInt(playerid,"auto_buy") == 1)
		{
			SetPVarInt(playerid,"auto_buy",0);
			SetPVarInt(GetPVarInt(playerid, "my_id"),"pred",60605);
			SendClientMessage(GetPVarInt(playerid, "my_id"),  error, "Игрок отказался от покупки автомобиля");
			SetPVarInt(playerid, "my_id",60635);
			SetPVarInt(playerid, "car_price",0);
			SendClientMessage(playerid,  error, "Вы отказались от покупки автомобиля.");
		}
	}
	if(newkeys == KEY_YES)
	{
	    new string[256];
	    if(GetPVarInt(playerid, "id_gang") != INVALID_PLAYER_ID)
		{
			new weap[32];
			if(distance(playerid, GetPVarInt(playerid, "id_gang")) > 6.0) return SendClientMessage(playerid,error, "Вы находитесь далеко от продавца");
			if(p_info[playerid][cash] < GetPVarInt(playerid, "price_gun"))return SendClientMessage(playerid, error, "У вас нет столько денег на руках");
			if(!IsPlayerConnected(GetPVarInt(playerid, "id_gang"))) return SendClientMessage(playerid, error, "Продавец вышел из сети");
			

            GivePlayerWeapon(playerid, GetPVarInt(playerid, "gun_id"),GetPVarInt(playerid, "patron"));
			set_money(playerid, -GetPVarInt(playerid,"price_gun"));
			set_money(GetPVarInt(playerid, "id_gang"),GetPVarInt(playerid, "price_gun"));

			p_info[GetPVarInt(playerid, "id_gang")][material] -= GetPVarInt(GetPVarInt(playerid, "id_gang"), "material");
			p_info[GetPVarInt(playerid, "id_gang")][patr] -= GetPVarInt(playerid, "patron");
			
            GetWeaponName(GetPVarInt(playerid, "gun_id"),weap,sizeof(weap));
			f(string, "%s купил у вас оружие %s [%d патрон] за %d$",get_name(playerid),weap,GetPVarInt(playerid, "patron"),GetPVarInt(playerid, "price_gun"));
			SendClientMessage(GetPVarInt(playerid, "id_gang"), accept,string);
			f(string, "Вы купили у %s оружие %s [%d патрон] за %d$",get_name(GetPVarInt(playerid, "id_gang")),weap,GetPVarInt(playerid, "patron"),GetPVarInt(playerid, "price_gun"));
			SendClientMessage(playerid, accept,string);

			DeletePVar(playerid,"gun_id");
			DeletePVar(playerid,"patron");
   			DeletePVar(playerid,"price_gun");
    		SetPVarInt(GetPVarInt(playerid,"id_gang"),"pred",60605);
			SetPVarInt(playerid,"id_gang",INVALID_PLAYER_ID);
		}
    	if(GetPVarInt(playerid, "my_id") != 60635)
		{
			if(distance(playerid,GetPVarInt(playerid, "my_id"))> 8.0) return SendClientMessage(playerid, error, "Продавец слишком далеко от Вас");
			//if(params[0] == playerid) return SendClientMessage(playerid, error, "Нельзя продать самому себе");
			if(p_info[playerid][cash] < GetPVarInt(playerid, "price_car")) return SendClientMessage(playerid, error, "У вас нет столько денег на руках");
			p_info[playerid][veh_id] = p_info[GetPVarInt(playerid, "my_id")][veh_id];
			p_info[GetPVarInt(playerid, "my_id")][veh_id] = 60605;
			set_money(playerid, -GetPVarInt(playerid, "price_car"));
			set_money(GetPVarInt(playerid, "my_id"), GetPVarInt(playerid, "price_car"));
			f(string, "Вы продали автомобиль за "W"$%d", GetPVarInt(playerid, "price_car"));
			SendClientMessage(GetPVarInt(playerid, "my_id"), info, string);
			f(string, "Вы купили автомобиль у "W"%s "I"за "W"$%d", get_name(GetPVarInt(playerid, "my_id")), GetPVarInt(playerid, "price_car"));
			SendClientMessage(playerid, info, string);
			for(new i=0; i<MAX_VEHICLES; i++)
			{
				if(veh_info[i][v_if_buy] == 1 && !strcmp(veh_info[i][v_owner], get_name(GetPVarInt(playerid, "my_id")), true))
				{
					f(string, "Владелец: %s", get_name(playerid));
					UpdateDynamic3DTextLabelText(player_owner[i],error, string);
					strmid(veh_info[i][v_owner], get_name(playerid), 0, strlen(get_name(playerid)), 255);
					break;
				}
			}
			SetPVarInt(GetPVarInt(playerid, "my_id"),"pred",60605);
			SetPVarInt(playerid,"auto_buy",0);
			SetPVarInt(playerid, "my_id",60635);
			SetPVarInt(playerid, "price_car",0);
		}
		if(GetPVarInt(playerid, "HouseOffer") != 60635)
		{
			new h = p_info[GetPVarInt(playerid, "HouseOffer")][keyh];
			if (!IsPlayerInRangeOfPoint(playerid, 5.0, h_info[h][h_enter][0],h_info[h][h_enter][1], h_info[h][h_enter][2]))return SendClientMessage(playerid, error, "Вы далеко от дома который хотите купить");
			if(p_info[playerid][cash] < GetPVarInt(playerid, "HousePrice"))return SendClientMessage(playerid, error, "У вас нет столько денег на руках!");
			p_info[playerid][keyh] = p_info[GetPVarInt(playerid, "HouseOffer")][keyh];
			p_info[GetPVarInt(playerid, "HouseOffer")][keyh] = 60635;
			set_money(playerid, -GetPVarInt(playerid,"HousePrice"));
			set_money(GetPVarInt(playerid, "HouseOffer"),GetPVarInt(playerid, "HousePrice"));
			strmid(h_info[h][h_owner], get_name(playerid), 0, strlen(get_name(playerid)), 255);
			format(string, sizeof(string), "Вы продали дом %s за "W"$%d", get_name(playerid), GetPVarInt(playerid, "HousePrice")),SendClientMessage(GetPVarInt(playerid, "HouseOffer"), info, string);
			format(string, sizeof(string), "Вы купили дом у %s за "W"$%d", get_name(GetPVarInt(playerid, "HouseOffer")), GetPVarInt(playerid, "HousePrice")),SendClientMessage(playerid, info, string);

			update_house(h),save_house(h);
			p_info[GetPVarInt(playerid, "HouseOffer")][spawn] = 0;
			p_info[playerid][spawn] = 2;
			SetPVarInt(GetPVarInt(playerid, "HouseOffer"),"pred",60605);
			SetPVarInt(playerid,"housepokup",0);
			SetPVarInt(playerid,"HouseOffer", 60635);
			SetPVarInt(playerid,"HousePrice", 0);
		}
		if(GetPVarInt(playerid, "bizOffer") != 60635)
		{
			new h = p_info[GetPVarInt(playerid, "bizOffer")][key];
			if(p_info[playerid][key] != -1) return SendClientMessage(playerid, error, "У вас уже есть бизнес");
			if (!IsPlayerInRangeOfPoint(playerid, 5.0, b_info[h][b_enter][0],b_info[h][b_enter][1], b_info[h][b_enter][2]))return SendClientMessage(playerid, error, "Вы далеко от бизнеса который хотите купить");
			if(p_info[playerid][cash] < GetPVarInt(playerid, "bizPrice"))return SendClientMessage(playerid, error, "У вас нет столько денег на руках!");
			p_info[playerid][keyh] = h;
			h = 60635;
			set_money(playerid, -GetPVarInt(playerid,"bizPrice"));
			set_money(GetPVarInt(playerid, "bizOffer"),GetPVarInt(playerid, "bizPrice"));
			format(string, sizeof(string), "Вы продали бизнес %s за "W"$%d", get_name(playerid), GetPVarInt(playerid, "bizPrice")),SendClientMessage(GetPVarInt(playerid, "bizOffer"), info, string);
			format(string, sizeof(string), "Вы купили бизнес у %s за "W"$%d", get_name(GetPVarInt(playerid, "bizOffer")), GetPVarInt(playerid, "bizPrice")),SendClientMessage(playerid, info, string);

			strmid(b_info[p_info[playerid][keyh]][_owner], get_name(playerid), 0, strlen(get_name(playerid)), 255);
			biz_save();
	  		Update3DTexts();
	  		
			SetPVarInt(GetPVarInt(playerid, "bizOffer"),"pred",60605);
			SetPVarInt(playerid,"bizpokup",0);
			SetPVarInt(playerid,"bizOffer", 60635);
			SetPVarInt(playerid,"bizPrice", 0);
		}
	}
    if(newkeys & KEY_SUBMISSION)
    {
        if(GetPlayerVehicleID(playerid) >= TAXI[0] && GetPlayerVehicleID(playerid) <= TAXI[1])
		{
		     if(p_info[playerid][job] != 2 && GetPlayerRentTaxi[playerid] == -1) return SendClientMessage(playerid, error, "Ты не устроился на работу водителя такси");
			 if(!GetPVarInt(playerid, "@startJob")) return ShowPlayerDialog(playerid, 57, 1, "Cтоимость проезда", ""W"Укажите стоимость проезда\nУкажите цену (1$ - 500$)","Далее", "Закрыть");
        	 else ShowPlayerDialog(playerid, 57,0,"Диспетчер таксопарка", ""W"Вы уверены что хотите завершить рабочий день?","Да","Нет");
		}
		if(GetCarDelivery[playerid] != -1) return ShowPlayerDialog(playerid, 49, DIALOG_STYLE_MSGBOX, "Работа 'Развозчик'", ""W"Вы хотите закончить рабочий день развозчиком?\nЕсли у вас есть груз, с вас спишут штраф", "Да", "Нет");
		if(GetPlayerVehicleID(playerid) >= BUS[0] && GetPlayerVehicleID(playerid) <= BUS[1])
		{
			if(p_info[playerid][job] != 1 && GetPlayerRentBus[playerid] == -1) return SendClientMessage(playerid, error, "Ты не устроился на работу водителя автобуса");
			if(GetPVarInt(playerid, "@startJob") == 0) ShowPlayerDialog(playerid, 12,1, "Cтоимость проезда", ""W"Сколько будет стоить проезд?\nУкажите цену (0$ - 100$)","Далее","Закрыть");
			else ShowPlayerDialog(playerid, 12,0, "Диспетчер автопарка", ""W"Вы уверены что хотите завершить рабочий день?","Да","Нет");
		}
  	}
  	if(newkeys & KEY_ACTION && GetPlayerState(playerid) == PLAYER_STATE_DRIVER)
	{
	    if((GetPlayerVehicleID(playerid) >= carDelivery[0] && GetPlayerVehicleID(playerid) <= carDelivery[1] || GetPlayerVehicleID(playerid) >= carGasTanker[0] && GetPlayerVehicleID(playerid) <= carGasTanker[1]) && GetCarDelivery[playerid] == -1) return SendClientMessage(playerid, error, "Не удалось! Если что-то пошло не так (Вы должны начать рабочий день)"),RemovePlayerFromVehicle(playerid);
		new string[48];
		if(GetVehicleModel(GetPlayerVehicleID(playerid)) != 481 || GetVehicleModel(GetPlayerVehicleID(playerid)) != 510)
    	{
			if(engine_car[GetPlayerVehicleID(playerid)] == 0)
			{
				if(fuel_car[GetPlayerVehicleID(playerid)] < 1) return SendClientMessage(playerid, error, "В данном автомобиле нет бензина.");
				GetVehicleParamsEx(GetPlayerVehicleID(playerid),engine,lights,alarm,doors,bonnet,boot,objective);
				SetVehicleParamsEx(GetPlayerVehicleID(playerid) ,VEHICLE_PARAMS_ON,lights,alarm,doors,bonnet,boot,objective);
				engine_car[GetPlayerVehicleID(playerid)] =1;
				PlayerPlaySound(playerid, 31810, 0.0, 0.0, 0.0);
				format(string, sizeof(string),"%s завел двигатель", get_name(playerid));
				distance_chat(playerid,10.0,0xDE92FFFF,string);
			}
			else if(engine_car[GetPlayerVehicleID(playerid)] == 1)
			{
				GetVehicleParamsEx(GetPlayerVehicleID(playerid),engine,lights,alarm,doors,bonnet,boot,objective);
				SetVehicleParamsEx(GetPlayerVehicleID(playerid),VEHICLE_PARAMS_OFF,lights,alarm,doors,bonnet,boot,objective);
                engine_car[GetPlayerVehicleID(playerid)] =0;
                PlayerPlaySound(playerid, 31810, 0.0, 0.0, 0.0);
                format(string, sizeof(string), "%s заглушил двигатель", get_name(playerid));
				distance_chat(playerid,10.0,0xDE92FFFF,string);
			}
		}
		return 1;
	}
	if(newkeys & 4096 && GetPlayerState(playerid) == PLAYER_STATE_DRIVER)
	{
		for(new idx = 0; idx < totalbiz; idx++)
		{
			if(IsPlayerInRangeOfPoint(playerid,6.0,b_info[idx][b_enter][0],b_info[idx][b_enter][1],b_info[idx][b_enter][2]) && b_info[idx][_owned] == 1 && b_info[idx][_tip] == 4)
		    {
				if(GetVehicleModel(GetPlayerVehicleID(playerid)) == 481 || GetVehicleModel(GetPlayerVehicleID(playerid)) == 510 || GetVehicleModel(GetPlayerVehicleID(playerid)) == 509) return 1;
				new string[144];
		        if(fuel_car[GetPlayerVehicleID(playerid)] >= 70) return SendClientMessage(playerid, error, "У вас полный бак");
		        if((b_info[idx][_prod]) < 10)  return SendClientMessage(playerid, error, "На данной АЗС нет топлива.");
		        if((10*b_info[idx][_cena1]) > p_info[playerid][cash])  return SendClientMessage(playerid, error, "У вас нехватает денег");
		        f(string,"Вы заправили 10 литров за %d$. Удачной дороги!",10*b_info[idx][_cena1]);
				SendClientMessage(playerid, server, string);
				b_info[idx][_bank] +=(10*b_info[idx][_cena1]);
				b_info[idx][_prod] -= 10;
				set_money(playerid, -(10*b_info[idx][_cena1]));
				fuel_car[GetPlayerVehicleID(playerid)] += 10;
			}
		}
	}
  	return 1;
}
public OnPlayerUpdate(playerid)
{
    if(!IsPlayerConnected(playerid)) return 1;
	if(p_info[playerid][cash] > GetPlayerMoney(playerid)) ResetPlayerMoney(playerid),GivePlayerMoney(playerid, p_info[playerid][cash]);
	else if(p_info[playerid][cash] < GetPlayerMoney(playerid)) ResetPlayerMoney(playerid),GivePlayerMoney(playerid, p_info[playerid][cash]);
    SetPVarInt(playerid,"AFK_Tick", GetPVarInt(playerid,"AFK_Tick") + 1);
    return 1;
}


public OnPlayerEnterDynamicCP(playerid)
{
    
	if(IsPlayerInDynamicCP(playerid,grove_pickup[2]))
	{
		if(p_info[playerid][member] != 10) return 1;
		ShowPlayerDialog(playerid, 103, DIALOG_STYLE_TABLIST, "Общак Grove Street","Металл\tВзять/Положить\nПатроны\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,ballas_pickup[2]))
	{
		if(p_info[playerid][member] != 11) return 1;
		ShowPlayerDialog(playerid, 103, DIALOG_STYLE_TABLIST, "Общак E.S Ballas","Металл\tВзять/Положить\nПатроны\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,rifa_pickup[2]))
	{
		if(p_info[playerid][member] != 12) return 1;
		ShowPlayerDialog(playerid, 103, DIALOG_STYLE_TABLIST, "Общак The Rifa","Металл\tВзять/Положить\nПатроны\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,el_corona_pickup[2]))
	{
		if(p_info[playerid][member] != 13) return 1;
		ShowPlayerDialog(playerid, 103, DIALOG_STYLE_TABLIST, "Общак El Corona","Металл\tВзять/Положить\nПатроны\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,vagos_pickup[2]))
	{
		if(p_info[playerid][member] != 14) return 1;
		ShowPlayerDialog(playerid, 103, DIALOG_STYLE_TABLIST, "Общак L.S Vagos","Металл\tВзять/Положить\nПатроны\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
    if(IsPlayerInDynamicCP(playerid,rm_pickup[2]))
	{
		if(p_info[playerid][member] != 7) return 1;
		ShowPlayerDialog(playerid, 100, DIALOG_STYLE_TABLIST, "Общак Русской Мафии","Деньги\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,lcn_pickup[2]))
	{
		if(p_info[playerid][member] != 8) return 1;
		ShowPlayerDialog(playerid, 100, DIALOG_STYLE_TABLIST, "Общак La Cosa Nostra","Деньги\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,yakuza_pickup[2]))
	{
		if(p_info[playerid][member] != 9) return 1;
		ShowPlayerDialog(playerid, 100, DIALOG_STYLE_TABLIST, "Общак Yakuza","Деньги\tВзять/Положить\nНаркотики\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid,cp_sv))
	{
		if(p_info[playerid][member] != 5) return 1;
		ShowPlayerDialog(playerid, 84, DIALOG_STYLE_TABLIST, "Склад Армии","Материалы\tВзять/Положить\nПатроны\tВзять/Положить", "Выбрать", "Закрыть");
		return 1;
	}
    if(IsPlayerInDynamicCP(playerid,job_invite ))
	{
		new str[164];
		f(str, ""W"Водитель автобуса\t"I"%d уровень\n"W"Водитель такси\t"I"%d уровень\n"W"Развозчик продуктов\t"I"%d уровень", level_bus,level_taxi,level_delivery);
	    ShowPlayerDialog(playerid, 10, DIALOG_STYLE_TABLIST, "Приём на работу",str, "Устроиться", "Закрыть");
		return 1;
	}
	if(IsPlayerInDynamicCP(playerid, pick_as[2]))
	{
		if(p_info[playerid][lic] == 1) return SendClientMessage(playerid, error, "У вас уже есть права!");
  		ShowPlayerDialog(playerid,26,0,"Экзамен по вождению",""W"Добрый день!\nДля того чтобы успешно сдать на права\nвам требуется пройти теоретическую часть и практическую\nСтоимость экзамена составляет 1000$\n\nДля начала экзамена нажмита на кнопку 'Начать'","Начать","Отмена");
		return true;
	}
	if(IsPlayerInDynamicCP(playerid, bank_pick[2]))
	{
		return ShowPlayerDialog(playerid,59,DIALOG_STYLE_TABLIST,"Банк","Операция со счетом\tПоложить/Снять\nПеревести деньги\n"E"Заплатить за дом\n"E"Заплатить за аренду бизнеса","Выбор","Отмена");
	}
	return 1;
}

public OnPlayerClickMap(playerid, Float:fX, Float:fY, Float:fZ)
{
	SetPlayerPos(playerid, fX, fY, fZ);
	return 1;
}

public OnDialogResponse(playerid, dialogid, response, listitem, inputtext[])
{
    PlayerPlaySound(playerid, 1149, 0.0, 0.0, 0.0);
	switch(dialogid)
	{
        case 1:
	    {
	        if(!response)
	        {
	            ShowPlayerDialog(playerid, 1, DIALOG_STYLE_MSGBOX, "Оповещение", "Вы были кикнуты с сервера.\n"E"Причина: Отказ от регистрации.\nДля выхода с сервера введите \"/q\" в чат", "Вход", "Выход");
	            return Kick(playerid);
	        }
	        if(!strlen(inputtext)) return ErrorDialogMessage(playerid, 1, 0);
	        else if(strlen(inputtext) < 4) return ErrorDialogMessage(playerid, 1, 1);
	        else if(strlen(inputtext) > 30) return ErrorDialogMessage(playerid, 1, 2);
	        for(new i = strlen(inputtext)-1; i != -1; i--)
	        {
	            switch(inputtext[i])
	            {
	                case '0'..'9', 'a'..'z', 'A'..'Z': continue;
	                default: return ErrorDialogMessage(playerid, 1, 3);
	            }
	        }
	        strmid(p_info[playerid][password], inputtext, 0, strlen(inputtext), 30);
	        ShowPlayerDialog(playerid, 3, DIALOG_STYLE_INPUT,"Электронная почта", ""W"В случае утери пароля, вы сможете восстановить данные.\nВведите адрес электронной почты:\n", "Ок", "Выйти");
	        return 1;
	    }
	    case 2:
	    {
	        if(!response)
	        {
	            ShowPlayerDialog(playerid, 2, DIALOG_STYLE_MSGBOX, "Оповещение", ""W"Вы были кикнуты с сервера.\n"E"Причина: Отказ от авторизации.\nДля выхода с сервера введите \"/q\" в чат", "Вход", "Выход");
	            return Kick(playerid);
	        }
	        if(!strlen(inputtext)) return ErrorDialogMessage(playerid, 2, 0);
	        for(new i = strlen(inputtext)-1; i != -1; i--)
	        {
	            switch(inputtext[i])
	            {
	                case '0'..'9', 'а'..'я', 'a'..'z', 'А'..'Я', 'A'..'Z': continue;
	                default: return ErrorDialogMessage(playerid, 2, 1);
	            }
	        }
	        if(!strcmp(p_info[playerid][password], inputtext))
	        {
	            new query_string[52+MAX_PLAYER_NAME];
	            format(query_string, sizeof(query_string), "SELECT * FROM `accounts` WHERE `name` = '%s'", p_info[playerid][name]);
	            mysql_tquery(con_bd, query_string, "UploadPlayerAccount","i", playerid);
	        }
	        else ErrorDialogMessage(playerid, 2, 2);
	        return 1;
	    }
   		case 3:
   		{
   		    if(!response) return SendClientMessage(playerid, error,"Вы вышли. Нажмите (/q)"), Kick(playerid);
   		    if(strlen(inputtext) < 1 || strlen(inputtext) > 36) return ShowPlayerDialog(playerid, 3, DIALOG_STYLE_INPUT,"{319AFF}                      Электронная почта", "{ffd200}В случае утери пароля, вы сможете восстановить данные.\n{ffffff}Введите адрес электронной почты:\n", "Ок", "Выйти");
			if(strfind(inputtext, "@", true) == -1 || strfind(inputtext, ".", true) == -1 || strlen(inputtext) < 5)
			{
				SendClientMessage(playerid, error, "Попробуйте еще раз");
  				return ShowPlayerDialog(playerid, 3, DIALOG_STYLE_INPUT,"Электронная почта", ""W"В случае утери пароля, вы сможете восстановить данные.\nВведите адрес электронной почты:\n", "Ок", "Выйти");
			}
			SetPVarString(playerid, "Mail", inputtext);
			new text[144];
            format(text, sizeof(text), "SELECT * FROM `accounts` WHERE `mail` = '%s'", inputtext);
			mysql_tquery(con_bd, text,  "mail_player", "d",playerid);
			return 1;
		}
		case 4:
		{
		    if(!response) return 1;
		    switch (listitem) {
				case 0: player_stats(playerid);
				case 1: ShowPlayerDialog(playerid, 5, DIALOG_STYLE_LIST, "Настройки", "Смена пароля\nИзменение имени","Выбор", "Назад");
				case 2: ShowPlayerDialog(playerid, 8, DIALOG_STYLE_LIST, "Команды сервера", "Общие команды\nКоманды фракции\nКоманды транспорта\nКоманды дома\nКоманды бизнеса","Выбрать", "Назад");
				case 3: ShowPlayerDialog(playerid, 9, DIALOG_STYLE_INPUT, "Связь с администрацией", ""W"\nВведите своё сообщение для администрации сервера\nОно должно быть кратким и ясным\n\nЕсли вы хотите подать жалобу на игрока,\nобязательно укажите его ID и причину жалобы","Отправить", "Назад");
			}
		}
		case 1000:
		{
		    if(!response) return 1;
		    else ShowPlayerDialog(playerid, 4, DIALOG_STYLE_LIST, "Меню персонажа", "Статистика\nНастройки\nКоманды\nОтправить жалобу/вопрос", "Выбор", "Закрыть");
		}
		case 5:
		{
			if(!response) return ShowPlayerDialog(playerid, 4, DIALOG_STYLE_LIST, "Меню персонажа", "Статистика\nНастройки\nКоманды\nОтправить жалобу/вопрос", "Выбор", "Закрыть");
			if(listitem == 0) ShowPlayerDialog(playerid, 6, 1, "Изменение пароля", ""I"Введите Ваш текущий пароль в поле ниже:", "Далее", "Назад");
			if(listitem == 1) ShowPlayerDialog(playerid,99,DIALOG_STYLE_INPUT,"Смена имени", ""W"Смена имени:\n\n Вы хотите сменить имя? Если да, то введите новое имя в поле ниже\n и ожидайте одобрения от администрации\n\n"E"Примечания: Имя должно соответствовать правилам, не должно состоять из цифр", "Изменить", "Отмена");
		}
        case 6:
		{
		    if(!response) return ShowPlayerDialog(playerid, 5, DIALOG_STYLE_LIST, "Настройки", "Смена пароля","Выбор", "Назад");
		    if(!strcmp(p_info[playerid][password], inputtext)) ShowPlayerDialog(playerid, 7, 1, "Изменение пароля", ""I"Введите Ваш новый пароль в поле ниже:", "Сохранить", "Закрыть");
     		else SendClientMessage(playerid, error, "Не верно указали текущий пароль");
	  	}
	  	case 7:
		{
		    if(!response) return 1;
   			if(strlen(inputtext) < 6 || strlen(inputtext) > 15 || strlen(inputtext) == 0)
			{
			    for(new i = strlen(inputtext); i != 0; --i)
	    		switch(inputtext[i])
				{
					case 'А'..'Я', 'а'..'я', ' ':
					{
					    SendClientMessage(playerid, error,"Для пароля должна быть от 6 до 15 символов");
					    SendClientMessage(playerid, error,"Также не допускается использование пробелов и русских букв");
		 				ShowPlayerDialog(playerid,7, 1, "Изменение пароля", ""I"Введите Ваш новый пароль в поле ниже:", "Сохранить", "Закрыть");
						return 1;
					}
				}
			}
			new query[96];
			mysql_format(con_bd,query,sizeof(query), "UPDATE `accounts` SET `password` = '%s' WHERE `name` = '%s'", inputtext,p_info[playerid][name]);
	        mysql_tquery(con_bd, query, "", "");
			strmid(p_info[playerid][password], inputtext, 0, strlen(inputtext), 255);
			format(query, sizeof(query),"Ваш новый пароль: %s", inputtext),SendClientMessage(playerid, info, query);
   			SendClientMessage(playerid, server, "Рекомендуем сделать скриншот (Клавиша F8) чтобы не забыть его");
			save_player(playerid);
		}
		case 99:
	    {
		    if(response)
		    {
	            new string[144];
		        if(!strlen(inputtext))return ShowPlayerDialog(playerid,99,DIALOG_STYLE_INPUT,"Смена имени", ""W"Смена имени:\n\n Вы хотите сменить имя? Если да, то введите новое имя в поле ниже\n и ожидайте одобрения от администрации\n\n"E"Примечания: Имя должно соответствовать правилам, не должно состоять из цифр", "Изменить", "Отмена");
				format(string, sizeof(string), "%s просит изменить ник на %s "E"Чтобы сменить ник, введите /setname %d", get_name(playerid), inputtext,playerid);
				SendAdminMessage(iAdm, string);
				format(string, sizeof(string), "Вы оставили заявку на смену ника: %s",inputtext);
				SendClientMessage(playerid, error, string);
				SetPVarString(playerid, "NewNickName", inputtext);
				SetPVarInt(playerid, "ChangeNickQuery",1);
			}
		}
		case 8:
		{
		    if(!response) return ShowPlayerDialog(playerid, 4, DIALOG_STYLE_LIST, "Меню персонажа", "Статистика\nНастройки\nКоманды\nОтправить жалобу/вопрос", "Выбор", "Закрыть");
		    if(listitem == 0)
			{
				SendClientMessage(playerid, info, "Общие: /m(enu - общее меню сервера /gps - навигатор /pay - передать деньги /mask - надеть маску /heal - использовать аптечку");
				SendClientMessage(playerid, info, "Общие: /ad - подать объявление /call - позвонить /h - положить трубку /p - поднять трубку /anim - анимации");
				SendClientMessage(playerid, error, "Лидеры: /lmenu /(un)invite /rang /gov");
				SendClientMessage(playerid, error, "Работа: /list - список заказов /load - загрузить товар (развозчик)");
			}
			if(listitem == 1)
			{
				switch(p_info[playerid][member])
				{
				    case 0: SendClientMessage(playerid, info, "Вы нигде не состоите"),ShowPlayerDialog(playerid, 4, DIALOG_STYLE_LIST, "Меню персонажа", "Статистика\nНастройки\nКоманды\nОтправить жалобу/вопрос", "Выбор", "Закрыть");
					case 1..3: SendClientMessage(playerid, info, "/(un)cuff - Использовать наручники /convoy - взять под конвой /arrest - аррестовать игрока /su - выдать розыск /wanted - розыскиваемые /r /d - чаты");
					case 4: SendClientMessage(playerid, info, "/clear - cнять розыск /(un)cuff - Использовать наручники /convoy - взять под конвой /arrest - аррестовать игрока /su - выдать розыск /wanted - розыскиваемые /r /d - чаты");
					case 5: SendClientMessage(playerid, info, "/take - загрузить боеприпасы /put - выгрузить припасы /makegun - собрать оружие /r /d - чаты");
					case 6: SendClientMessage(playerid, info, "/edit - проверить объявление /news - войти в эфир");
					case 7..9: SendClientMessage(playerid, info, "/f - чат");
					case 10..14: SendClientMessage(playerid, info, "/f - чат /makegun - собрать оружие /sellgun - продать оружие /capture - захватить территорию");
				}
			}
			if(listitem == 2) SendClientMessage(playerid, info, "/park - припарковать /delltune - удалить тюнинг /findcar - транспорт на карте"), SendClientMessage(playerid, info, "/lock - открыть/закрыть авто /fixcar - вернуть на место парковки /sell(my)car - продать транспорт");
			if(listitem == 3) SendClientMessage(playerid, info, "/house");
			if(listitem == 4) SendClientMessage(playerid, info, "/bizmenu /sellmybiz");
		}
		case 9:
		{
		    if(!response) return ShowPlayerDialog(playerid, 4, DIALOG_STYLE_LIST, "Меню персонажа", "Статистика\nНастройки\nКоманды\nОтправить жалобу/вопрос", "Выбор", "Закрыть");
		    if(strlen(inputtext) >= 120) return ShowPlayerDialog(playerid, 9, 1, "Связь с администрацией", ""E"Много символов\n\n"W"Введите своё сообщение для администрации сервера\nОно должно быть кратким и ясным\n\nЕсли вы хотите подать жалобу на игрока,\nобязательно укажите его ID и причину жалобы", "Отправить", "Назад");
		    new text[128];
			format(text, sizeof(text), "%s[%d] :"I" %s",get_name(playerid), playerid, (inputtext));
		    SendAdminMessage(server, text);
			SendClientMessage(playerid,server,text);
		    SendClientMessage(playerid,server, "Ваше сообщение отправлено");
		    return true;
		}
		case 10:
		{
		    new str[128];
			if(!response) return 1;
			if ( listitem == 0 )
			{
			    if(p_info[playerid][level] < level_bus)
				{
				    f(str, "Не доступно, нужно проживать в штате от %d лет", level_bus);
					return SendClientMessage(playerid, error, str);
				}
				if(p_info[playerid][member] != 0) return SendClientMessage(playerid, info, "Не доступно, Вы состоите во фракции");
				if(p_info[playerid][job] == 1) return SendClientMessage(playerid, info, "Не доступно, Вы уже устроены на данную работу");
				p_info[playerid][job] = 1;
				SendClientMessage(playerid, server, "Поздравляем! "I"Вы устроились на работу водителя автобуса!");
			}
			if ( listitem == 1 )
			{
			    if(p_info[playerid][level] < level_taxi)
				{
				    f(str, "Не доступно, нужно проживать в штате от %d лет", level_taxi);
					return SendClientMessage(playerid, error, str);
				}
				if(p_info[playerid][member] != 0) return SendClientMessage(playerid, info, "Не доступно, Вы состоите во фракции");
				if(p_info[playerid][job] == 2) return SendClientMessage(playerid, info, "Не доступно, Вы уже устроены на данную работу");
				p_info[playerid][job] = 2;
				SendClientMessage(playerid, server, "Поздравляем! "I"Вы устроились на работу таксиста!");
			}
			if ( listitem == 2 )
			{
			    if(p_info[playerid][level] < level_delivery)
				{
				    f(str, "Не доступно, нужно проживать в штате от %d лет", level_delivery);
					return SendClientMessage(playerid, error, str);
				}
				if(p_info[playerid][member] != 0) return SendClientMessage(playerid, info, "Не доступно, Вы состоите во фракции");
				if(p_info[playerid][job] == 3) return SendClientMessage(playerid, info, "Не доступно, Вы уже устроены на данную работу");
				p_info[playerid][job] = 3;
				SendClientMessage(playerid, server, "Поздравляем! "I"Вы устроились на работу развозчика продуктов!");
			}
		}
		case 11:
		{
		    if(!response) return RemovePlayerFromVehicle(playerid);
		    new str[128];
			if(p_info[playerid][cash] < rent_bus)
			{
			    f(str, "У Вас не достаточно денег. Нужно %d$", rent_bus);
			    SendClientMessage(playerid, error, str);
				return RemovePlayerFromVehicle(playerid);
			}
	   		set_money(playerid, -rent_bus);
			SendClientMessage(playerid, info, "Для того, чтобы начать работу водителя автобуса нажмите 2");
			GetPlayerRentBus[playerid] = GetPlayerVehicleID(playerid);
			bus_info[GetPlayerRentBus[playerid]] = 1;
			return 1;
		}
		case 12:
		{
		    if(!response) return 1;
		    if(GetPVarInt(playerid, "@startJob") == 1) return EndPlayerCasualJob(playerid);
			if(!strlen(inputtext)) return ShowPlayerDialog(playerid, 12, 1, "Cтоимость проезда", ""W"Сколько будет стоить проезд?\nУкажите цену (0$ - 100$)","Далее", "Закрыть");
			if(strval(inputtext) < 1 || strval(inputtext) > 100) return ShowPlayerDialog(playerid, 12, 1, "Cтоимость проезда", ""W"Сколько будет стоить проезд?\nУкажите цену (0$ - 100$)","Далее", "Закрыть");
			SetPVarInt(playerid, "@payment", strval(inputtext));
		    SetPVarInt(playerid, "@flight_num", 0);
			ShowPlayerDialog(playerid, 13, DIALOG_STYLE_TABLIST_HEADERS, "Выберите маршрут", "Начальная точка\t \tКонечная точка\nАвтовокзал Los Santos\t–\tАвтовокзал San Fierro", "Выбор","Закрыть");
		}
		case 13:
		{
	    	if(!response) return 1;
			if(listitem == 0)
			{
			    new string[84];
                format(string, sizeof(string), "Автовокзал Los Santos – Автовокзал San Fierro\nСтоимость проезда: "I"%d$", GetPVarInt(playerid, "@payment"));
				INFO_VEH[GetPlayerRentBus[playerid]] = CreateDynamic3DTextLabel(string, info, 0.0, 0.0, 1.0, 30.0, INVALID_PLAYER_ID, GetPlayerRentBus[playerid], 1);
				SetPVarInt(playerid, "race_check", -1);
            	set_check_race(playerid);
            	SetPVarInt(playerid, "@startJob",1);
	       	}
	       	return 1;
	 	}
	 	case 15:
		{
			if(!response) return 1>0;
			new str[144];
			if(listitem == 0)
			{
				p_info[GetPVarInt(playerid, "@idLeader")][leader] = 0;
				p_info[GetPVarInt(playerid, "@idLeader")][spawn] = 0;
				p_info[GetPVarInt(playerid, "@idLeader")][member] = 0;
				p_info[GetPVarInt(playerid, "@idLeader")][rang] = 0;
				f(str, "Вы сняли лидерство %s с игрока %s", fracName(GetPVarInt(playerid, "@idLeader")), get_name(GetPVarInt(playerid, "@idLeader")));
				SendClientMessage(playerid, info, str);
				f(str, "Администратор %s снял с вас лидерство фракции %s",get_name(playerid), fracName(GetPVarInt(playerid, "@idLeader")));
				SendClientMessage(GetPVarInt(playerid, "@idLeader"), info, str);
				SpawnPlayer(GetPVarInt(playerid, "@idLeader"));
				return 1;
			}
			p_info[GetPVarInt(playerid, "@idLeader")][leader] = listitem;
			p_info[GetPVarInt(playerid, "@idLeader")][member] = listitem;
			p_info[GetPVarInt(playerid, "@idLeader")][rang] = 10;
			f(str, "Администратор %s назначил Вас лидером %s", get_name(playerid),fracName(GetPVarInt(playerid, "@idLeader")));
			SendClientMessage(GetPVarInt(playerid, "@idLeader"), info, str);
			f(str, "Вы назначили %s[%i] лидером %s [id: %d]", get_name(GetPVarInt(playerid, "@idLeader")),GetPVarInt(playerid, "@idLeader"),fracName(GetPVarInt(playerid, "@idLeader")),listitem);
			SendClientMessage(playerid, info, str);
            fracSkin(GetPVarInt(playerid, "@idLeader"));
            fracSpawn(GetPVarInt(playerid, "@idLeader"));
		}
		case 16:
		{
			if(!response) return 1;
			if(listitem == 0) ShowPlayerDialog(playerid, 17, DIALOG_STYLE_INPUT, "Создание дома:", ""W"Введите через запятую: (Тип дома),(Цена)\nТип домов: 1 тип - 15кв.м | 2 тип - 36кв.м | 3 тип - 72кв.м | 4 тип - 120кв.м\n\n"I"[ Например: 1,50000 | где - (1 Тип, 50000 - цена) ]","Создать", "Назад");
			if(listitem == 1) ShowPlayerDialog(playerid, 35, DIALOG_STYLE_INPUT, "Создание бизнеса:", ""W"Введите через запятую: (Тип бизнеса),(Цена бизнеса)\nТип бизнеса: 1 - 24/7 | 2 - Магазин одежды | 3 - Бар | 4 - АЗС\n\nНапример: "I"[ 1,50000 (1 Тип, 50000 - цена) ]","Создать", "Назад");
			return 1;
		}
		case 17:
		{
			    if(!response) return 1;
				new params[4],value[128];
				if(sscanf(inputtext, "p<,>dd", params[0], params[1])) return SendClientMessage(playerid, error, "Возможно вы вводите что-то не правильно!"), ShowPlayerDialog(playerid, 17, DIALOG_STYLE_INPUT, "Создание дома:", ""W"Введите через запятую: (Тип дома),(Цена)\nТип домов: 1 тип - 15кв.м | 2 тип - 36кв.м | 3 тип - 72кв.м | 4 тип - 120кв.м\n\n"I"[ Например: 1,50000 | где - (1 Тип, 50000 - цена) ]","Создать", "Назад");
				new Float:Pos[6], query[812];
			    GetPlayerPos(playerid, Pos[0], Pos[1], Pos[2]);
				if(params[0] == 1)
	            Pos[3] = 421.5356, Pos[4] = 2536.4678,
	            Pos[5] = 10.0,params[2] = 10,params[3] = 0;
	            if(params[0] == 2)
	            Pos[3] = 222.9335, Pos[4] = 1287.8695,
	            Pos[5] = 1082.1406,params[2] = 1,params[3] = 1;
	            if(params[0] == 3)
	            Pos[3] = -68.3739, Pos[4] = 1355.142,
	            Pos[5] = 1080.2109,params[2] = 6,params[3] = 2;
	            if(params[0] == 4)
	            Pos[3] = 2324.4224, Pos[4] = -1148.4608,
	            Pos[5] = 1050.7101,params[2] = 12,params[3] = 3;

				format(query, sizeof(query), "INSERT INTO `house` (`h_id`, `h_owned`, `h_int`, `h_value`, `h_owner`,`h_squar`, `h_enterx`, `h_entery`, `h_enterz`, `h_exitx`, `h_exity`, `h_exitz`) VALUES ('%d','0','%d','%d','state','%d','%f','%f','%f','%f','%f','%f')",totalhouses,params[2],params[1],params[0], Pos[0], Pos[1], Pos[2],Pos[3],Pos[4],Pos[5]);
				mysql_tquery(con_bd, query, "", "");
				h_info[totalhouses][h_id] = totalhouses;
			    h_info[totalhouses][h_int] = params[2];
			    h_info[totalhouses][h_enter][0] = Pos[0];
				h_info[totalhouses][h_enter][1] = Pos[1];
			    h_info[totalhouses][h_enter][2] = Pos[2];
			  	h_info[totalhouses][h_exit][0] = Pos[3];
				h_info[totalhouses][h_exit][1] = Pos[4];
			    h_info[totalhouses][h_exit][2] = Pos[5];
			  	h_info[totalhouses][h_squar] = params[0];
			  	h_info[totalhouses][h_value] = params[1];
			  	format(value,sizeof(value),"Дом №%d\nЦена: %d$",totalhouses,h_info[totalhouses][h_value]);
			  	h_info[totalhouses][h_text] = Create3DTextLabel(value,white,h_info[totalhouses][h_enter][0], h_info[totalhouses][h_enter][1], h_info[totalhouses][h_enter][2],20.0,0,1);
			  	h_info[totalhouses][h_icon] = CreateDynamicMapIcon(h_info[totalhouses][h_enter][0], h_info[totalhouses][h_enter][1], h_info[totalhouses][h_enter][2], 31, -1, 0, -1, -1, 400.0);
                h_info[totalhouses][h_pickup] = CreateDynamicPickup(1273, 23, h_info[totalhouses][h_enter][0], h_info[totalhouses][h_enter][1], h_info[totalhouses][h_enter][2],-1);
				update_house(totalhouses);
			    save_house(totalhouses);
			    totalhouses++;
				return 1;
		}
		case 18:
		{
			if(!response) return 1;
			new Float:oldposx, Float:oldposy, Float:oldposz,string[144];
			GetPlayerPos(playerid, oldposx, oldposy, oldposz);
			for(new h = 0; h < sizeof(h_info); h++)
			{
				if(IsPlayerInRangeOfPoint(playerid, 1.0, h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2]))
				{
				    if(h_info[h][h_owned] == 0)
				    {
						if(p_info[playerid][keyh] != 60635) return SendClientMessage(playerid, error, "У Вас уже есть дом");
						if(p_info[playerid][cash] < h_info[h][h_value])
						{
							format(string,sizeof(string),"У вас недостаточно денег для покупки дома. Требуется: %d$",h_info[h][h_value]);
							SendClientMessage(playerid,error, string);
							return 1;
						}
						p_info[playerid][keyh] = h;
						h_info[h][h_owned] = 1;
						h_info[h][h_lock] = 1;
						h_info[h][h_rent] = 10;
						strmid(h_info[h][h_owner], get_name(playerid), 0, strlen(get_name(playerid)), 255);
						set_money(playerid, -h_info[h][h_value]);
						SetPlayerInterior(playerid,h_info[h][h_int]);
						SetPlayerPos(playerid,h_info[h][h_exit][0],h_info[h][h_exit][1],h_info[h][h_exit][2]);
						SetPlayerVirtualWorld(playerid,h+50);
						format(string, sizeof(string), "Вы приобрели дом за %d$ Остаток денег на руках: %d.",h_info[h][h_value], p_info[playerid][cash]);
						SendClientMessage(playerid, info, string);
						p_info[playerid][spawn] = 2;
						update_house(h);
						save_house(h);
						return 1;
					}
					else
					{
					    if(p_info[playerid][keyh] == h || h_info[h][h_lock] == 0)
						{
						    SetPlayerInterior(playerid,h_info[h][h_int]);
							SetPlayerPos(playerid,h_info[h][h_exit][0],h_info[h][h_exit][1],h_info[h][h_exit][2]);
							SetPlayerVirtualWorld(playerid,h+50);
						}
						else SendClientMessage(playerid,error,"Дверь у данного дома закрыта");
					}
				}
			}
		}
		case 19:
		{
			if(!response) return 1;
			new str[128];
			f(str, "%s входную дверь\nПродать дом государству\nПродать дом игроку", (h_info[p_info[playerid][keyh]][h_lock] == 0)?("Закрыть"):("Открыть"));
			return ShowPlayerDialog(playerid, 32, DIALOG_STYLE_LIST, "Управление домом", "Открыть входную дверь\nПродать дом государству\nПродать дом игроку", "Выбрать", "Отмена");
		}
		case 20:
		{
			if(!response) return 1;
			new string[64];
			h_info[p_info[playerid][keyh]][h_lock] = 1;
			h_info[p_info[playerid][keyh]][h_owned] = 0;
			update_house(p_info[playerid][keyh]);
			strmid(h_info[p_info[playerid][keyh]][h_owner], "The State", 0, strlen("The State"), 255);
  			set_money(playerid, h_info[p_info[playerid][keyh]][h_value]);
			format(string, sizeof(string), "Дом продан государству за %d$", h_info[p_info[playerid][keyh]][h_value]);
			SendClientMessage(playerid, info, string);
			SetPlayerPos(playerid,h_info[p_info[playerid][keyh]][h_enter][0],h_info[p_info[playerid][keyh]][h_enter][1],h_info[p_info[playerid][keyh]][h_enter][2]);
			SetPlayerInterior(playerid,0);
			SetPlayerVirtualWorld(playerid, 0);
			p_info[playerid][keyh] = 60635;
			return true;
		}
		case 21:
		{
			if(!response) return 1;
			new params[2],string[144];
			if(GetPVarInt(playerid,"pred") != 60605) return SendClientMessage(playerid, error, "Вы уже делали предложение. Чтобы отменить его нажмите N");
			if (!IsPlayerInRangeOfPoint(playerid, 5.0, h_info[p_info[playerid][keyh]][h_enter][0],h_info[p_info[playerid][keyh]][h_enter][1], h_info[p_info[playerid][keyh]][h_enter][2]))return SendClientMessage(playerid, error, "Вы далеко от своего дома");
            if(sscanf(inputtext, "p<,>dd", params[0], params[1])) return SendClientMessage(playerid, error, "Возможно вы вводите что-то не правильно!"),ShowPlayerDialog(playerid,21,DIALOG_STYLE_INPUT,"Продажа имущества","Введите ID игрока (покупателя) и Сумму (Цена продажи) через запятую:\n\n\t[напр. 23, 25300]","Предложить","Нет");
			if(params[1] < 1000 || params[1] > 25000000) return SendClientMessage(playerid, error, "Нельзя продать меньше чем за 1000$!"),ShowPlayerDialog(playerid,21,DIALOG_STYLE_INPUT,"Продажа имущества","Введите ID игрока (покупателя) и Сумму (Цена продажи) через запятую:\n\n\t[напр. 23, 25300]","Предложить","Нет");
			if(!IsPlayerConnected(params[0])) return SendClientMessage(playerid, error, "Игрок не найден!"),ShowPlayerDialog(playerid,21,DIALOG_STYLE_INPUT,"Продажа имущества","Введите ID игрока (покупателя) и Сумму (Цена продажи) через запятую:\n\n\t[напр. 23, 25300]","Предложить","Нет");
			if (!IsPlayerInRangeOfPoint(params[0], 5.0, h_info[p_info[playerid][keyh]][h_enter][0],h_info[p_info[playerid][keyh]][h_enter][1], h_info[p_info[playerid][keyh]][h_enter][2]))return SendClientMessage(playerid, error, "Игрок которому вы хотите продать, далеко от вашего дома");
			if(params[0] == playerid) return SendClientMessage(playerid,error, "Запрещено продавать самому себе");
			if(p_info[params[0]][keyh] != 60635) return SendClientMessage(playerid,error, "У игрока уже есть дом");
			f(string, "Вы предложили %s купить Ваш дом за "W"%d$.",get_name(params[0]),params[1]);
			SendClientMessage(playerid, info, string);
			f(string, "%s предлагает Вам купить его дом за "W"%d$.",get_name(playerid),params[1]);
			SendClientMessage(params[0], info, string);
			SendClientMessage(params[0], -1, "Нажмите {03c03c}Y "W"чтобы купить его или {ff7518}N "W"для отказа");
			SetPVarInt(params[0],"HouseOffer", playerid);
			SetPVarInt(params[0],"HousePrice", params[1]);
			SetPVarInt(params[0],"housepokup",1);
			SetPVarInt(playerid,"pred",60605);
			return true;
		}
		case 22:
		{
		    if(!response) return RemovePlayerFromVehicle(playerid);
			{
			    new vehicleid,string[144];
				if(p_info[playerid][veh_id] != 60605)
				{
					SendClientMessage(playerid, error, "У Вас уже есть машина");
					SendClientMessage(playerid, error, "Продать её можно c помощью команды. {FFFFFF}(/sellcar или /sellmycar)");
					RemovePlayerFromVehicle(playerid);
					return true;
	   			}
				if(p_info[playerid][cash] < PriceCar(GetPlayerVehicleID(playerid)))
				{
					f(string, "У Вас не достаточно денег. "I"Нужно %d$", PriceCar(GetPlayerVehicleID(playerid)));
					SendClientMessage(playerid, error, string);
	                RemovePlayerFromVehicle(playerid);
					return true;
				}

				new color = random(127);
				if(IsPlayerInRangeOfPoint(playerid,50,548.9030,-1288.3748,16.9532))
				{
					switch(random(2))
					{
					    case 0:
						{
							vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), 560.2803, -1285.4069, 16.8732, 3.2711, color , color, -1);
							veh_info[vehicleid][v_pos][0] = 560.2803;
							veh_info[vehicleid][v_pos][1] = -1285.4069;
							veh_info[vehicleid][v_pos][2] = 16.8732;
							veh_info[vehicleid][v_pos][3] = 3.2711;
						}
						case 1:
						{
						    vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), 548.9030,-1288.3748,16.9532,2.5312, color , color, -1);
							veh_info[vehicleid][v_pos][0] = 548.9030;
							veh_info[vehicleid][v_pos][1] = -1288.3748;
							veh_info[vehicleid][v_pos][2] = 16.9532;
							veh_info[vehicleid][v_pos][3] = 2.5312;
						}
					}
				}
				if(IsPlayerInRangeOfPoint(playerid,50,2474.6365,1332.7584,10.5439))
				{
					switch(random(2))
					{
					    case 0:
						{
							vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), 2474.3396,1328.5842,10.5507,91.7117, color , color, -1);
							veh_info[vehicleid][v_pos][0] = 2474.3396;
							veh_info[vehicleid][v_pos][1] = 1328.5842;
							veh_info[vehicleid][v_pos][2] = 10.5507;
							veh_info[vehicleid][v_pos][3] = 91.7117;
						}
						case 1:
						{
						    vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), 2474.6365,1332.7584,10.5439,89.3970, color , color, -1);
							veh_info[vehicleid][v_pos][0] = 2474.6365;
							veh_info[vehicleid][v_pos][1] = 1332.758;
							veh_info[vehicleid][v_pos][2] = 10.5439;
							veh_info[vehicleid][v_pos][3] = 89.3970;
						}
					}
				}
				if(IsPlayerInRangeOfPoint(playerid,50,-1985.2921,283.0442,34.3614))
				{
					switch(random(2))
					{
					    case 0:
						{
							vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), -1985.2921,283.0442,34.3614,90.6106, color , color, -1);
							veh_info[vehicleid][v_pos][0] = -1985.2921;
							veh_info[vehicleid][v_pos][1] = 283.0442;
							veh_info[vehicleid][v_pos][2] = 34.3614;
							veh_info[vehicleid][v_pos][3] = 90.6106;
						}
						case 1:
						{
						    vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), -1985.7993,293.8629,34.4822,90.1730, color , color, -1);
							veh_info[vehicleid][v_pos][0] = -1985.7993;
							veh_info[vehicleid][v_pos][1] = 293.8629;
							veh_info[vehicleid][v_pos][2] = 34.4822;
							veh_info[vehicleid][v_pos][3] = 90.1730;
						}
					}
				}
				if(IsPlayerInRangeOfPoint(playerid,50,-1645.3274,1217.9027,6.8129))
				{
					switch(random(2))
					{
					    case 0:
						{
							vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), -1645.3274,1217.9027,6.8129,225.8598, color , color, -1);
							veh_info[vehicleid][v_pos][0] = -1645.3274;
							veh_info[vehicleid][v_pos][1] = 1217.9027;
							veh_info[vehicleid][v_pos][2] = 6.8129;
							veh_info[vehicleid][v_pos][3] = 225.8598;
						}
						case 1:
						{
						    vehicleid = CreateVehicle(GetVehicleModel(GetPlayerVehicleID(playerid)), -1639.3306,1212.1394,6.8120,225.8768, color , color, -1);
							veh_info[vehicleid][v_pos][0] = -1639.3306;
							veh_info[vehicleid][v_pos][1] = 1212.1394;
							veh_info[vehicleid][v_pos][2] = 6.8120;
							veh_info[vehicleid][v_pos][3] = 225.8768;
						}
					}
				}
				CAR++;
				SetVehicleToRespawn(vehicleid);
				veh_info[vehicleid][v_lock] = 1;
				GetVehicleParamsEx(vehicleid,engine,lights,alarm,doors,bonnet,boot,objective);
				SetVehicleParamsEx(vehicleid,engine,lights,alarm,true,bonnet,boot,objective);
				TogglePlayerControllable(playerid, true);
				p_info[playerid][veh_id] = vehicleid;
				veh_info[vehicleid][v_if_buy] = 1;
				veh_info[vehicleid][v_color] = color;
				veh_info[vehicleid][v_model] = GetVehicleModel(GetPlayerVehicleID(playerid));
				veh_info[vehicleid][v_price] = PriceCar(GetPlayerVehicleID(playerid));
				set_money(playerid,- PriceCar(GetPlayerVehicleID(playerid)));
				f(string, "Поздравляем! вы приобрели транспортное средство %s за %d$",VehicleNames[veh_info[vehicleid][v_model]-400],PriceCar(GetPlayerVehicleID(playerid)));
				SendClientMessage(playerid, info,string);
				SendClientMessage(playerid, error, "Команды для управления личным авто смотрите в /m - Команды - Команды транспорта");
				strmid(veh_info[vehicleid][v_owner], get_name(playerid), 0, strlen(get_name(playerid)), 255);
				f(string, "Владелец: %s", get_name(playerid));
				player_owner[vehicleid] = CreateDynamic3DTextLabel(string, error, 0.0, 0.0, 0.5, 30.0, INVALID_PLAYER_ID, vehicleid, 1);
				RemovePlayerFromVehicle(playerid);
				SaveVehicles();
			}
			return true;
		}
		case 23:
		{
		    if(!response) return 1;
		    new price = veh_info[p_info[playerid][veh_id]][v_price]/2;
			set_money(playerid, price);
			DestroyVehicle(p_info[playerid][veh_id]);
			veh_info[p_info[playerid][veh_id]][v_if_buy] = 0;
			veh_info[p_info[playerid][veh_id]][v_lock] = 0;
			SendClientMessage(playerid, info, "Ваш транспорт успешно продан");
			DestroyDynamic3DTextLabel(player_owner[p_info[playerid][veh_id]]);
			p_info[playerid][veh_id] = 60605;
		}
		case 24:
		{
			if(!response) return 1;
			set_money(playerid,-1000);
			AutoTest(playerid, 0);
		}
		case 25:
		{
		    if(!response) return 1;
		    SetPlayerInterior(playerid,0);
			SetPlayerVirtualWorld(playerid, 0);
			SetPlayerPos(playerid,-2026.9436,-99.6266,35.1641);
			SetPlayerFacingAngle(playerid, 355.8038);
			SetCameraBehindPlayer(playerid);
			SendClientMessage(playerid, info,"Садитесь в припаркованную в машину которая стоит на парковке и езжайте по красным маркерам.");
		}
		case 26:
		{
			if(!response) return 1;
			if(p_info[playerid][cash] >= 1000)
			{
				new str[256];
				f(str, "{ffffff}Вам будет предложено 5 вопросов для проверки теоретических знаний\nЧтобы сдать эту часть экзамена необходимо ответить на 4 из них!\nВ случае 1 не правильно ответа - экзамен будет завершен!\nЖелаем удачи!");
				ShowPlayerDialog(playerid,24,0,"Теория",str,"Далее","Отмена");
			}
			else SendClientMessage(playerid, error,"У вас недостаточно средств");
		}
		case 27:
		{
			if(!response) return 1;
			if(listitem != 2) return SetPVarInt(playerid,"FAIL",GetPVarInt(playerid,"FAIL")+1),AutoTest(playerid, 1);
			SetPVarInt(playerid,"ACCEPT",GetPVarInt(playerid,"ACCEPT")+1),AutoTest(playerid, 1);
		}
		case 28:
		{
			if(!response) return 1;
			if(listitem != 1) return SetPVarInt(playerid,"FAIL",GetPVarInt(playerid,"FAIL")+1),AutoTest(playerid, 2);
			SetPVarInt(playerid,"ACCEPT",GetPVarInt(playerid,"ACCEPT")+1),AutoTest(playerid, 2);
		}
		case 29:
		{
			if(!response) return 1;
			if(listitem != 0) return SetPVarInt(playerid,"FAIL",GetPVarInt(playerid,"FAIL")+1),AutoTest(playerid, 3);
			SetPVarInt(playerid,"ACCEPT",GetPVarInt(playerid,"ACCEPT")+1),AutoTest(playerid, 3);
		}
		case 30:
		{
			if(!response) return 1;
			if(listitem != 4) return SetPVarInt(playerid,"FAIL",GetPVarInt(playerid,"FAIL")+1),AutoTest(playerid, 4);
			SetPVarInt(playerid,"ACCEPT",GetPVarInt(playerid,"ACCEPT")+1),AutoTest(playerid, 4);
		}
		case 31:
		{
			if(!response) return 1;
			if(listitem != 1) return SetPVarInt(playerid,"FAIL",GetPVarInt(playerid,"FAIL")+1),AUTSH(playerid);
			SetPVarInt(playerid,"ACCEPT",GetPVarInt(playerid,"ACCEPT")+1),AUTSH(playerid);
		}
		case 32:
		{
			if(!response) return 1;
			if(listitem == 0)
			{
				if(h_info[p_info[playerid][keyh]][h_lock])
				{
					h_info[p_info[playerid][keyh]][h_lock] = 0;
					GameTextForPlayer(playerid, "~g~Unlock  home", 2000, 5);
					PlayerPlaySound(playerid, 1145, 0.0, 0.0, 0.0);
					ShowPlayerDialog(playerid, 19, DIALOG_STYLE_LIST, "Управление домом", "Закрыть входную дверь\nПродать дом государству\nПродать дом игроку", "Выбрать", "Отмена");
				}
				else
				{
					h_info[p_info[playerid][keyh]][h_lock] = 1;
					GameTextForPlayer(playerid, "~r~Lock home", 2000, 5);
					PlayerPlaySound(playerid, 1145, 0.0, 0.0, 0.0);
					ShowPlayerDialog(playerid, 19, DIALOG_STYLE_LIST, "Управление домом", "Открыть входную дверь\nПродать дом государству\nПродать дом игроку", "Выбрать", "Отмена");
				}
			}
			if(listitem == 1) ShowPlayerDialog(playerid,20,0,"Продажа имущества","\t\tВы собираетесь продать дом?","Да","Нет");
			if(listitem == 2) ShowPlayerDialog(playerid,21,DIALOG_STYLE_INPUT,"Продажа имущества","Введите ID игрока (покупателя) и Сумму (Цена продажи) через запятую:\n\n\t[напр. 23, 25300]","Предложить","Нет");
		}
        case 35:
		{
			    if(!response) return 1;
				new params[3];
				if(sscanf(inputtext, "p<,>dd", params[0], params[1])) return SendClientMessage(playerid, error, "Возможно вы вводите что-то не правильно!"), ShowPlayerDialog(playerid, 35, DIALOG_STYLE_INPUT, "Создание бизнеса:", ""W"Введите через запятую: (Тип бизнеса),(Цена бизнеса)\nТип бизнеса: 1 - 24/7 | 2 - Магазин одежды | 3 - Бар | 4 - АЗС\n\nНапример: "I"[ 1,50000 (1 Тип, 50000 - цена) ]","Создать", "Назад");
				new Float:Pos[9], query[612];
			    GetPlayerPos(playerid, Pos[0], Pos[1], Pos[2]);
				if(params[0] == 1)
				{
                    params[2] = 6;
           			Pos[3] = -26.6362;
					Pos[4] = -57.9207;
				    Pos[5] = 1003.8524;
				    Pos[6] = -23.1813;
					Pos[7] = -55.1033;
    				Pos[8] = 1003.5469;
				}
				if(params[0] == 2)
				{
				    params[2] = 1;
				    Pos[3] = 203.777999;
					Pos[4] = -48.492397;
				    Pos[5] = 1001.804687;
				    Pos[6] = 214.4668;
					Pos[7] = -40.2532;
					Pos[8] = 1002.0234;
				}
				if(params[0] == 3)
				{
				    params[2] = 18;
				    Pos[3] = -229.0618;
					Pos[4] = 1401.1942;
				    Pos[5] = 27.7656;
				    Pos[6] = -225.2406;
					Pos[7] = 1404.1205;
					Pos[8] = 27.7734;
				}
				if(params[0] == 4)
				{
					params[2] = 0;//Интерьер
					Pos[3] = 2063.0410;//Выход
					Pos[4] = -5745.1016;//Выход
					Pos[5] = 5006.2986;//Выход
					Pos[6] = 2063.0410;//Выход
					Pos[7] = -5745.1016;//Выход
					Pos[8] = 5006.2986;//Выход
				}
				if(params[0] == 1) strmid(b_info[totalbiz][_name], "Супермаркет", 0, strlen("Супермаркет"), 255);
				if(params[0] == 2) strmid(b_info[totalbiz][_name], "Магазин одежды", 0, strlen("Магазин одежды"), 255);
				if(params[0] == 3) strmid(b_info[totalbiz][_name], "Бар", 0, strlen("Бар"), 255);
				if(params[0] == 4) f(query,"Заправочная станция №%d",totalbiz),strmid(b_info[totalbiz][_name], query, 0, strlen(query), 255);
				new value[445];
				f(value,"(`b_id`, `b_owned`, `b_int`, `b_world`, `b_price`, `b_owner`,`b_name`, `b_tip`, `b_enterX`, `b_enterY`, `b_enterZ`, `b_exitX`, `b_exitY`, `b_exitZ`, \
				`b_menuX`, `b_menuY`, `b_menuZ`, `b_cena`, `b_prod`, `b_bank`, `b_colvo`, `b_zakaz`)");
				format(query, sizeof(query), "INSERT INTO `biz` %s VALUES ('%d', '0', '%d', '%d', '%d', 'NoName' ,'%s', '%d', '%f', '%f', '%f','%f', '%f', '%f','%f', '%f', '%f','10','300','0','0','0')",value,totalbiz,params[2],totalbiz,params[1],b_info[totalbiz][_name],params[0], Pos[0], Pos[1], Pos[2],Pos[3],Pos[4],Pos[5],Pos[6],Pos[7],Pos[8]);
				mysql_tquery(con_bd, query,"", "");
				b_info[totalbiz][_b_id] = totalbiz;
			    b_info[totalbiz][_int] = params[2];
			    b_info[totalbiz][_world] = totalbiz;
			    b_info[totalbiz][b_enter][0] = Pos[0];
				b_info[totalbiz][b_enter][1] = Pos[1];
			    b_info[totalbiz][b_enter][2] = Pos[2];
			  	b_info[totalbiz][b_exit][0] = Pos[3];
				b_info[totalbiz][b_exit][1] = Pos[4];
			    b_info[totalbiz][b_exit][2] = Pos[5];
			  	b_info[totalbiz][b_menu][0] = Pos[6];
				b_info[totalbiz][b_menu][1] = Pos[7];
			    b_info[totalbiz][b_menu][2] = Pos[8];
			    b_info[totalbiz][_colvo] = 0;
			    b_info[totalbiz][_zakaz] = 0;
			    b_info[totalbiz][_prod] = 200;
			  	b_info[totalbiz][_tip] = params[0];
			  	b_info[totalbiz][_price] = params[1];
				if(params[0] != 4) b_info[totalbiz][_pic] = CreateDynamicPickup(1559, 23, b_info[totalbiz][b_enter][0], b_info[totalbiz][b_enter][1], b_info[totalbiz][b_enter][2],-1);
				format(value,sizeof(value),"%s\nЦена: %d$",b_info[totalbiz][_name],b_info[totalbiz][_price]);
			  	b_info[totalbiz][_text] = Create3DTextLabel(value,white,b_info[totalbiz][b_enter][0], b_info[totalbiz][b_enter][1], b_info[totalbiz][b_enter][2],20.0,0,1);
			    if(params[0] != 4) CreateDynamicMapIcon(b_info[totalbiz][b_enter][0], b_info[totalbiz][b_enter][1], b_info[totalbiz][b_enter][2],56,0);
				else CreateDynamicMapIcon(b_info[totalbiz][b_enter][0], b_info[totalbiz][b_enter][1], b_info[totalbiz][b_enter][2],55,0);
			    totalbiz++;
			    biz_save();
			    Update3DTexts();
				return 1;
		}
		case 36:
   		{
   		    if(response)
   		    {
   		        for(new idx = 0; idx < totalbiz; idx++)
				{
				    if(!IsPlayerInRangeOfPoint(playerid,3.0,b_info[idx][b_enter][0],b_info[idx][b_enter][1],b_info[idx][b_enter][2])) continue;
				    if(p_info[playerid][key] > -1) return SendClientMessage(playerid,error,"Вы уже бизнесмен!");
				    if(p_info[playerid][cash] < b_info[idx][_price]) return SendClientMessage(playerid,error,"У вас недостаточно денег для покупки этого бизнеса!");
				    if(b_info[idx][_owned] == 1) return SendClientMessage(playerid,error,"Этот бизнес на данный момент не продается!");
				    p_info[playerid][key] = b_info[idx][_b_id];
				    b_info[p_info[playerid][key]][_cena1] = 3;
					set_money(playerid, -b_info[idx][_price]);
					strmid(b_info[idx][_owner], p_info[playerid][name], 0, strlen(p_info[playerid][name]), 255);
	    			b_info[idx][_owned] = 1;
	    			b_info[idx][_colvo] = 10;
	    			b_info[idx][_prod] = 200;
	    			b_info[idx][_lock] = 0;
	    			SendClientMessage(playerid,info,"Поздравляем вас с покупкой бизнеса, теперь вы бизнесмен!");
					SendClientMessage(playerid,error,"Подсказка: Меню бизнеса - /bizmenu");
					Update3DTexts();
					return true;
 				}
			}
			return true;
		}
		case 37:
  		{
  		    if(!response) return 1;
	        new string[332],btext[26];
		    if(listitem == 0)
		    {
			   	switch(b_info[p_info[playerid][key]][_tip])
				{
				    case 1:  btext = "Cупермаркет";
					case 2:  btext = "Магазин одежды";
					case 3:  btext = "Бар";
					case 4:  btext = "АЗС";
				}
		        format(string,sizeof(string),""W"Статистика бизнеса\t\t\t"I"%s\n\n"W"Владелец:\t\t\t\t"I"%s\n"W"Тип бизнеса:\t\t\t\t"I"%s\n\n"W"Продукты/топливо:\t\t\t"I"%d\n"W"Денег на счету:\t\t\t"I"%d$\n\n"W"Аренда оплачена на %d дней",\
				b_info[p_info[playerid][key]][_name],b_info[p_info[playerid][key]][_owner],btext,b_info[p_info[playerid][key]][_prod],b_info[p_info[playerid][key]][_bank]);
				ShowPlayerDialog(playerid,0000,DIALOG_STYLE_MSGBOX,""I"Статистика бизнеса",string,"Ок","Отмена");
				return true;
			}
			if(listitem == 1)
			{
			    ShowPlayerDialog(playerid,38,DIALOG_STYLE_INPUT,"Название бизнеса","Введите название для своего бизнеса:\n"E"(прим. Нельзя использовать оскорб. слова и рекламу)","Изменить","Отмена");
			}
			if(listitem == 2)
			{
			    if(b_info[p_info[playerid][key]][_lock] == 1)
				{
					b_info[p_info[playerid][key]][_lock] = 0;
					GameTextForPlayer(playerid, "~g~Open", 2000, 5);
					PlayerPlaySound(playerid, 1145, 0.0, 0.0, 0.0);
					return true;
				}
				if(b_info[p_info[playerid][key]][_lock] == 0)
				{
					b_info[p_info[playerid][key]][_lock] = 1;
					GameTextForPlayer(playerid, "~r~Close", 2000, 5);
					PlayerPlaySound(playerid, 1145, 0.0, 0.0, 0.0);
					return true;
				}
			}
			
			
			if(listitem == 3)
			{
				if(b_info[p_info[playerid][key]][_tip] != 4)ShowPlayerDialog(playerid, 50, DIALOG_STYLE_INPUT, "Заказ продуктов для Бизнеса:", ""W"Введите количество продуктов которое желаете заказать(1 п. - 8$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
                else if(b_info[p_info[playerid][key]][_tip] == 4) ShowPlayerDialog(playerid,50, DIALOG_STYLE_INPUT, "Заказ топлива для АЗС:", ""W"Введите количество продуктов которое желаете заказать(1 л. - 2$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
			}
			if(listitem == 4) ShowPlayerDialog(playerid,39,DIALOG_STYLE_INPUT,"Снять деньги со счета","Введите необходимое количество","Снять","Отмена");
			if(listitem == 5) ShowPlayerDialog(playerid,40,DIALOG_STYLE_INPUT,"Положить деньги на счет","Введите необходимое количество","Положить","Отмена");
			if(listitem == 6)
			{
			    if(b_info[p_info[playerid][key]][_zakaz] > 0)return SendClientMessage(playerid, error, "Вы не можете продать бизнес, т.к заказали продукты, откажитесь от заказа"),biz_m(playerid);
			    format(string,sizeof(string),"Цена продажи: %d$\nЕсли вы действительно хотите продать данный бизнес, нажмите "I"Продать",b_info[p_info[playerid][key]][_price]);
				ShowPlayerDialog(playerid,41,DIALOG_STYLE_MSGBOX,"Продажа бизнеса",string,"Продать","Отмена");
			}
			if(listitem == 7)
			{
			   	ShowPlayerDialog(playerid,42,DIALOG_STYLE_INPUT,"Установка цены за 1 л. бензина","Введите cумму которую хотите установить за 1 литр бензина (1-10$)","Установить","Отмена");
			}
			return 1;
		}
		case 38:
		{
		    if(!response) return biz_m(playerid);
		    if(strlen(inputtext) > 24) return SendClientMessage(playerid,error, "Запрещенно вводить больше 24 cимволов"),biz_m(playerid);
		    strmid(b_info[p_info[playerid][key]][_name], inputtext, 0, strlen(inputtext), 255);
		    Update3DTexts();
		}
		case 39:
		{
		    if(!response) return biz_m(playerid);
		    new string[144];
		    if(strval(inputtext) > b_info[p_info[playerid][key]][_bank]) return SendClientMessage(playerid,error,"Недостаточно денег на счету"),biz_m(playerid);
			b_info[p_info[playerid][key]][_bank] -= strval(inputtext);
			set_money(playerid, strval(inputtext));
			format(string,sizeof(string),"Вы сняли со счета %d $",strval(inputtext));
			SendClientMessage(playerid,server,string);
			if(b_info[p_info[playerid][key]][_tip] != 4) ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес","Далее","Отмена");
			else ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес\n"W"Указать цену за 1л. бензина","Далее","Отмена");
			return true;
		}
		case 40:
		{
		    if(!response)return biz_m(playerid);
			new string[144];
		    if(strval(inputtext) > p_info[playerid][cash]) return SendClientMessage(playerid,error,"Недостаточно денег"), ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес","Далее","Отмена");
			b_info[p_info[playerid][key]][_bank] += strval(inputtext);
			set_money(playerid, -strval(inputtext));
			format(string,sizeof(string),"Вы положили на счет %d$",strval(inputtext));
			SendClientMessage(playerid,server,string);
			if(b_info[p_info[playerid][key]][_tip] != 4) ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес","Далее","Отмена");
			else ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес\n"W"Указать цену за 1л. бензина","Далее","Отмена");
			return true;
		}
		case 41:
   		{
         	if(!response)return biz_m(playerid);
		    new string[144];
		    if(b_info[p_info[playerid][key]][_bank] > 0) format(string, sizeof(string), "Дополнительная выручка: %d$",b_info[p_info[playerid][key]][_bank]),SendClientMessage(playerid,info,string),SetPVarInt(playerid, "dopBiz",b_info[p_info[playerid][key]][_bank]);
			b_info[p_info[playerid][key]][_owned] = 0;
			b_info[p_info[playerid][key]][_owner] = 0;
			b_info[p_info[playerid][key]][_cena1] = 0;
			b_info[p_info[playerid][key]][_prod] = 0;
			b_info[p_info[playerid][key]][_bank] = 0;
			set_money(playerid, b_info[p_info[playerid][key]][_price]+GetPVarInt(playerid, "dopBiz"));
			p_info[playerid][key] = -1;
			SendClientMessage(playerid,info,"Вы продали свой бизнес");
			Update3DTexts();
			return true;
		}
		case 42:
		{
		    if(!response)return biz_m(playerid);
		    new string[144];
		    if(strval(inputtext) > 10)
			{
				SendClientMessage(playerid,error,"Сумма не должна превышать 10$ за 1 литр");
				ShowPlayerDialog(playerid,42,DIALOG_STYLE_INPUT,"Установка цены за 1 л. бензина","Введите cумму которую хотите установить за 1 литр бензина (1-10$)","Установить","Отмена");
				return 1;
			}
   			b_info[p_info[playerid][key]][_cena1] = strval(inputtext);
			format(string,sizeof(string),"Вы установили цену за "I"1 литр бензина - %d$",strval(inputtext));
			SendClientMessage(playerid,server,string);
			if(b_info[p_info[playerid][key]][_tip] != 4) ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес","Далее","Отмена");
			else ShowPlayerDialog(playerid,37,DIALOG_STYLE_LIST,""I"Управление бизнесом",""W"Информация о бизнесе\nИзменить название бизнеса\n"I"Открыть "E"Закрыть"W" бизнес\nМеню заказа продуктов/топлива\nСнять деньги со счета\nПоложить деньги на счет\n"E"Продать бизнес\n"W"Указать цену за 1л. бензина","Далее","Отмена");
            Update3DTexts();
			return true;
		}
		case 43:
		{
			if(!response) return 1;
		    switch(listitem)
		    {
				case 0:
				{
					switch(GetPVarInt(playerid, "biz_numb_menu"))
					{
					    case 1:
						{
						    new str[64];
						    if(p_info[playerid][cash] < 500) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(p_info[playerid][phone] == 1) return SendClientMessage(playerid, error, "У Вас уже есть телефон");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 4) return SendClientMessage(playerid, error, "В Магазине не осталось данного товара.");
							p_info[playerid][phone] ++;
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 4;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 500;
							set_money(playerid, -500);
							p_info[playerid][p_number] = RandomEx(100000,999999);
							f(str,"Вы приобрели телефон. Ваш номер: %d",p_info[playerid][p_number]);
							SendClientMessage(playerid, info, str);
						}
						case 3:
						{
						    if(p_info[playerid][cash] < 50) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 4) return SendClientMessage(playerid, error, "В Баре закончилась выпивка.");
						    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_DRINK_BEER);
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 4;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 50;
							set_money(playerid, -50);
							SendClientMessage(playerid, info,"Вы купили бакал Пива");
						}
					}
				}
				case 1:
				{
					switch(GetPVarInt(playerid, "biz_numb_menu"))
					{
						case 1:
						{
                            if(p_info[playerid][cash] < 300) return SendClientMessage(playerid, error, "У Вас не хватает денег");
                            if(b_info[GetPVarInt(playerid, "bID")][_prod] < 2) return SendClientMessage(playerid, error, "В Магазине не осталось данного товара.");
							ShowPlayerDialog(playerid,44,1,"Смена номера","{ffffff}Введите новый номер телефона.\n\nПримечаниe: Номер должен состоять из 4-6 цифр","Изменить","Отмена");
						}
						case 3:
						{
						    if(p_info[playerid][cash] < 60) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 4) return SendClientMessage(playerid, error, "В Баре закончилась выпивка.");
						    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_DRINK_WINE);
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 4;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 60;
							set_money(playerid, -60);
							SendClientMessage(playerid, info,"Вы купили бакал Вина");
						}
					}
				}
				case 2:
				{
					switch(GetPVarInt(playerid, "biz_numb_menu"))
					{
						case 1:
						{
						    if(p_info[playerid][cash] < 150) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(GetPVarInt(playerid, "HEAL") != 0) return SendClientMessage(playerid, error, "У Вас уже есть аптечка");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 4) return SendClientMessage(playerid, error, "В Магазине не осталось данного товара.");
							SetPVarInt(playerid,"HEAL",2);
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 4;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 150;
							set_money(playerid, -150);
							SendClientMessage(playerid,info,"Вы купили аптечку. Количество: 2 штуки");
						}
						case 3:
						{
						    if(p_info[playerid][cash] < 100) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 4) return SendClientMessage(playerid, error, "В Баре закончилась выпивка.");
						    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_DRINK_WINE);
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 4;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 100;
							set_money(playerid, -100);
							SendClientMessage(playerid, info, "Вы купили шот Текилы");
						}
					}
				}
				case 3://строка 4
				{
					switch(GetPVarInt(playerid, "biz_numb_menu"))//тип бизнеса в строке 4
					{
					    case 1:
						{
	                        if(p_info[playerid][cash] < 100) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(GetPVarInt(playerid, "MASK") >= 1) return SendClientMessage(playerid, error, "У Вас уже есть маска");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 3) return SendClientMessage(playerid, error, "В Магазине не осталось данного товара.");
							SetPVarInt(playerid,"MASK",1);
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 3;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 100;
							set_money(playerid, -100);
							SendClientMessage(playerid,info,"Вы купили маску   "W"использовать ее - /mask");
						}
						case 3:
						{
						    if(p_info[playerid][cash] < 120) return SendClientMessage(playerid, error, "У Вас не хватает денег");
						    if(b_info[GetPVarInt(playerid, "bID")][_prod] < 4) return SendClientMessage(playerid, error, "В Баре закончилась выпивка.");
						    SetPlayerSpecialAction(playerid, SPECIAL_ACTION_DRINK_WINE);
							b_info[GetPVarInt(playerid, "bID")][_prod] -= 4;
							b_info[GetPVarInt(playerid, "bID")][_bank] += 120;
							set_money(playerid, -120);
							SendClientMessage(playerid, info, "Вы купили рюмку Водки");
						}
					}
				}
			}
			return 1;
		}
		case 44:
		{
			if(!response) return 1;
			new text[128];
			if(!p_info[playerid][phone]) return MENU_BIZ(playerid,b_info[GetPVarInt(playerid, "bID")][_tip]);
			if(strlen(inputtext) > 6 || strlen(inputtext) < 4) return SendClientMessage(playerid, error, "Номер телефона должен быть от 4 до 6 цифр"),ShowPlayerDialog(playerid,44,1,"Смена номера","{ffffff}Введите новый номер телефона.\n\nПримечаниe: Номер должен состоять из 4-6 цифр","Изменить","Отмена");
            format(text, sizeof(text), "SELECT * FROM `accounts` WHERE `p_number` = '%d'", strval(inputtext));
			mysql_tquery(con_bd, text, "phoneNum", "dd",playerid,strval(inputtext));
			return 1;
		}
		case 46:
		{
			if(response)
			{
			    if(IsPlayerAttachedObjectSlotUsed(playerid,1)) RemovePlayerAttachedObject(playerid,1);// забрали отвертку
			    if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);// забрали отвертку
			    SetPVarInt(playerid,"zavod",1);
			    SetPlayerSkin(playerid, 27);
			    SendClientMessage(playerid,info, "Вы начали работу в Производственном Цеху!");
			    SendClientMessage(playerid,info, "Идите к столу, чтобы начать работу");
				ApplyAnimation(playerid,"INT_SHOP","shop_cashier",4.1,1,0,0,0,1);//    WEAPON_csawlo
				ClearAnimations(playerid);
			}
			return 1;
		}
		case 47:
		{
			if(response)
			{
			    if(IsPlayerAttachedObjectSlotUsed(playerid,1)) RemovePlayerAttachedObject(playerid,1);// забрали отвертку
			    if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);// забрали отвертку
			    SetPVarInt(playerid,"zavod",0);
			    if(p_info[playerid][member] >= 1) SetPlayerSkin(playerid,p_info[playerid][fskin]);
		  		else if(p_info[playerid][member] == 0) SetPlayerSkin(playerid,p_info[playerid][skin]);
				DisablePlayerCheckpoint(playerid);
				//TD_JOB(playerid,3);
				KillTimer(GetPVarInt(playerid, "factory_timer"));
				new string[144];
				set_money(playerid, GetPVarInt(playerid, "kg_zavod")*25);// За 1 мешок дать
				format(string, sizeof(string), "Вы заработали %d$ за изготовление %d продуктов",GetPVarInt(playerid, "kg_zavod")*25,GetPVarInt(playerid, "kg_zavod")/2);
				SendClientMessage(playerid, info, string);
				SetPVarInt(playerid, "kg_zavod",0);
			}
			return 1;
		}
		case 48:
		{
		    if(!response) return RemovePlayerFromVehicle(playerid);
			GetCarDelivery[playerid] = GetPlayerVehicleID(playerid);
			GetVehicleParamsEx(GetCarDelivery[playerid],engine,lights,alarm,doors,bonnet,boot,objective);
   			SetVehicleParamsEx(GetCarDelivery[playerid],engine,lights,alarm,true,bonnet,boot,objective);
			dlv_info[GetCarDelivery[playerid]] = 1;
			SendClientMessage(playerid, error, "Для просмотра заказов используйте: /list");
			return 1;
		}
		case 49:
		{
		    if(!response) return 1;
			EndPlayerCasualJob(playerid);
		}
		case 50:
		{
		    if(!response) return biz_m(playerid);
			if(!strlen(inputtext))
			{
				if(b_info[p_info[playerid][key]][_tip] != 4)ShowPlayerDialog(playerid, 50, DIALOG_STYLE_INPUT, "Заказ продуктов для Бизнеса:", ""W"Введите количество продуктов которое желаете заказать(1 п. - 8$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
                else if(b_info[p_info[playerid][key]][_tip] == 4) ShowPlayerDialog(playerid,50, DIALOG_STYLE_INPUT, "Заказ топлива для АЗС:", ""W"Введите количество продуктов которое желаете заказать(1 л. - 2$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
				return 1;
			}
			if(strval(inputtext) > 1000)
			{
				if(b_info[p_info[playerid][key]][_tip] != 4)ShowPlayerDialog(playerid, 50, DIALOG_STYLE_INPUT, "Заказ продуктов для Бизнеса:", ""W"Введите количество продуктов которое желаете заказать (1 п. - 8$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
                else if(b_info[p_info[playerid][key]][_tip] == 4) ShowPlayerDialog(playerid,50, DIALOG_STYLE_INPUT, "Заказ топлива для АЗС:", ""W"Введите количество продуктов которое желаете заказать(1 л. - 2$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
				return 1;
			}
			if(strval(inputtext) == 0)
			{
				if(b_info[p_info[playerid][key]][_status] == 1) return SendClientMessage(playerid, error, "Данный заказ уже выполняется кем-то, вы не можете его отменить");
			    SendClientMessage(playerid, error, "Вы отменили свой заказ");
                b_info[p_info[playerid][key]][_zakaz] = 0;
                return 1;
			}
			if(strval(inputtext)*((b_info[p_info[playerid][key]][_tip] == 4)?(2):(8)) > b_info[p_info[playerid][key]][_bank])
			{
				 SendClientMessage(playerid, error, "На счету вашего бизнеса не хватает денег для заказа");
				 if(b_info[p_info[playerid][key]][_tip] != 4)ShowPlayerDialog(playerid, 50, DIALOG_STYLE_INPUT, "Заказ продуктов для Бизнеса:", ""W"Введите количество продуктов которое желаете заказать (1 п. - 8$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
             	 else if(b_info[p_info[playerid][key]][_tip] == 4) ShowPlayerDialog(playerid,50, DIALOG_STYLE_INPUT, "Заказ топлива для АЗС:", ""W"Введите количество продуктов которое желаете заказать(1 л. - 2$):\n\n"E"Примечание: не меньше 50 не больше 1000\n(для отказа от заказа введите '0')", "Заказ", "Назад");
				 return 1;
			}
			if(b_info[p_info[playerid][key]][_status] == 1) return SendClientMessage(playerid, error, "Данный заказ уже выполняется кем-то, вы не можете его отменить");
			b_info[p_info[playerid][key]][_zakaz] = strval(inputtext);
			new str[128];
			if(b_info[p_info[playerid][key]][_tip] != 4) f(str,"Вы заказали %d продуктов в Ваш бизнес, на сумму: %d$  "E"( Отменить заказ введите откройте окно заказа и введите '0' )",strval(inputtext),strval(inputtext)*8);
            else if(b_info[p_info[playerid][key]][_tip] == 4)  f(str,"Вы заказали %d продуктов на вашу АЗС на сумму: %d$ "E"( Отменить заказ введите откройте окно заказа и введите '0' )",strval(inputtext),strval(inputtext)*2);
			SendClientMessage(playerid, info, str);
			return 1;
        }
		case 51:
		{
		    if(response)
		    {
                new str[164];
		        for(new i;i<22;i++)
		        {
		            if(listitem==i)
					{
						if(b_info[DBizitem[playerid][i]][_status] == 1) return SendClientMessage(playerid, error, "Данный заказ уже выполняется кем-то"),list_delivery(playerid);
						b_info[DBizitem[playerid][i]][_status] = 1;
						SetPlayerRaceCheckpoint(playerid,1,b_info[DBizitem[playerid][i]][b_enter][0],b_info[DBizitem[playerid][i]][b_enter][1],b_info[DBizitem[playerid][i]][b_enter][2],0.0,0.0,0.0,10.0);
						f(str, "Вы приняли заказ "W"'%s [%d], заработок %d$'"I" загрузите продукты на заводе и отправляйтесь на контрольную точку",b_info[DBizitem[playerid][i]][_name],DBizitem[playerid][i],b_info[DBizitem[playerid][i]][_zakaz]*6);
						SendClientMessage(playerid, info, str);
						SetPVarInt(playerid, "biz_zakaz",DBizitem[playerid][i]);//выдали ид биза игроку для проверки на чекпоинт
						SetPVarInt(playerid, "zakaz",b_info[DBizitem[playerid][i]][_zakaz]);//кол-во материала для доставк
					}
		        }
		    }
		}
		case 52:
		{
		    if(!response) return 1;
		    if(GetPVarInt(playerid, "biz_zakaz") != -1)
			{
				b_info[GetPVarInt(playerid, "biz_zakaz")][_status] = 0,SetPVarInt(playerid, "biz_zakaz",-1);
				foreach(Player, i) if(p_info[i][job] == 3) SendClientMessage(i, server, "Доступен новый заказ (/list)");
			}
		    if(loadCar[GetCarDelivery[playerid]] > 0)
		    {
				new str[128];
				f(str, "Вы не доставили груз! С вас списан штраф в размере %d$",fine);
			    SendClientMessage(playerid, error, str);
			    set_money(playerid, -fine);
			}
			SetPVarInt(playerid, "biz_zakaz", -1);
			SetPVarInt(playerid, "zakaz",0);
			return SendClientMessage(playerid, error, "Вы отменили заказ. (взять новый /list)");
		}
		case 56:
		{
		    if(!response) return RemovePlayerFromVehicle(playerid);
		    if(p_info[playerid][cash] < rent_taxi)
			{
			    new str[128];
				f(str, "У Вас не достаточно денег. Нужно %d$",rent_taxi);
			    SendClientMessage(playerid, error, str);
				return RemovePlayerFromVehicle(playerid);
			}
	   		set_money(playerid,-rent_taxi);
			SendClientMessage(playerid, info, "Для того, чтобы начать работу водителя такси нажмите 2");
			GetPlayerRentTaxi[playerid] = GetPlayerVehicleID(playerid);
			//(GetPlayerRentTaxi[playerid],engine,lights,alarm,doors,bonnet,boot,objective);
		    //SetVehicleParamsEx(GetPlayerRentTaxi[playerid],engine,lights,alarm,true,bonnet,boot,objective);
			taxi_info[GetPlayerRentTaxi[playerid]] = 1;
			return 1;
		}
		case 57:
		{
		    if(!response) return 1;
		    new string[84];
		    if(GetPVarInt(playerid, "@startJob") == 1) return EndPlayerCasualJob(playerid);
			if(!strlen(inputtext)) return ShowPlayerDialog(playerid, 57, 1, "Cтоимость проезда", ""W"Укажите стоимость проезда\nУкажите цену (1$ - 500$)","Далее", "Закрыть");
			if(strval(inputtext) < 1 || strval(inputtext) > 500) return ShowPlayerDialog(playerid, 57, 1, "Cтоимость проезда", ""W"Укажите стоимость проезда\nУкажите цену (1$ - 500$)","Далее", "Закрыть");
			SetPVarInt(playerid, "@payment", strval(inputtext));
		    SetPVarInt(playerid, "@passanger", 0);
		    SetPVarInt(playerid, "@startJob",1);
   			format(string, sizeof(string), "Такси\nСтоимость проезда: "W"%d$", GetPVarInt(playerid, "@payment"));
			INFO_VEH[GetPlayerRentTaxi[playerid]] = CreateDynamic3DTextLabel(string, info, 0.0, 0.0, 1.0, 30.0, INVALID_PLAYER_ID, GetPlayerRentTaxi[playerid], 1);
			SendClientMessage(playerid, info, "Вы начали работу водителем такси, для принятия заказов используйте - /to");
		}
		case 59:
		{
		    new string[256];
		    if(!response) return 1;
		    if(listitem == 0) f(string, ""W"Добрый день!\n"I"На вашем банковском счету: %d$\n\n"W"Для того чтобы положить или снять деньги\nсо счета, введите сумму в строке ввода и нажмите\nвыбраную операцию\n"E"(прим. для закрытия диалога оставьте поле пустым и нажмите ENTER)",p_info[playerid][bank]),
			ShowPlayerDialog(playerid, 60, 1,"Операция со счетом", string, "Положить","Снять");
			if(listitem == 1) f(string, ""W"Добрый день!\n"I"На вашем банковском счету: %d$\n\n"W"Для того чтобы перевести денежные средства\nна друго счет введите ID игрока",p_info[playerid][bank]),
			ShowPlayerDialog(playerid, 61, 1,"Перевод денег", string, "Перевод","Закрыть");
			if(listitem == 2)
			{
			    if(p_info[playerid][keyh] == 60635) return SendClientMessage(playerid, error, "Вы не владеете домом");
				f(string, ""W"Дом оплачен на "A"%d "W"дней (%d$ в день)\nВведите количество дней\nна сколько хотите продлить квартирную плату:",h_info[p_info[playerid][keyh]][h_rent],h_info[p_info[playerid][keyh]][h_squar]*200);
			    ShowPlayerDialog(playerid, 108,1,"Оплата жилья",string,"Оплатить","Отмена");
			}
			if(listitem == 3)
			{
			    if(p_info[playerid][key] == -1) return SendClientMessage(playerid, error, "Вы не владеете бизнесом!");
				f(string, ""W"Бизнес оплачен на "A"%d "W"дней (300$ в день)\nВведите количество дней\nна сколько хотите продлить аренду:",b_info[p_info[playerid][key]][_colvo]);
			    ShowPlayerDialog(playerid, 109,1,"Оплата аренды",string,"Оплатить","Отмена");
			}
		}
		case 60:
		{
		    if(!response)
		    {
		        new string[244];
				if(!strlen(inputtext)) return 1;
				if(p_info[playerid][bank] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько денег на банковском счету");
				if(strval(inputtext) < 1 || strval(inputtext) > 10000000) return SendClientMessage(playerid, error, "Нельзя снять менее $1 или более $10.000.000");
				set_money(playerid,strval(inputtext));
				p_info[playerid][bank] -= strval(inputtext);
				format(string, sizeof(string), "Вы сняли со счета: "A"$%d$"W" (Остаток: "A"%d$"W")",strval(inputtext),p_info[playerid][bank]);
				SendClientMessage(playerid, white, string);
				return true;
			}
			else
		    {
		        new string[244];
				if(!strlen(inputtext)) return 1;
				if(p_info[playerid][cash] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько денег");
				if(p_info[playerid][cash] < 1 || p_info[playerid][cash] > 10000000) return SendClientMessage(playerid, error, "Нельзя положить менее $1 или более $10.000.000");
				set_money(playerid,-strval(inputtext));
				p_info[playerid][bank] += strval(inputtext);
				format(string, sizeof(string), "Вы положили на счет: "A"%d$"W" (Баланс: "A"%d$"W")",strval(inputtext),p_info[playerid][bank]);
				SendClientMessage(playerid, white, string);
			}
		}
		case 61:
		{
			if(response)
			{
			    new string[256];
				if(strlen(inputtext) == 0) return f(string, ""W"Добрый день!\n"I"На вашем банковском счету: %d$\n\n"W"Для того чтобы перевести денежные средства на другой счет, введите ID игрока:",p_info[playerid][bank]),ShowPlayerDialog(playerid, 61, 1,"Операция со счетом", string, "Перевод","Закрыть");
                if(!IsPlayerConnected(strval(inputtext))) return SendClientMessage(playerid, error, "Игрок с таким ID не найден");
				SetPVarInt(playerid, "ID_TRANS",strval(inputtext));
				format(string,sizeof(string), ""W"Введите сумму которую вы хотите передать "A"%s", get_name( GetPVarInt(playerid, "ID_TRANS") ) );
				ShowPlayerDialog(playerid,62,DIALOG_STYLE_INPUT,"Перевод",string,"Далее","Назад");
				return true;
			}
			else return ShowPlayerDialog(playerid,59,DIALOG_STYLE_TABLIST,"Банк","Операция со счетом\tПоложить/Снять\nПеревести деньги\n"E"Заплатить за дом\n"E"Заплатить за аренду бизнеса","Выбор","Отмена");
		}
		case 62:
		{
		    new string[156];
			if(!response) return 1;
			if(!strlen(inputtext))
			{
    			f(string, ""W"Добрый день!\n"I"На вашем банковском счету: "A"%d$\n\n"W"Введите сумму которую вы хотите передать "I"%s",get_name(GetPVarInt(playerid, "ID_TRANS"))),
				ShowPlayerDialog(playerid, 62, 1,"Операция со счетом", string, "Перевод","Закрыть");
			}
			if(strval(inputtext) < 100 || strval(inputtext) > 10000000)
			{
				SendClientMessage(playerid, error, "Минимальная сумма $1000, максимальная $10.000.000");
				f(string, ""W"Добрый день!\n"I"На вашем банковском счету: "A"%d$\n\n"W"Введите сумму которую вы хотите передать "I"%s",get_name(GetPVarInt(playerid, "ID_TRANS"))),
				ShowPlayerDialog(playerid, 62, 1,"Операция со счетом", string, "Перевод","Закрыть");
			}
			if(p_info[playerid][bank] < strval(inputtext)) return SendClientMessage(playerid, error, "Недостаточно средств на банковском счету!");
			if(IsPlayerConnected(GetPVarInt(playerid, "ID_TRANS")))
			{
				p_info[playerid][bank] -= strval(inputtext);
				p_info[GetPVarInt(playerid, "ID_TRANS")][bank] += strval(inputtext);
				format(string, sizeof(string), "Сообщение от банка: "A"%s"W" перевел(а) вам "A"%d$"W" на банковский счет",get_name(playerid),strval(inputtext));
				SendClientMessage(GetPVarInt(playerid, "ID_TRANS"), info, string);
				format(string, sizeof(string), ""W"Отправитель:\t\t\t %s\nПолучатель:\t\t\t %s\nСумма перевода:\t\t "A"%d$\n"W"Остаток на Вашем счете:\t"I" %d$",get_name(playerid), get_name(GetPVarInt(playerid, "ID_TRANS")), strval(inputtext),p_info[playerid][bank]);
				ShowPlayerDialog(playerid,0000,0,""A"Перевод успешно выполнен",string,"Готово","");
				SetPVarInt(playerid, "ID_TRANS",INVALID_PLAYER_ID);
			}
			else return SendClientMessage(playerid,error,"Произашел сбой, игрок вышел из сети");
		}
		case 65:
		{
		    if(!response) return 1;
		    switch(listitem)
		    {
		            case 0:
					{
						new string[64];
						mysql_format(con_bd,string,sizeof(string),"SELECT * FROM `accounts` WHERE `member` = '%d'",p_info[playerid][member]),mysql_tquery(con_bd, string, "members_offline", "d",playerid);
					}
					case 1: ShowPlayerDialog(playerid, 66, DIALOG_STYLE_INPUT, "Панель лидера: Увольнение", "Для увольнения члена вашей организации введите его имя в поле ниже:", "Уволить", "Закрыть");
		    }
		}
		case 66:
		{
		    if(!response) return 1;
		    if(!strlen(inputtext)) return ShowPlayerDialog(playerid, 66, DIALOG_STYLE_INPUT, "ПУ Лидера - Увольнение", "Для увольнения члена вашей организации введите его имя в поле ниже:", "Уволить", "Закрыть");
		    new qstring[84];
		    new player_name[MAX_PLAYER_NAME];
			for(new i = GetMaxPlayers(); i != -1; i--)
			{
				if(!IsPlayerConnected(i)) continue;
				GetPlayerName(i, player_name, MAX_PLAYER_NAME);
				if(!strcmp(inputtext, player_name, false)) return SendClientMessage(playerid, error, "Данный игрок в сети, используйте: /uninvite");
			}
		    format(qstring,sizeof(qstring), "SELECT * FROM accounts WHERE `name`='%s'", inputtext);
		    mysql_tquery(con_bd, qstring, "leave_offline", "is", playerid, inputtext);
		}
		case 69:
		{
		    if(!response) return 1;
		    if(listitem == 0)  ShowPlayerDialog(playerid,71, DIALOG_STYLE_LIST, "Выберите оружие:", "1. Дубинка\n2. Бронижелет\n3. Desert Eagle\n4. Silenced 9mm\n5. MP5\n6. Щит\n7. Снайперская винтовка", "Применить", "Отмена");
			if(listitem == 1)  ShowPlayerDialog(playerid,70, DIALOG_STYLE_LIST, "Выберите прикрытие:", "Groove Street\nThe Ballas\nLos Santos Vagos\nThe Rifa\nEl`Corona\nLa Cosa Nostra\nYakuza\nРусская Мафия\n - Вернуть свой", "Применить", "Отмена");
		}
		case 70:
		{
			if(!response) return 1;
			switch(listitem)
			{
				case 0: SetPlayerSkin(playerid,107),SendClientMessage(playerid,-1,"Вы получили прикрытие `Grove St.`");
				case 1: SetPlayerSkin(playerid,103),SendClientMessage(playerid,-1,"Вы получили прикрытие `The Ballas`");
				case 2: SetPlayerSkin(playerid,109),SendClientMessage(playerid,-1,"Вы получили прикрытие `Los Santos Vagos`");
				case 3: SetPlayerSkin(playerid,175),SendClientMessage(playerid,-1,"Вы получили прикрытие `The Rifa`");
				case 4: SetPlayerSkin(playerid,114),SendClientMessage(playerid,-1,"Вы получили прикрытие `El`Corona`");
				case 5: SetPlayerSkin(playerid,127),SendClientMessage(playerid,-1,"Вы получили прикрытие `La Cosa Nostra`");
				case 6: SetPlayerSkin(playerid,123),SendClientMessage(playerid,-1,"Вы получили прикрытие `Yakuza`");
				case 7: SetPlayerSkin(playerid,112),SendClientMessage(playerid,-1,"Вы получили прикрытие `Русская Мафия`");
				case 8: SetPlayerSkin(playerid,p_info[playerid][fskin]);
			}
		}
		case 71:
		{
			if(!response) return 1;
			switch(listitem)
			{
				case 0: GivePlayerWeapon(playerid,3,1),SendClientMessage(playerid,-1,"Вы получили Дубинку");
				case 1: SetPlayerArmour(playerid,100),SendClientMessage(playerid,-1,"Вы получили Бронижилет");
				case 2: GivePlayerWeapon(playerid,24,30),SendClientMessage(playerid,-1,"Вы получили Desert Eagle");
				case 3: GivePlayerWeapon(playerid,23,60),SendClientMessage(playerid,-1,"Вы получили Silenced 9mm");
				case 4: GivePlayerWeapon(playerid,29,150),SendClientMessage(playerid,-1,"Вы получили MP5");
				case 5: SetPlayerAttachedObject(playerid, 6, 18637, 14, 0.0, 0.0, 0.0, 0.0, 180.0, 180.0),SendClientMessage(playerid,-1,"Вы получили Щит. (Убрать его - /offset)");
				case 6: GivePlayerWeapon(playerid,34,10),SendClientMessage(playerid,-1,"Вы получили Снайперскую винтовку");
			}
		}
		case 73:
        {
            if(!response) return 1;
            if(listitem == 0) ShowPlayerDialog(playerid, 74, DIALOG_STYLE_LIST, "Анимации оружия", "1 - Узи 1\n2 - Узи 2\n3 - Узи 3\n4 - Пистолет 1\n5 - Пистолет 2\n6 - Пистолет 3 \n7 - Пистолет 4\n8 - Меч 1\n9 - Меч 2\n10 - Меч 3\n11 - Меч 4\n12 - Меч 5\n13 - Меч 6\n14 - Меч 7\n15 - Меч 8\n16 - Меч 9\n17 - Меч 10", "Выбрать", "Назад");
            else if(listitem == 1) ShowPlayerDialog(playerid, 75, DIALOG_STYLE_LIST, "Анимации пищеварения", "1 - Ест 1\n2 - Ест 2\n3 - Ест 3(1/2)\n4 - Ест 4(2/2)\n5 - Пьет 1\n6 - Пьет 2", "Выбрать", "Назад");
            else if(listitem == 2) ShowPlayerDialog(playerid, 76, DIALOG_STYLE_LIST, "Анимации ранения", "1 - Ранение 1\n2 - Ранение 2\n3 - Ранение 3\n4 - Ранение 4", "Выбрать", "Назад");
            else if(listitem == 3) ShowPlayerDialog(playerid, 77, DIALOG_STYLE_LIST, "Анимации SWAT", "1 - Swat 1\n2 - Swat 2\n3 - Swat 3\n3 - Swat 3\n4 - Swat 4\n5 - Swat 5\n6 - Swat 6\n7 - Swat 7\n8 - Swat 8\n9 - Swat 9\n10 - Swat 10\n11 - Swat 11\n12 - Swat 12\n13 - Swat 13\n14 - Swat 14\n15 - Swat 15\n16 - Swat 16\n16 - Swat 16\n17 - Swat 17\n18 - Swat 18\n19 - Swat 19\n20 - Swat 20\n21 - Swat 21\n22 - Swat 22", "Выбрать", "Назад");
            else if(listitem == 4) ShowPlayerDialog(playerid, 78, DIALOG_STYLE_LIST, "Анимации передазировки", "1 - Нарк 1\n2 - Нарк 2\n3 - Нарк 3\n4 - Нарк 4\n5 - Нарк 5\n6 - Нарк 6\n7 - Нарк 7\n8 - Нарк 8", "Выбрать", "Назад");
            else if(listitem == 5) ShowPlayerDialog(playerid, 79, DIALOG_STYLE_LIST, "Анимации Сесть/Лежать", "1 - Сесть 1\n2 - Сесть 2\n3 - Сесть 3\n4 - Сесть 4\n5 - Лечь 5\n6 - Лечь 6\n7 - Лечь 7\n8 - Лечь 8", "Выбрать", "Назад");
            else if(listitem == 6) ShowPlayerDialog(playerid, 80, DIALOG_STYLE_LIST, "Анимации танцев", "1 - Танец 1\n2 - Танец 2\n3 - Танец 3\n4 - Танец 4\n5 - Танец 5\n6 - Танец 6\n7 - Танец 7\n8 - Танец 8\n9 - Танец 9", "Выбрать", "Назад");
            else if(listitem == 7) ShowPlayerDialog(playerid, 81, DIALOG_STYLE_LIST, "Анимации жестов", "1 - Машет рукой\n2 - Машет руками 1 \n3 - Машет руками 2\n4 - Жест 1\n5 - Жест 2\n6 - Жест 3\n7 - Жест 4", "Выбрать", "Назад");
            else if(listitem == 8) ShowPlayerDialog(playerid, 82, DIALOG_STYLE_LIST, "Прочие Анимации", "1 - Руки вверх!\n2 - Курить\n3 - Возмущение\n4 - Зевать\n5 - Диллер 1 \n6 - Диллер 2\n7 - Диллер 3\n8 - Диллер 4", "Выбрать", "Назад");
        }
        case 81:
        {
            if(!response) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) ApplyAnimation( playerid, "RYDER", "RYD_Beckon_01", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 1) ApplyAnimation( playerid, "RYDER", "RYD_Beckon_02", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 2) ApplyAnimation( playerid, "RYDER", "RYD_Beckon_03", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 3) ApplyAnimation( playerid, "RIOT", "RIOT_FUKU", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 4) ApplyAnimation( playerid, "RIOT", "RIOT_CHANT", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 5) ApplyAnimation( playerid, "RIOT", "RIOT_CHALLENGE", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 6) ApplyAnimation( playerid, "RIOT", "RIOT_ANGRY", 4.1, 0, 1, 1, 1, 0 ,1);
            SetPVarInt(playerid, "ANIM",1);
        }
        case 82:
        {
            if(!response) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) SetPlayerSpecialAction (playerid, SPECIAL_ACTION_HANDSUP);
            else if(listitem == 1) ApplyAnimation(playerid, "SMOKING", "M_smklean_loop",4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 2) ApplyAnimation(playerid, "PED", "fucku",4.0,0,0,0,0,0,1);
            else if(listitem == 3) ApplyAnimation(playerid, "GANGS", "smkcig_prtl",4.1,0,1,1,1,1,1);
            else if(listitem == 4) ApplyAnimation( playerid, "DEALER", "DEALER_DEAL", 4.1, 0, 1, 1, 1, 1 ,1);
            else if(listitem == 5) ApplyAnimation( playerid, "DEALER", "DEALER_IDLE_01", 4.1, 0, 1, 1, 1, 1 ,1);
            else if(listitem == 6) ApplyAnimation( playerid, "DEALER", "DEALER_IDLE_03", 4.1, 0, 1, 1, 1, 1 ,1);
            else if(listitem == 7) ApplyAnimation( playerid, "DEALER", "DRUGS_BUY", 4.1, 0, 1, 1, 1, 1 ,1);
            SetPVarInt(playerid, "ANIM",1);
        }
        case 80:
        {
            if(!response) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) SetPlayerSpecialAction (playerid, SPECIAL_ACTION_DANCE1);
            else if(listitem == 1) SetPlayerSpecialAction (playerid, SPECIAL_ACTION_DANCE2);
            else if(listitem == 2) SetPlayerSpecialAction (playerid, SPECIAL_ACTION_DANCE3);
            else if(listitem == 3) SetPlayerSpecialAction (playerid, SPECIAL_ACTION_DANCE4);
            else if(listitem == 4) ApplyAnimation( playerid, "DANCING", "DAN_Loop_A", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 5) ApplyAnimation( playerid, "DANCING", "DAN_Left_A", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 6) ApplyAnimation( playerid, "DANCING", "DAN_Down_A", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 7) ApplyAnimation( playerid, "DANCING", "dnce_M_b", 4.1, 0, 1, 1, 1, 0 ,1);
            else if(listitem == 8) ApplyAnimation( playerid, "DANCING", "dnce_M_a", 4.1, 0, 1, 1, 1, 0 ,1);
            SetPVarInt(playerid, "ANIM",1);
        }
        case 79:
        {
            if(!response) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) ApplyAnimation( playerid, "INT_HOUSE", "LOU_Loop", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 1) ApplyAnimation( playerid, "INT_HOUSE", "LOU_In", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 2) ApplyAnimation( playerid, "WEAPONS", "SHP_G_LIFT_IN", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 3) ApplyAnimation( playerid, "WEAPONS", "SHP_AR_RET", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 4) ApplyAnimation( playerid, "INT_HOUSE", "BED_In_L", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 5) ApplyAnimation( playerid, "INT_HOUSE", "BED_In_R", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 6) ApplyAnimation( playerid, "INT_HOUSE", "BED_Loop_L", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 7) ApplyAnimation( playerid, "INT_HOUSE", "BED_Loop_R", 4.1, 0, 1, 1, 1, 1 );
            SetPVarInt(playerid, "ANIM",1);
        }
        case 78:
        {
            if(!response) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) ApplyAnimation( playerid, "CRACK", "CRCKIDLE4", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 1) ApplyAnimation( playerid, "CRACK", "CRCKIDLE3", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 2) ApplyAnimation( playerid, "CRACK", "CRCKIDLE2", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 3) ApplyAnimation( playerid, "CRACK", "CRCKIDLE1", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 4) ApplyAnimation( playerid, "CRACK", "CRCKDETH4", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 5) ApplyAnimation( playerid, "CRACK", "CRCKDETH3", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 6) ApplyAnimation( playerid, "CRACK", "CRCKDETH2", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 7) ApplyAnimation( playerid, "CRACK", "CRCKDETH1", 4.1, 1, 1, 1, 1, 1 );
            SetPVarInt(playerid, "ANIM",1);
        }
        case 76:
        {
            if(!response) return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) ApplyAnimation( playerid, "SWEET", "SWEET_INJUREDLOOP", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 1) ApplyAnimation( playerid, "SWEET", "LAFIN_SWEET", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 2) ApplyAnimation( playerid, "RYDER", "RYD_Die_PT1", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 3) ApplyAnimation( playerid, "RYDER", "RYD_Die_PT2", 4.1, 0, 1, 1, 1, 1 );
            SetPVarInt(playerid, "ANIM",1);
        }
        case 75:
        {
            if(!response)return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) ApplyAnimation( playerid, "VENDING", "VEND_EAT_P", 4.1, 0, 1, 1, 1, 1 );
           	else if(listitem == 1) ApplyAnimation( playerid, "VENDING", "VEND_EAT1_P", 4.1, 0, 1, 1, 1, 1 );
           	else if(listitem == 2) ApplyAnimation( playerid, "VENDING", "VEND_USE", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 3) ApplyAnimation( playerid, "VENDING", "VEND_USE_PT2", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 4) ApplyAnimation( playerid, "VENDING", "VEND_DRINK_P", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 5) ApplyAnimation( playerid, "VENDING", "VEND_DRINK2_P", 4.1, 0, 1, 1, 1, 1 );
            SetPVarInt(playerid, "ANIM",1);
        }
        case 74:
        {
            if(!response)return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
            if(listitem == 0) ApplyAnimation( playerid, "UZI", "UZI_RELOAD", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 1) ApplyAnimation( playerid, "UZI", "UZI_FIRE_POOR", 4.1, 0, 1, 1, 1, 1 ); 
            else if(listitem == 2) ApplyAnimation( playerid, "UZI", "UZI_CROUCHFIRE", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 3) ApplyAnimation( playerid, "COLT45", "SAWNOFF_RELOAD", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 4) ApplyAnimation( playerid, "COLT45", "COLT45_RELOAD", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 5) ApplyAnimation( playerid, "COLT45", "COLT45_FIRE_2HANDS", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 6) ApplyAnimation( playerid, "COLT45", "2GUNS_CROUCHFIRE", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 7) ApplyAnimation( playerid, "SWORD", "SWORD_IDLE", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 8) ApplyAnimation( playerid, "SWORD", "SWORD_1", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 9) ApplyAnimation( playerid, "SWORD", "SWORD_2", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 10) ApplyAnimation( playerid, "SWORD", "SWORD_3", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 11) ApplyAnimation( playerid, "SWORD", "SWORD_4", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 12) ApplyAnimation( playerid, "SWORD", "SWORD_BLOCK", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 13) ApplyAnimation( playerid, "SWORD", "SWORD_HIT_1", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 14) ApplyAnimation( playerid, "SWORD", "SWORD_HIT_2", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 15) ApplyAnimation( playerid, "SWORD", "SWORD_HIT_3", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 16) ApplyAnimation( playerid, "SWORD", "SWORD_PART", 4.1, 0, 1, 1, 1, 1 );
            SetPVarInt(playerid, "ANIM",1);
        }
        case 77:
        {
            if(!response)return ShowPlayerDialog(playerid, 73, DIALOG_STYLE_LIST, "Анимации", " - Анимации оружия\n- Анимации пищеварения\n - Анимации ранений\n - Анимации SWAT\n - Анимации передазировки \n - Сесть/Лечь \n - Анимации Танцев\n - Жесты\n - Прочие Анимации", "Выбрать", "Отмена");
			if(listitem == 0) ApplyAnimation( playerid, "SWAT", "gnstwall_injurd", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 1) ApplyAnimation( playerid, "SWAT", "JMP_Wall1m_180", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 2) ApplyAnimation( playerid, "SWAT", "Rail_fall", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 3) ApplyAnimation( playerid, "SWAT", "Rail_fall_crawl", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 4) ApplyAnimation( playerid, "SWAT", "swt_breach_01", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 5) ApplyAnimation( playerid, "SWAT", "swt_breach_02", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 6) ApplyAnimation( playerid, "SWAT", "swt_breach_03", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 7) ApplyAnimation( playerid, "SWAT", "swt_go", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 8) ApplyAnimation( playerid, "SWAT", "swt_lkt", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 9) ApplyAnimation( playerid, "SWAT", "swt_sty", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 10) ApplyAnimation( playerid, "SWAT", "swt_vent_01", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 11) ApplyAnimation( playerid, "SWAT", "swt_vent_02", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 11) ApplyAnimation( playerid, "SWAT", "swt_vnt_sht_in", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 12) ApplyAnimation( playerid, "SWAT", "swt_vnt_sht_loop", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 13) ApplyAnimation( playerid, "SWAT", "swt_vnt_sht_die", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 14) ApplyAnimation( playerid, "SWAT", "swt_wllpk_L_back", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 15) ApplyAnimation( playerid, "SWAT", "swt_wllpk_L", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 16) ApplyAnimation( playerid, "SWAT", "swt_wllshoot_in_L", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 17) ApplyAnimation( playerid, "SWAT", "swt_wllshoot_out_L", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 18) ApplyAnimation( playerid, "SWAT", "swt_wllpk_R_back", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 19) ApplyAnimation( playerid, "SWAT", "swt_wllpk_R", 4.1, 0, 1, 1, 1, 1 );
            else if(listitem == 20) ApplyAnimation( playerid, "SWAT", "swt_wllshoot_in_R", 4.0, 1, 1, 1, 1, 1 );
            else if(listitem == 21) ApplyAnimation( playerid, "SWAT", "swt_wllshoot_out_R", 4.0, 1, 1, 1, 1, 1 );
            SetPVarInt(playerid, "ANIM",1);
        }
   		case 84:
		{
			if (!response) return 1;
			if(listitem == 0) ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
			if(listitem == 1) ShowPlayerDialog(playerid, 86,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
		}
		case 85:
		{
			new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(strval(inputtext) < 1 || strval(inputtext) > 20) return SendClientMessage(playerid, error, "Вы не можете взять меньше 1 и больше 20 материалов"),ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(p_info[playerid][material]+strval(inputtext) > 20) return SendClientMessage(playerid, error, "Вы не можете взять больше 20 материалов"),ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(strval(inputtext) > army_material) return SendClientMessage(playerid,error,"Такого количества материалов нет на складе"),ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				army_material -= strval(inputtext);
				p_info[playerid][material] += strval(inputtext);
				format(string, sizeof(string), "Вы взяли со склада %d материалов",strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "W"%s взял %d материалов", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 материала"),ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(p_info[playerid][material] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько материалов"),ShowPlayerDialog(playerid, 85,1,"Положить/взять материалы",""W"Для того чтобы положить или взять материалы со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				army_material += strval(inputtext);
				p_info[playerid][material] -= strval(inputtext);
				format(string, sizeof(string), "Вы положили на склад %d материалов",strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "W"%s положил %d материалов на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 86:
		{
			new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return 1;
				if(strval(inputtext) < 1 || strval(inputtext) > 200) return SendClientMessage(playerid, error, "Вы не можете взять меньше 1 и больше 200 патрон"),ShowPlayerDialog(playerid, 86,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(p_info[playerid][patr]+strval(inputtext) > 200) return SendClientMessage(playerid, error, "Вы не можете взять больше 200 патрон"),ShowPlayerDialog(playerid, 86,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(strval(inputtext) > army_patr) return SendClientMessage(playerid,error,"Такого количества патрон нет на складе"),ShowPlayerDialog(playerid, 86,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				army_patr -= strval(inputtext);
				p_info[playerid][patr] += strval(inputtext);
				format(string, sizeof(string), "Вы взяли со склада %d патрон",strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "W"%s взял %d патрон со склада", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 патрона"),ShowPlayerDialog(playerid, 86,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				if(p_info[playerid][patr] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько патрон"),ShowPlayerDialog(playerid, 86,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
				army_patr += strval(inputtext);
				p_info[playerid][patr] -= strval(inputtext);
				format(string, sizeof(string), "Вы положили на склад %d патрон",strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "W"%s положил %d патрон на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 90:
		{
			if(!response) return 1;
		    new string[124];
	        if(strlen(inputtext) == 0) return ShowPlayerDialog(playerid,45,DIALOG_STYLE_INPUT,"Подача объявления","Введите текст вашего объявления:\n\n(прим. объявление будет подано после проверки)","Назад","Закрыть");
	        if(ADVERTISE != INVALID_PLAYER_ID) return SendClientMessage(playerid,error, "Кто-то уже подал объявление");
	        if(p_info[playerid][cash] < 50) return SendClientMessage(playerid, error,  "Для подачи объявления требуется 50$");
	        SendClientMessage(playerid,error,"Ваше объявление было отправлено редакторам для утверждения");
	        format(string, sizeof(string), "[Новое объявление] Автор: %s[%d] Текст: %s",get_name(playerid), playerid,inputtext);
	        SendFamilyMessage(6, info, string);
	        set_money(playerid, -50);
			ADVERTISE = playerid;
	        strmid(msg_adv, inputtext, 0, strlen(inputtext), 255);
	        return 1;
		}
		case 91:
        {
            new texts[160];
        	if(response)
            {
                new sscanfs[124],sscanfs2[124];
                if(strlen(inputtext) == 0)
                {
                     f(texts, "Обьявление: %s. Прислал(а): %s[%d]", msg_adv, get_name(ADVERTISE),ADVERTISE),SendClientMessageToAll(0x34c924ff,texts);
                     f(texts, "Объявление проверил: %s[%d]", get_name(playerid),playerid),SendClientMessageToAll(0x0bda51ff,texts);
                     ADVERTISE = 555;
                     return 1;
                }
                else if(strfind(inputtext, "=", true) == -1)
				{
				    f(texts, "Обьявление: %s. Прислал(а): %s[%d]",(inputtext), get_name(ADVERTISE),ADVERTISE),SendClientMessageToAll(0x34c924ff,texts);
	                f(texts, "Объявление отредактировал: %s[%d]", get_name(playerid),playerid),SendClientMessageToAll(0x0bda51ff,texts);
	                ADVERTISE = 555;
	                return 1;
				}
				else
				{
	                sscanf(inputtext, "p<=>s[123]s[123]",sscanfs,sscanfs2);
					new ins = strfind(msg_adv,sscanfs);
					if ins == -1*then return 1;
					strdel(msg_adv, ins, ins+strlen(sscanfs));
				    strins(msg_adv, sscanfs2,ins,sizeof(msg_adv));
	                f(texts,"Обьявление: %s. Прислал(а): %s[%d]",msg_adv, get_name(ADVERTISE),ADVERTISE),SendClientMessageToAll(0x34c924ff,texts);
	                f(texts,"Объявление отредактировал: %s[%d]", get_name(playerid),playerid),SendClientMessageToAll(0x0bda51ff,texts);
	                ADVERTISE = 555;
				}
            }
            else
            {
				SendClientMessage(playerid, error, "Вы отклонили объявление");
                f(texts, "%s[%d] отклонил обьявление. Причина: %s",get_name(playerid), playerid, (inputtext));
				SendFamilyMessage(2, -1, texts);
                f(texts, "%s[%d] отклонил обьявление. Причина: %s",get_name(playerid), playerid, (inputtext));
				SendClientMessage(ADVERTISE, -1, texts);
				ADVERTISE = INVALID_PLAYER_ID;
            }
        }
        case 100:
        {
			if !response*then return 1;
			if(listitem == 0) ShowPlayerDialog(playerid, 101,1,"Положить/взять деньги",""W"Для того чтобы положить или взять деньги со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
			if(listitem == 1) ShowPlayerDialog(playerid, 102,1,"Положить/взять наркотики",""W"Для того чтобы положить или взять наркотики со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
		}
		case 101:
		{
		    new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return 1;
				if(strval(inputtext) < 1 || strval(inputtext) > 50000) return SendClientMessage(playerid,error, "Вы не можете взять меньше 1 и больше 50000 долларов");
				if(strval(inputtext) > store_mafia[p_info[playerid][member]-7][1]) return SendClientMessage(playerid,error,"Такого количества денег нет на складе");
				store_mafia[p_info[playerid][member]-7][1] -= strval(inputtext);
				set_money(playerid, strval(inputtext));
				format(string, sizeof(string), "Вы взяли со склада %s - %d долларов",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s взял %d долларов со склада", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 доллара");
				if(p_info[playerid][cash] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько денег");
				store_mafia[p_info[playerid][member]-7][1] += strval(inputtext);
				set_money(playerid,-strval(inputtext));
				format(string, sizeof(string), "Вы положили на склад %s - %d долларов",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s положил %d долларов на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 102:
        {
			new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return 1;
				if(strval(inputtext) < 1 || strval(inputtext) > 100) return SendClientMessage(playerid, error, "Вы не можете взять меньше 1 и больше 100 грамм");
				if(p_info[playerid][drugs]+strval(inputtext) > 100) return SendClientMessage(playerid, error, "Вы не можете взять больше 100 грамм");
				if(strval(inputtext) > store_mafia[p_info[playerid][member]-7][0]) return SendClientMessage(playerid,error,"Такого количества наркотиков нет на складе");
				store_mafia[p_info[playerid][member]-7][0] -= strval(inputtext);
				p_info[playerid][drugs] += strval(inputtext);
				f(string, "Вы взяли со склада %s - %d грамм наркотиков",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				f(string, "СКЛАД: "E"%s взял %d гр. наркотиков со склада", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 грамма");
				if(p_info[playerid][drugs] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько грамм наркотиков");
				store_mafia[p_info[playerid][member]-7][0] += strval(inputtext);
				p_info[playerid][drugs] -= strval(inputtext);
				f(string, "Вы положили на склад %s - %d грамм наркотиков",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				f(string, "СКЛАД: "E"%s положил %d гр. наркотиков на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 103:
        {
			if !response*then return 1;
			if(listitem == 0) ShowPlayerDialog(playerid, 104,1,"Положить/взять металл",""W"Для того чтобы положить или взять металл со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
			if(listitem == 1) ShowPlayerDialog(playerid, 105,1,"Положить/взять патроны",""W"Для того чтобы положить или взять патроны со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
			if(listitem == 2) ShowPlayerDialog(playerid, 106,1,"Положить/взять наркотики",""W"Для того чтобы положить или взять наркотики со склада, введите количество и нажмите одну из двух кнопок:","Взять","Положить");
		}
		case 104:
		{
		    new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return 1;
				if(strval(inputtext) < 1 || strval(inputtext) > 20) return SendClientMessage(playerid,error, "Вы не можете взять меньше 1 и больше 20 кг");
				if(p_info[playerid][material]+strval(inputtext) > 20) return SendClientMessage(playerid,error,"Нельзя носить больше 20 кг с собой");
				if(strval(inputtext) > s_band[p_info[playerid][member]-10][0]) return SendClientMessage(playerid,error,"Такого количества металла нет на складе");
				s_band[p_info[playerid][member]-10][0] -= strval(inputtext);
				p_info[playerid][material] += strval(inputtext);
				format(string, sizeof(string), "Вы взяли со склада %s - %d кг. металла",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s взял %d кг. металла со склада", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 кг");
				if(p_info[playerid][material] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько металла");
				s_band[p_info[playerid][member]-10][0] += strval(inputtext);
                p_info[playerid][material] -= strval(inputtext);
				format(string, sizeof(string), "Вы положили на склад %s - %d кг. металла",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s положил %d кг. металла на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 105:
		{
		    new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return 1;
				if(strval(inputtext) < 1 || strval(inputtext) > 150) return SendClientMessage(playerid,error, "Вы не можете взять меньше 1 и больше 150 патрон");
				if(p_info[playerid][patr]+strval(inputtext) > 150) return SendClientMessage(playerid,error,"Нельзя носить больше 150 патрон с собой");
				if(strval(inputtext) > s_band[p_info[playerid][member]-10][1]) return SendClientMessage(playerid,error,"Такого количества патрон нет на складе");
				s_band[p_info[playerid][member]-10][1] -= strval(inputtext);
				p_info[playerid][patr] += strval(inputtext);
				format(string, sizeof(string), "Вы взяли со склада %s - %d шт. патрон",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s взял %d шт. патрон со склада", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 патрона");
				if(p_info[playerid][patr] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько патрон");
				s_band[p_info[playerid][member]-10][1] += strval(inputtext);
                p_info[playerid][patr] -= strval(inputtext);
				format(string, sizeof(string), "Вы положили на склад %s - %d шт. патрон",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s положил %d шт. патрон на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 106:
		{
		    new string[144];
		    if(response)
		    {
		        if(strlen(inputtext) == 0) return 1;
				if(strval(inputtext) < 1 || strval(inputtext) > 150) return SendClientMessage(playerid,error, "Вы не можете взять меньше 1 и больше 50 грамм");
				if(strval(inputtext) > s_band[p_info[playerid][member]-10][2]) return SendClientMessage(playerid,error,"Такого количества наркотиков нет на складе");
				s_band[p_info[playerid][member]-10][2] -= strval(inputtext);
				p_info[playerid][drugs] += strval(inputtext);
				format(string, sizeof(string), "Вы взяли со склада %s - %d гр. наркотиков",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s взял %d гр. наркотиков со склада", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
			else
			{
			    if(strlen(inputtext) == 0) return 1;
		        if(strval(inputtext) < 1) return SendClientMessage(playerid, error, "Нельзя положить меньше 1 грамма");
				if(p_info[playerid][drugs] < strval(inputtext)) return SendClientMessage(playerid, error, "У вас нет столько наркотиков");
				s_band[p_info[playerid][member]-10][2] += strval(inputtext);
                p_info[playerid][drugs] -= strval(inputtext);
				format(string, sizeof(string), "Вы положили на склад %s - %d гр. наркотиков",fracName(playerid),strval(inputtext));
				SendClientMessage(playerid, error, string);
				format(string, sizeof(string), "СКЛАД: "E"%s положил %d гр. наркотиков на склад", get_name(playerid), strval(inputtext));
				SendFamilyMessage(p_info[playerid][member],accept, string);
				_@3DTEXT();
			}
		}
		case 108:
		{
			if(!response) return 1;
			new string[144];
			if(strval(inputtext) < 1 || strval(inputtext) > 30) return SendClientMessage(playerid,error,"Количество дней от 1 до 30"),f(string, ""W"Дом оплачен на "A"%d "W"дней (%d$ в день)\nВведите количество дней\nна сколько хотите продлить квартирную плату:",h_info[p_info[playerid][keyh]][h_rent],h_info[p_info[playerid][keyh]][h_squar]*200),
			    ShowPlayerDialog(playerid, 108,1,"Оплата жилья",string,"Оплатить","Отмена");
            if(h_info[p_info[playerid][keyh]][h_rent]+strval(inputtext) >= 31) return SendClientMessage(playerid,error,"Максимальное количество дней - 30"),f(string, ""W"Дом оплачен на "A"%d "W"дней (%d$ в день)\nВведите количество дней\nна сколько хотите продлить квартирную плату:",h_info[p_info[playerid][keyh]][h_rent],h_info[p_info[playerid][keyh]][h_squar]*200),
			    ShowPlayerDialog(playerid, 108,1,"Оплата жилья",string,"Оплатить","Отмена");
			if(p_info[playerid][bank] < strval(inputtext)*(h_info[p_info[playerid][keyh]][h_squar]*200))
			{
			    SendClientMessage(playerid,error,"У вас недостаточно денег на банковском счету");
				f(string, ""W"Дом оплачен на "A"%d "W"дней (%d$ в день)\nВведите количество дней\nна сколько хотите продлить квартирную плату:",h_info[p_info[playerid][keyh]][h_rent],h_info[p_info[playerid][keyh]][h_squar]*200);
			    ShowPlayerDialog(playerid, 108,1,"Оплата жилья",string,"Оплатить","Отмена");
				return 1;
			}
			h_info[p_info[playerid][keyh]][h_rent] += strval(inputtext);
			p_info[playerid][bank] -= strval(inputtext)*(h_info[p_info[playerid][keyh]][h_squar]*200);
			f(string, "Дом оплачен на "W"%d дней"A" со счета списано %d$",strval(inputtext),strval(inputtext)*(h_info[p_info[playerid][keyh]][h_squar]*200));
			SendClientMessage(playerid, accept,string);
		}
		case 109:
		{
			if(!response) return 1;
			new string[144];
			if(strval(inputtext) < 1 || strval(inputtext) > 30) return SendClientMessage(playerid,error,"Количество дней от 1 до 30"),f(string, ""W"Бизнес оплачен на "A"%d "W"дней (300$ в день)\nВведите количество дней\nна сколько хотите продлить аренду:",b_info[p_info[playerid][key]][_colvo]),
			    ShowPlayerDialog(playerid, 109,1,"Оплата аренды",string,"Оплатить","Отмена");
            if(b_info[p_info[playerid][key]][_colvo]+strval(inputtext) >= 31) return SendClientMessage(playerid,error,"Максимальное количество дней - 30"),f(string, ""W"Бизнес оплачен на "A"%d "W"дней (300$ в день)\nВведите количество дней\nна сколько хотите продлить аренду:",b_info[p_info[playerid][key]][_colvo]),
			    ShowPlayerDialog(playerid, 109,1,"Оплата аренды",string,"Оплатить","Отмена");
			if(p_info[playerid][bank] < strval(inputtext)*(b_info[p_info[playerid][key]][_colvo]*300))
			{
			    SendClientMessage(playerid,error,"У вас недостаточно денег на банковском счету");
				f(string, ""W"Бизнес оплачен на "A"%d "W"дней (300$ в день)\nВведите количество дней\nна сколько хотите продлить аренду:",b_info[p_info[playerid][key]][_colvo]);
			    ShowPlayerDialog(playerid, 109,1,"Оплата аренды",string,"Оплатить","Отмена");
				return 1;
			}
			b_info[p_info[playerid][key]][_colvo] += strval(inputtext);
			p_info[playerid][bank] -= strval(inputtext)*(b_info[p_info[playerid][key]][_colvo]*300);
			f(string, "Аренда бизнеса оплачена на "W"%d дней"A" со счета списано %d$",strval(inputtext),strval(inputtext)*300);
			SendClientMessage(playerid, accept,string);
		}
		case 111:
		{
		    new string[744];
		    if(!response) return 1;
			if(listitem == 0)
			{
			    for(new i = 0; i < sizeof(social_info); i++)
				{
    				format(string,sizeof(string),"%s"W"%s\t"A"[%.1f метров]\n",string,social_info[i][gps_t],GetPlayerDistanceFromPoint(playerid, social_info[i][gps_x], social_info[i][gps_y], social_info[i][gps_z])); // Форматируем диалог
		        }
		        ShowPlayerDialog(playerid,112, DIALOG_STYLE_TABLIST, "Общественные места",string, "Закрыть", ""); // Выводим диалог
			}
            if(listitem == 1)
			{
			    for(new i = 0; i < sizeof(frac_info); i++)
				{
    				format(string,sizeof(string),"%s"W"%s\t"A"[%.1f метров]\n",string,frac_info[i][gps_t],GetPlayerDistanceFromPoint(playerid, frac_info[i][gps_x], frac_info[i][gps_y], frac_info[i][gps_z])); // Форматируем диалог
		        }
		        ShowPlayerDialog(playerid,113, DIALOG_STYLE_TABLIST, "Фракции",string, "Закрыть", ""); // Выводим диалог
			}
		}
		case 112:
		{
		    new string[144];
		    if(!response) return 1;
			format(string,sizeof(string),"Место '%s' отмечено на карте красной меткой. Росстояние: %.0f метров",social_info[listitem][gps_t],GetPlayerDistanceFromPoint(playerid, social_info[listitem][gps_x], social_info[listitem][gps_y], social_info[listitem][gps_z])); // Форматируем диалог
			SendClientMessage(playerid, info, string);
			SetPlayerRaceCheckpoint(playerid,1, social_info[listitem][gps_x], social_info[listitem][gps_y], social_info[listitem][gps_z],0.0,0.0,0.0,6.0);
			SetPVarInt(playerid, "GPS",1);
		}
		case 113:
		{
		    new string[144];
		    if(!response) return 1;
			format(string,sizeof(string),"Место '%s' отмечено на карте красной меткой. Росстояние: %.0f метров",frac_info[listitem][gps_t],GetPlayerDistanceFromPoint(playerid, frac_info[listitem][gps_x], frac_info[listitem][gps_y], frac_info[listitem][gps_z])); // Форматируем диалог
			SendClientMessage(playerid, info, string);
			SetPlayerRaceCheckpoint(playerid,1, frac_info[listitem][gps_x], frac_info[listitem][gps_y], frac_info[listitem][gps_z],0.0,0.0,0.0,6.0);
			SetPVarInt(playerid, "GPS",1);
		}
		case 7054:
		{
            if(!response) return 1;
            switch(listitem)
            {
                case 0: ShowPlayerDialog(playerid, 7055, DIALOG_STYLE_MSGBOX, "{FFFFFF}Где я?", "{FFFFFF}Ты гражданин штата Strant\n\nЗдесь ты можешь работать в полиции, ФБР или в мэрии\nа можешь стать бандитом и воевать за территории.\n\nТакже ты можешь помогать людям в АШ или в больницах\n или можешь стать крупным мафиози.", "Назад", "Закрыть");
                case 1: ShowPlayerDialog(playerid, 7056, DIALOG_STYLE_MSGBOX, "{FFFFFF}Что мне делать?", "{FFFFFF}Как я вижу у тебя мало денег, неплохо было бы подзаработать\nнемного на жизнь устроившись в различные трудовые\nкампании или же пройти освоительный курс у меня.", "Назад", "Закрыть");
                case 2: ShowPlayerDialog(playerid, 7057, DIALOG_STYLE_MSGBOX, "{FFFFFF}Что ты можешь мне предложить", "{FFFFFF}Ну если ты хочешь заработать денег и разузнать всё о данном штате\nя могу тебе дать пару заданий. Ты согласен?", "Согласен", "Не согласен");
            }
		}
		case 7055:
		{
		    if(!response) return 1;
		    else ShowPlayerDialog(playerid, 7054, DIALOG_STYLE_LIST, "{FFFFFF}Чем вам помочь?", "{FFFFFF}Где я?\nЧто мне делать?\n{c1c108}Что ты можешь мне предложить?", "Выбрать", "Закрыть");
		}
		case 7056:
		{
		    if(!response) return 1;
		    else ShowPlayerDialog(playerid, 7054, DIALOG_STYLE_LIST, "{FFFFFF}Чем вам помочь?", "{FFFFFF}Где я?\nЧто мне делать?\n{c1c108}Что ты можешь мне предложить?", "Выбрать", "Закрыть");
		}
		case 7057:
		{
		    if(!response) return 1;
		    else ShowPlayerDialog(playerid, 7058, DIALOG_STYLE_LIST, "{FFFFFF}Вот, что я могу тебе предложить", "{FFFFFF}А где твой паспорт?\nЛёгкая работа\nА ты умеешь водить?", "Выбрать", "Закрыть");
		}
		case 7060:
		{
		    if(!response) return 1;
		    switch(listitem)
		    {
		        case 0:
		        {
		            if(p_info[playerid][cash] >= 30)
		            {
		                set_money(playerid, -30);
		                SendClientMessage(playerid, info, "Вы купили и съели пончик. Ваша сытость увеличина на 10%.");
		            }
					else SendClientMessage(playerid, error, "У вас недостаточно средств.");
		        }
		        case 1:
		        {
		            if(p_info[playerid][cash] >= 75)
		            {
		                set_money(playerid, -75);
		                SendClientMessage(playerid, info, "Вы купили и съели кусок пиццы. Ваша сытость увеличина на 25%.");
		            }
		            else SendClientMessage(playerid, error, "У вас недостаточно средств.");
		        }
		        case 2:
		        {
		            if(p_info[playerid][cash] >= 150)
		            {
		                set_money(playerid, -150);
		                SendClientMessage(playerid, info, "Вы купили и съели шаурму. Ваша сытость увеличина на 45%.");
		            }
		            else SendClientMessage(playerid, error, "У вас недостаточно средств.");
		        }
		    }
		}
	}
	return 1;
}



public OnPlayerPressButton(playerid, buttonid)
{
	if(knopka[2]==buttonid)
	{
		if(p_info[playerid][member] == 5)
		{
			if(onpressb[1]==true)
			{
				MoveObject(barrier,342.89941406,1796.09960938,18.09999924-0.004,0.004,0.00000000,90.00000000,33.99267578);
				onpressb[1]=false;
			}
			else
			{
	   			MoveObject(barrier,342.89941406,1796.09960938,18.09999924+0.004,0.004,0.0000,8.00000000,33.99267578);
				onpressb[1]=true;
			}
		}
		else SendClientMessage(playerid,error,"Вы не состоите в армии");
	}
	if(knopka[1]==buttonid || knopka[0]==buttonid)
	{
		if(p_info[playerid][member] == 5)
		{
			if(onpressb[2]==false)
			{
				MoveObject(gate_z51[0],285.62500000,1811.20446777,18.60793877,3.0,0.00000000,0.00000000,270.00000000);
	    		MoveObject(gate_z51[1],285.62500000,1830.82177734,18.60793877,3.0,0.00000000,0.00000000,270.00000000);
	    		onpressb[2]=true;
			}
			else
			{
			    MoveObject(gate_z51[0],285.98410034,1816.82214355,18.60793877,3.0,0.00000000,0.00000000,270.00000000);
				MoveObject(gate_z51[1],285.98410034,1824.74121094,18.60793877,3.0,0.00000000,0.00000000,270.00000000);
				onpressb[2]=false;
			}
		}
		else 	SendClientMessage(playerid,error,"Вы не состоите в армии");
	}
	if(knopka[3]==buttonid || knopka[4]==buttonid)
	{
		if(p_info[playerid][member] == 5)
		{
			if(onpressb[3]==false)
			{
				MoveObject(gate_z51[2],121.7749, 1941.5251, 21.4830,3.0,0.00000000,0.00000000,0.00000000);
	    		onpressb[3]=true;
			}
			else
			{
			    MoveObject(gate_z51[2],134.7749, 1941.5251, 21.4830,3.0,0.00000000,0.00000000,0.00000000);
				onpressb[3]=false;
			}
		}
		else 	SendClientMessage(playerid,error,"Вы не состоите в армии");
	}
	if(knopka[5]==buttonid || knopka[6]==buttonid)
	{
		if(p_info[playerid][member] == 5)
		{
			if(onpressb[4]==false)
			{
				MoveObject(gate_z51[3],96.48480, 1926.26721, 16.48380,3.0,0.00000000,0.00000000,90.00000000);
	    		onpressb[4]=true;
			}
			else
			{
			    MoveObject(gate_z51[3],96.48480, 1923.26721, 16.48380,3.0,0.00000000,0.00000000,90.00000000);
				onpressb[4]=false;
			}
		}
		else 	SendClientMessage(playerid,error,"Вы не состоите в армии");
	}
	return true;
}





forward phoneNum(playerid,text);
public phoneNum(playerid,text)
{
	new rows;
	cache_get_row_count(rows);
	if(rows) return SendClientMessage(playerid, error, "Данный номер телефона занят!"),ShowPlayerDialog(playerid,44,1,"Смена номера","{ffffff}Введите новый номер телефона.\n\nПримечаниe: Номер должен состоять из 4-6 цифр","Изменить","Отмена");
	p_info[playerid][p_number] = text;
	new query[96];
	mysql_format(con_bd,query,sizeof(query), "UPDATE `accounts` SET `p_number` = '%d' WHERE `name` = '%s'",p_info[playerid][p_number],get_name(playerid));
 	mysql_tquery(con_bd, query,  "", "");
	f(query, "Вы приобрели сим-карту с номером телефона %d",p_info[playerid][p_number]);
	SendClientMessage(playerid, info, query);
	set_money(playerid, -300);
	b_info[GetPVarInt(playerid, "bID")][_prod] -= 2;
	b_info[GetPVarInt(playerid, "bID")][_bank] += 300;
	return 1;
}

set_check_race(playerid)
{
    PlayerPlaySound(playerid, 1137, 0.0, 0.0, 0.0);
	SetPVarInt(playerid, "race_check",GetPVarInt(playerid, "race_check") +1);
	if(GetPVarInt(playerid,"race_check") == 20) return SetPlayerRaceCheckpoint(playerid, 1, ls_sf[GetPVarInt(playerid, "race_check")][0], ls_sf[GetPVarInt(playerid, "race_check")][1], ls_sf[GetPVarInt(playerid, "race_check")][2], ls_sf[GetPVarInt(playerid, "race_check")][0], ls_sf[GetPVarInt(playerid, "race_check")][1], ls_sf[GetPVarInt(playerid, "race_check")][2], 8.0);
	else SetPlayerRaceCheckpoint(playerid, 0, ls_sf[GetPVarInt(playerid, "race_check")][0], ls_sf[GetPVarInt(playerid, "race_check")][1], ls_sf[GetPVarInt(playerid, "race_check")][2], ls_sf[GetPVarInt(playerid, "race_check")+1][0], ls_sf[GetPVarInt(playerid, "race_check")+1][1], ls_sf[GetPVarInt(playerid, "race_check")+1][2], 8.0);
	return 1;
}
forward freez_bus(playerid);
public freez_bus(playerid)
{
	SendClientMessage(playerid, info, "Следуйте дальше по маршруту!");
	TogglePlayerControllable(playerid, true);
 	return 1;
}
public OnPlayerClickTextDraw(playerid, Text:clickedid)
{
    if(clickedid == skin_price[playerid][0])
    {
        new string[256];
        if(p_info[playerid][sex] == 1)
        {

            SetPVarInt(playerid, "@clothes", GetPVarInt(playerid, "@clothes") +1);
	    	if(GetPVarInt(playerid, "@clothes") >= sizeof(skinBuyMan)) SetPVarInt(playerid, "@clothes",0);
			SetPlayerSkin(playerid,skinBuyMan[GetPVarInt(playerid, "@clothes")][0]);
			format(string,sizeof(string),"~g~%d$",skinBuyMan[GetPVarInt(playerid, "@clothes")][1]);
			TextDrawSetString(skin_price[playerid][4],string);
        }
        else
        {
            SetPVarInt(playerid, "@clothes", GetPVarInt(playerid, "@clothes") +1);
	    	if(GetPVarInt(playerid, "@clothes") >= sizeof(skinBuyMale)) SetPVarInt(playerid, "@clothes",0);
			SetPlayerSkin(playerid,skinBuyMale[GetPVarInt(playerid, "@clothes")][0]);
			format(string,sizeof(string),"~g~%d$",skinBuyMale[GetPVarInt(playerid, "@clothes")][1]);
			TextDrawSetString(skin_price[playerid][4],string);
        }
   	}
    else if(clickedid == skin_price[playerid][1])
    {
        new string[256];
        if(p_info[playerid][sex] == 1)
        {
      		SetPVarInt(playerid, "@clothes", GetPVarInt(playerid, "@clothes") -1);
 			if(GetPVarInt(playerid, "@clothes") < 0) SetPVarInt(playerid, "@clothes", sizeof(skinBuyMan)-1);
			SetPlayerSkin(playerid, skinBuyMan[GetPVarInt(playerid, "@clothes")][0]);
			format(string,sizeof(string),"~g~%d$",skinBuyMan[GetPVarInt(playerid, "@clothes")][1]);
			TextDrawSetString(skin_price[playerid][4],string);

        }
        else
        {
            SetPVarInt(playerid, "@clothes", GetPVarInt(playerid, "@clothes") -1);
 			if(GetPVarInt(playerid, "@clothes") < 0) SetPVarInt(playerid, "@clothes", sizeof(skinBuyMale)-1);
			SetPlayerSkin(playerid, skinBuyMale[GetPVarInt(playerid, "@clothes")][0]);
			format(string,sizeof(string),"~g~%d$",skinBuyMale[GetPVarInt(playerid, "@clothes")][1]);
			TextDrawSetString(skin_price[playerid][4],string);
        }
    }
    if(clickedid == skin_price[playerid][2])
    {
		switch(p_info[playerid][sex])
		{
			case 1: if(p_info[playerid][cash]<skinBuyMan[GetPVarInt(playerid, "@clothes")][1]) return SendClientMessage(playerid, error,"У вас не хватает денег");
		    case 2: if(p_info[playerid][cash]<skinBuyMale[GetPVarInt(playerid, "@clothes")][1]) return SendClientMessage(playerid, error,"У вас не хватает денег");
		}
		if(b_info[GetPVarInt(playerid, "bID")][_prod] < 20) return SendClientMessage(playerid, error,"В магазине закончился данный комплект одежды");
		SetPlayerPos(playerid,b_info[GetPVarInt(playerid, "bID")][b_menu][0],b_info[GetPVarInt(playerid, "bID")][b_menu][1],b_info[GetPVarInt(playerid, "bID")][b_menu][2]);
		SetPlayerInterior(playerid, 1);
		SetCameraBehindPlayer(playerid);
		p_info[playerid][skin] = GetPlayerSkin(playerid);
		SetPlayerSkin(playerid, p_info[playerid][skin]);
		b_info[GetPVarInt(playerid, "bID")][_prod] -= 20;
		if(p_info[playerid][sex] == 1) set_money (playerid, -skinBuyMan[GetPVarInt(playerid, "@clothes")][1]),b_info[GetPVarInt(playerid, "bID")][_bank] +=skinBuyMan[GetPVarInt(playerid, "@clothes")][1];
		else set_money (playerid, -skinBuyMale[GetPVarInt(playerid, "@clothes")][1]),b_info[GetPVarInt(playerid, "bID")][_bank] +=skinBuyMale[GetPVarInt(playerid, "@clothes")][1];
		SendClientMessage(playerid, info, "Спасибо что вы приобрели одежду у нас. Приходите еще.");
		DeletePVar(playerid,"@clothes");
		for(new i; i<5; i++) TextDrawHideForPlayer(playerid, skin_price[playerid][i]);
  		CancelSelectTextDraw(playerid);
	}
	else if(clickedid == skin_price[playerid][3])
	{
	    SetPlayerPos(playerid,b_info[GetPVarInt(playerid, "bID")][b_menu][0],b_info[GetPVarInt(playerid, "bID")][b_menu][1],b_info[GetPVarInt(playerid, "bID")][b_menu][2]);
		SetPlayerInterior(playerid, 1);
		SetCameraBehindPlayer(playerid);
		SetPlayerSkin(playerid, p_info[playerid][skin]);
	    for(new i; i<5; i++) TextDrawHideForPlayer(playerid, skin_price[playerid][i]);
  		CancelSelectTextDraw(playerid);
  		DeletePVar(playerid,"@clothes");
  		SendClientMessage(playerid, info, "Жаль, что вам ничего не подошло. Приходите к нам еще.");
	}
    if(clickedid == skinTextDraw[playerid][0])//стрелка в право
	{
	    SetPVarInt(playerid, "@clothes", GetPVarInt(playerid, "@clothes") +1);
	    if(GetPVarInt(playerid, "@clothes") >= sizeof(skinMan)) SetPVarInt(playerid, "@clothes",0);
		SetPlayerSkin(playerid, skinMan[GetPVarInt(playerid, "@clothes")][0]);
	}
    if(clickedid == skinTextDraw[playerid][1])//стрелка влево
	{
		SetPVarInt(playerid, "@clothes", GetPVarInt(playerid, "@clothes") -1);
 		if(GetPVarInt(playerid, "@clothes") < 0) SetPVarInt(playerid, "@clothes", sizeof(skinMan)-1);
		SetPlayerSkin(playerid, skinMan[GetPVarInt(playerid, "@clothes")][0]);
	}
	if(clickedid == skinTextDraw[playerid][2])//Играть
	{
		SetPlayerPos(playerid, 1244.0, 2233.0, 20.0);
		SetPlayerVirtualWorld(playerid, 0);
		TextDrawHideForPlayer(playerid,skinTextDraw[playerid][1]);
		TextDrawHideForPlayer(playerid,skinTextDraw[playerid][2]);
		TextDrawHideForPlayer(playerid,skinTextDraw[playerid][0]);
		CancelSelectTextDraw(playerid);
		p_info[playerid][skin] = GetPlayerSkin(playerid);
		if(GetPlayerSkin(playerid) == 226 || GetPlayerSkin(playerid) == 216) p_info[playerid][sex] = 2;
		else p_info[playerid][sex] = 1;
		DeletePVar(playerid, "@skin_reg");
		DeletePVar(playerid, "@clothes");
		SetPVarInt(playerid, "SPAWN",1);
		SpawnPlayer(playerid);
		player_register(playerid,p_info[playerid][password]);
	}
	else if(clickedid == Text:INVALID_TEXT_DRAW)
	{
		if(GetPVarInt(playerid,"SPAWN") == 0) return SendClientMessage(playerid,  server, "Вас выкинуло с сервера (/q)"),Kick(playerid);
		if(GetPVarInt(playerid, "skin_select") == 1 || GetPVarInt(playerid, "@clothes")) return SelectTextDraw(playerid, 0x4169E1FF);
	}
	return 1;
}
public OnVehicleRespray(playerid, vehicleid, color1, color2)
{
    SetPVarInt(playerid,"Tuning",1);
    return 1;
}


public OnEnterExitModShop(playerid, enterexit, interiorid)
{
    printf("OnEnterExitModShop Name: %s",get_name(playerid));
    if(enterexit == 0)
	{
        veh_info[p_info[playerid][veh_id]][v_tun][0] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_SPOILER);
        veh_info[p_info[playerid][veh_id]][v_tun][1] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_NITRO);
        veh_info[p_info[playerid][veh_id]][v_tun][2] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_WHEELS);
        veh_info[p_info[playerid][veh_id]][v_tun][3] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_HYDRAULICS);
        veh_info[p_info[playerid][veh_id]][v_tun][4] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_FRONT_BUMPER);
        veh_info[p_info[playerid][veh_id]][v_tun][5] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_REAR_BUMPER);
        veh_info[p_info[playerid][veh_id]][v_tun][6] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_HOOD);
        veh_info[p_info[playerid][veh_id]][v_tun][7] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_ROOF);
        veh_info[p_info[playerid][veh_id]][v_tun][8] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_SIDESKIRT);
        veh_info[p_info[playerid][veh_id]][v_tun][9] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_LAMPS);
        veh_info[p_info[playerid][veh_id]][v_tun][10] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_EXHAUST);
        veh_info[p_info[playerid][veh_id]][v_tun][11] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid),  CARMODTYPE_VENT_RIGHT);
        veh_info[p_info[playerid][veh_id]][v_tun][12] = GetVehicleComponentInSlot(GetPlayerVehicleID(playerid), CARMODTYPE_VENT_LEFT);
	    SendClientMessage(playerid, accept, "Вы установили тюнинг на авто, с вас списано 1000$");
    	set_money(playerid, -1000);
	}
    return 1;
}





//__паблики mysql запросы



stock save_gz(idx)
{
	new query[100];
	format(query, sizeof(query), "UPDATE `gangzone` SET fraction = %i WHERE id = %i", gangzone_Info[idx][gang_terr], idx);
	mysql_tquery(con_bd, query, "", "");
	return 1;
}
forward load_gz();
public load_gz()
{
	new rows;
	cache_get_row_count(rows);
	if(rows)
	{
		for(new idx = 0; idx < rows; idx++)
		{
		    cache_get_value_name_int(idx,"id", gangzone_Info[idx][gID]);
		    cache_get_value_name_float(idx, "zone_x", gangzone_Info[idx][gCoords][0]);
		    cache_get_value_name_float(idx, "zone_y", gangzone_Info[idx][gCoords][1]);
		    cache_get_value_name_float(idx, "zone_xM", gangzone_Info[idx][gCoords][2]);
		    cache_get_value_name_float(idx, "zone_yM", gangzone_Info[idx][gCoords][3]);
		    cache_get_value_name_int(idx, "fraction", gangzone_Info[idx][gang_terr]);
        	TOTALGZ++;
	        GangZone[idx] = GangZoneCreate(gangzone_Info[idx][gCoords][0],gangzone_Info[idx][gCoords][1],gangzone_Info[idx][gCoords][2],gangzone_Info[idx][gCoords][3]);
			ZoneOnBattle[idx] = 0;
			GZSafeTime[idx] = 0;
        }
    }
	printf("[%i штук] >> загружены gangzone", TOTALGZ);
	return 1;
}

//загрузка общих переменных
forward other_load();
public other_load()
{
    new rows;
    cache_get_row_count(rows);
    if(rows)
    {
        //ЗАВОД
       	cache_get_value_name_int(0, "zmet",zmet );
        cache_get_value_name_int(0, "zprod",zprod);
        cache_get_value_name_int(0, "zfuel",zfuel);
        //АРМЕЯ
        cache_get_value_name_int(0, "z51_patr",army_patr);
        cache_get_value_name_int(0, "z51_material",army_material);
        //РУССКАЯ МАФИЯ
		cache_get_value_name_int(0, "rm_money",store_mafia[0][0]);
		cache_get_value_name_int(0, "rm_drugs",store_mafia[0][1]);
		//ЛКН
		cache_get_value_name_int(0, "lcn_money",store_mafia[1][0]);
		cache_get_value_name_int(0, "lcn_drugs",store_mafia[1][1]);
		//ЯКУДЗА
		cache_get_value_name_int(0, "yakuza_money",store_mafia[2][0]);
		cache_get_value_name_int(0, "yakuza_drugs",store_mafia[2][1]);
		// g - Значит шреки
		cache_get_value_name_int(0, "g_drugs",s_band[0][0]);
		cache_get_value_name_int(0, "g_metall",s_band[0][1]);
		cache_get_value_name_int(0, "g_patron",s_band[0][2]);
		// b - Значит баллас
		cache_get_value_name_int(0, "b_drugs",s_band[1][0]);
		cache_get_value_name_int(0, "b_metall",s_band[1][1]);
		cache_get_value_name_int(0, "b_patron",s_band[1][2]);
		// a - Значит el_corona
		cache_get_value_name_int(0, "a_drugs",s_band[2][0]);
		cache_get_value_name_int(0, "a_metall",s_band[2][1]);
		cache_get_value_name_int(0, "a_patron",s_band[2][2]);
		// r - Значит rифа
		cache_get_value_name_int(0, "r_drugs",s_band[3][0]);
		cache_get_value_name_int(0, "r_metall",s_band[3][1]);
		cache_get_value_name_int(0, "r_patron",s_band[3][2]);
		// V - Значит Vагос
		cache_get_value_name_int(0, "v_drugs",s_band[4][0]);
		cache_get_value_name_int(0, "v_metall",s_band[4][1]);
		cache_get_value_name_int(0, "v_patron",s_band[4][2]);
		

	}
  	return true;
}
forward other_save();
public other_save()
{
	new query[456];
    mysql_format(con_bd,query,sizeof(query),"UPDATE other SET \
	`zmet`='%i',`zprod`='%i',`zfuel`='%i',\
	`z51_patr`='%i',`z51_material`='%i',\
	`rm_money`='%i',`rm_drugs`='%i',\
	`lcn_money`='%i',`lcn_drugs`='%i',\
	`yakuza_money`='%i',`yakuza_drugs`='%i'",zmet,zprod,zfuel,army_patr,army_material,store_mafia[0][0],store_mafia[0][1],store_mafia[1][0],store_mafia[1][1],store_mafia[2][0],store_mafia[2][1]);
	mysql_tquery(con_bd, query, "","");
	mysql_format(con_bd,query,sizeof(query),"UPDATE other SET\
	`g_drugs`='%i',`g_metall`='%i',`g_patron`='%i',\
	`b_drugs`='%i',`b_metall`='%i',`b_patron`='%i',\
 	`a_drugs`='%i',`a_metall`='%i',`a_patron`='%i',\
	`r_drugs`='%i',`r_metall`='%i',`r_patron`='%i',\
	`v_drugs`='%i',`v_metall`='%i',`v_patron`='%i'",s_band[0][0],s_band[0][1],s_band[0][2],s_band[1][0],s_band[1][1],s_band[1][2],s_band[2][0],s_band[2][1],s_band[2][2],s_band[3][0],s_band[3][1],s_band[3][2],s_band[4][0],s_band[4][1],s_band[4][2]);
	mysql_tquery(con_bd, query, "","");
}

CMD:rm(playerid)
{
    store_mafia[0][1] = 25+random(25);
    store_mafia[0][0] = 25+random(25);
    other_save();
}
forward mail_player(playerid);
public mail_player(playerid)
{
	new rows;
	cache_get_row_count(rows);
	if(rows) return SendClientMessage(playerid, error, "Данный email занят!"),ShowPlayerDialog(playerid, 3, DIALOG_STYLE_INPUT,"{319AFF}                      Электронная почта", "{ffd200}В случае утери пароля, вы сможете восстановить данные.\n{ffffff}Введите адрес электронной почты:\n", "Ок", "Выйти");
	new mail_str[64];
	GetPVarString(playerid, "Mail", mail_str, sizeof(mail_str));
	strmid(p_info[playerid][mail], mail_str, 0, strlen(mail_str), 64);
	SendClientMessage(playerid, info, "Выберите внешность персонажа. (Пол будет выбран в зависимости от выбранного скина)");
    SetPVarInt(playerid, "@skin_reg",1);
    SetPVarInt(playerid, "@clothes",1);
    SetPVarInt(playerid, "LOGGED",1);
	SpawnPlayer(playerid);
	return 1;
}

forward find_table(playerid);
public find_table(playerid)
{
    new rows;
    cache_get_row_count(rows);
    if(!rows)  dialog_reg(playerid,2);
    else dialog_reg(playerid,1),cache_get_value_name(0, "password", p_info[playerid][password], 30);
    return 1;
}

forward UploadPlayerAccount(playerid);
public UploadPlayerAccount(playerid)
{
    cache_get_value_name_int(0, "id", p_info[playerid][ID]);
	cache_get_value_name(0, "password",p_info[playerid][password],16);
    cache_get_value_name(0, "ip",p_info[playerid][IP],16);
    cache_get_value_name(0, "mail",p_info[playerid][mail],64);
	cache_get_value_name(0, "datareg",p_info[playerid][reg_data],16);
    cache_get_value_name_int(0,"sex",p_info[playerid][sex]);
    cache_get_value_name_int(0,"skin",p_info[playerid][skin]);
    cache_get_value_name_int(0,"money",p_info[playerid][cash]);
    cache_get_value_name_int(0,"level",p_info[playerid][level]);
	cache_get_value_name_int(0,"exp",p_info[playerid][exp]);
	cache_get_value_name_int(0,"admin",p_info[playerid][admin]);
	cache_get_value_name_int(0,"lic",p_info[playerid][lic]);
	cache_get_value_name_int(0,"key",p_info[playerid][key]);
	cache_get_value_name_int(0,"leader",p_info[playerid][leader]);
	cache_get_value_name_int(0,"member",p_info[playerid][member]);
	cache_get_value_name_int(0,"rang",p_info[playerid][rang]);
	cache_get_value_name_int(0,"zvezd",p_info[playerid][zvezd]);
	cache_get_value_name_int(0,"fskin",p_info[playerid][fskin]);
	cache_get_value_name_int(0,"keyh",p_info[playerid][keyh] );
	cache_get_value_name_int(0,"metall",p_info[playerid][material]);
	cache_get_value_name_int(0,"drugs",p_info[playerid][drugs]);
	cache_get_value_name_int(0,"bank",p_info[playerid][bank]);
	cache_get_value_name_int(0,"spawn",p_info[playerid][spawn]);
	cache_get_value_name_int(0,"job",p_info[playerid][job]);
	cache_get_value_name_int(0,"phone",p_info[playerid][phone]);
	cache_get_value_name_int(0,"p_number",p_info[playerid][p_number]);
	cache_get_value_name_int(0,"patr",p_info[playerid][patr]);
	cache_get_value_name_int(0,"ban",p_info[playerid][ban]);
	cache_get_value_name_int(0,"mute",p_info[playerid][mute]);
	cache_get_value_name_int(0,"warn",p_info[playerid][warn]);
	new str[128];
	if(p_info[playerid][ban] > gettime())
	{
		f(str, "Ваш аккаунт заблокирован! Разблокировка через %d дня/дней",(p_info[playerid][ban]-gettime())/84600);
		SendClientMessage(playerid, iAdm, str);
		Kick(playerid);
		return 1;
	}
    SendClientMessage(playerid, server, "Вы успешно авторизировались!");
    SetPVarInt(playerid, "LOGGED",1);
    SetPVarInt(playerid, "SPAWN",1);
    SetPlayerColor(playerid,0xFFFFFF80);
    SpawnPlayer(playerid);
    for(new i=0; i<MAX_VEHICLES; i++)
	{
		if(veh_info[i][v_if_buy] == 1 && !strcmp(veh_info[i][v_owner], get_name(playerid), true))
		{
			p_info[playerid][veh_id] = i;
			break;
		}
	}
    return 1;
}
stock player_register(playerid, password_player[])
{
    new query_string[284];
    new ip[32],strdate[24];
    GetPlayerIp(playerid, ip, 32);
    new year,month,day;
    getdate(year, month, day);
    format(strdate, sizeof(strdate), "%d.%d.%d",day,month,year);
    p_info[playerid][ID] = (random(9999)+9999);
    format(query_string, sizeof(query_string), "INSERT INTO `accounts` (`name`, `password`,`ip`, `datareg`, `sex`, `skin`, `mail`,`id`) VALUES ('%s', '%s','%s','%s', '%d', '%d', '%s','%d')", p_info[playerid][name], password_player,ip, strdate,p_info[playerid][sex], p_info[playerid][skin],p_info[playerid][mail],p_info[playerid][ID]);
    mysql_tquery(con_bd, query_string, "", "");
    //
    p_info[playerid][level]    = 1;
	p_info[playerid][key]      = -1;
	p_info[playerid][keyh]     = 60635;
	//
	f(query_string, "%s! Поздравляем вас с успешной регистрацией!",get_name(playerid));
	SendClientMessage(playerid, info, query_string);
	SendClientMessage(playerid, error, "( /gps - навигатор /ahelp - админ команды /m(enu) - меню )");
	SendClientMessage(playerid, iAdm, "Все найденные недочеты и баги пишите в теме! Спасибо, ваш "A"Unreal");
    return 1;
}


stock dialog_reg(playerid,regandlog)
{
	new loginmsg[456];
	switch(regandlog)
	{
		case 1:
		{
		    f(loginmsg,""I"%s"W", добро пожаловать на сервер "SERVER"\n"W"В поле ниже введите пароль указанный при регистрации:",get_name(playerid));
		    ShowPlayerDialog(playerid,2,DIALOG_STYLE_INPUT,"Авторизация",loginmsg,"Далее","Отмена");
		}
		case 2:
		{
			f(loginmsg,""I"%s"W", добро пожаловать на сервер "SERVER"\n"I"Информация:\n"W"\tПридумайте и введите пароль в поле ниже\n\tон будет использоваться при каждом заходе на сервер\n"I"Требования:\n"W"\t 1. Пароль должен состоять из латинских букв или цифр\n\t 2. Иметь длину от 6 до 15 символов",get_name(playerid));
			ShowPlayerDialog(playerid,1,DIALOG_STYLE_INPUT,"Регистрация",loginmsg,"Далее","Отмена");
		}
	}
}
stock ErrorDialogMessage(playerid, dialogid, error_id)
{
    switch(dialogid)
    {
        case 1:
        {
            switch(error_id)
            {
                case 0: SendClientMessage(playerid, error, "Ошибка: Вы не можете продолжить регистрацию не введя пароль!"),dialog_reg(playerid,2);
                case 1: SendClientMessage(playerid, error, "Ошибка: Пароль слишком короткий!"),dialog_reg(playerid,2);
                case 2: SendClientMessage(playerid, error, "Ошибка: Пароль слишком длинный!"),dialog_reg(playerid,2);
                case 3: SendClientMessage(playerid, error, "Ошибка: Пароль содержит запрещенный символы (исп. a-z, A-Z, 0-9)"),dialog_reg(playerid,2);
            }
            return 1;
        }
        case 2:
        {
            switch(error_id)
            {
                case 0: SendClientMessage(playerid, error, "Ошибка: Вы не можете продолжить авторизацию не введя пароль!"),dialog_reg(playerid,1);
                case 1: SendClientMessage(playerid, error, "Ошибка: Пароль содержит запрещенный символы (исп. a-z, A-Z, 0-9)"),dialog_reg(playerid,1);
                case 2:
                {
                    switch(GetPVarInt(playerid, "non_pass"))
                    {
                        case 0: SendClientMessage(playerid, error, "Ошибка: Вы ввели неверный пароль! У вас осталось 3 попытки!"),dialog_reg(playerid,1);
                        case 1: SendClientMessage(playerid, error, "Ошибка: Вы ввели неверный пароль! У вас осталось 2 попытки!"),dialog_reg(playerid,1);
                        case 2: SendClientMessage(playerid, error, "Ошибка: Вы ввели неверный пароль! У вас осталось 1 попытка!"),dialog_reg(playerid,1);
                        default:
                        {
                            ShowPlayerDialog(playerid, 2, DIALOG_STYLE_MSGBOX, "Оповещение", "{FFFFFF}Вы были кикнуты с сервера.\n{FF0000}Причина: Превышен лимит попыток на ввод пароля.\n{FFFFFF}Для выхода с сервера введите \"/q\" в чат", "Вход", "Выход");
                            return Kick(playerid);
                        }
                    }
                    SetPVarInt(playerid, "non_pass", GetPVarInt(playerid, "non_pass")+1);
                }
            }
            return 1;
        }
    }
    return 1;
}

stock save_player(playerid)
{
    if(GetPVarInt(playerid, "LOGGED") != 1) return 1;
    new query_string[680] = "UPDATE `accounts` SET";
    format(query_string, sizeof(query_string), "%s `password` = '%s',", query_string, p_info[playerid][password]);
    format(query_string, sizeof(query_string), "%s `sex` = '%d',", query_string, p_info[playerid][sex]);
    format(query_string, sizeof(query_string), "%s `skin` = '%d',", query_string, p_info[playerid][skin]);
    format(query_string, sizeof(query_string), "%s `money` = '%d',", query_string, p_info[playerid][cash]);
    format(query_string, sizeof(query_string), "%s `level` = '%d',", query_string, p_info[playerid][level]);
    format(query_string, sizeof(query_string), "%s `exp` = '%d',", query_string, p_info[playerid][exp]);
	format(query_string, sizeof(query_string), "%s `admin` = '%d',", query_string, p_info[playerid][admin]);
    format(query_string, sizeof(query_string), "%s `lic` = '%d',", query_string, p_info[playerid][lic]);
    format(query_string, sizeof(query_string), "%s `key` = '%d',", query_string, p_info[playerid][key]);
    format(query_string, sizeof(query_string), "%s `leader` = '%d',", query_string, p_info[playerid][leader]);
    format(query_string, sizeof(query_string), "%s `member` = '%d',", query_string, p_info[playerid][member]);
    format(query_string, sizeof(query_string), "%s `rang` = '%d',", query_string, p_info[playerid][rang]);
	format(query_string, sizeof(query_string), "%s `zvezd` = '%d',", query_string, p_info[playerid][zvezd]);
	format(query_string, sizeof(query_string), "%s `fskin` = '%d',", query_string, p_info[playerid][fskin]);
	format(query_string, sizeof(query_string), "%s `keyh` = '%d',", query_string, p_info[playerid][keyh]);
    format(query_string, sizeof(query_string), "%s `metall` = '%d',", query_string, p_info[playerid][material]);
    format(query_string, sizeof(query_string), "%s `drugs` = '%d',", query_string, p_info[playerid][drugs]);
    format(query_string, sizeof(query_string), "%s `bank` = '%d',", query_string, p_info[playerid][bank]);
    format(query_string, sizeof(query_string), "%s `spawn` = '%d',", query_string, p_info[playerid][spawn]);
    format(query_string, sizeof(query_string), "%s `job` = '%d',", query_string, p_info[playerid][job]);
    format(query_string, sizeof(query_string), "%s `phone` = '%d',", query_string, p_info[playerid][phone]);
    format(query_string, sizeof(query_string), "%s `p_number` = '%d',", query_string, p_info[playerid][p_number]);
    format(query_string, sizeof(query_string), "%s `patr` = '%d',", query_string, p_info[playerid][patr]);
    format(query_string, sizeof(query_string), "%s `ban` = '%d',", query_string, p_info[playerid][ban]);
    format(query_string, sizeof(query_string), "%s `mute` = '%d',", query_string, p_info[playerid][mute]);
    format(query_string, sizeof(query_string), "%s `warn` = '%d'", query_string, p_info[playerid][warn]);
    format(query_string, sizeof(query_string), "%s WHERE `name` = '%s'", query_string, p_info[playerid][name]);
    mysql_tquery(con_bd, query_string,  "", "");
    return 1;
}
//бизнесы
stock Update3DTexts()
{
    new string[128];
    for(new idx = 0; idx < totalbiz; idx++)
	{
        Delete3DTextLabel(b_info[idx][_text]);
        if(b_info[idx][_owned] == 0)
		{
			format(string,sizeof(string),"%s\n"W"Цена: "I"%d$",b_info[idx][_name],b_info[idx][_price]);
     		b_info[idx][_text] = Create3DTextLabel(string,info,b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],20.0,0,1);
		}
		else
		{
		    if(b_info[idx][_tip] != 4) format(string,256,"%s\n"W"Владелец:"I" %s",b_info[idx][_name],b_info[idx][_owner]);
		    else format(string,256,"%s\n"W"Владелец:"I" %s"E"\nЗаправиться: NUM2\nЦена бензина: %d$ за 1 литр",b_info[idx][_name],b_info[idx][_owner],b_info[idx][_cena1]);
	    	b_info[idx][_text] = Create3DTextLabel(string,info,b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],20.0,0,1);
		}
	}
}
forward biz_load();
public biz_load()
{
	new rows, time = GetTickCount();
	new string[128];
    cache_get_row_count(rows);
    if(rows)
    {
		for(new idx = rows-1; idx != -1; --idx)
		{
	    	cache_get_value_name_int(idx, "b_id",b_info[idx][_b_id]);
   			cache_get_value_name(idx,"b_owner",b_info[idx][_owner],24);
   			cache_get_value_name(idx,"b_name",b_info[idx][_name],24);
   			cache_get_value_name_int(idx, "b_owned",b_info[idx][_owned]);
   			cache_get_value_name_int(idx, "b_world",b_info[idx][_world]);
   			cache_get_value_name_int(idx, "b_price",b_info[idx][_price]);
   			cache_get_value_name_int(idx, "b_cena",b_info[idx][_cena1]);
   			cache_get_value_name_int(idx, "b_colvo",b_info[idx][_colvo]);
   			cache_get_value_name_int(idx, "b_zakaz",b_info[idx][_zakaz]);
   			cache_get_value_name_int(idx, "b_int",b_info[idx][_int]);
   			cache_get_value_name_int(idx, "b_tip",b_info[idx][_tip]);
   			cache_get_value_name_int(idx, "b_prod",b_info[idx][_prod]);
   			cache_get_value_name_int(idx, "b_bank",b_info[idx][_bank]);
   			cache_get_value_name_float(idx, "b_enterX",b_info[idx][b_enter][0]);
      		cache_get_value_name_float(idx, "b_enterY",b_info[idx][b_enter][1]);
   			cache_get_value_name_float(idx, "b_enterZ",b_info[idx][b_enter][2]);
   			cache_get_value_name_float(idx, "b_exitX",b_info[idx][b_exit][0]);
   			cache_get_value_name_float(idx, "b_exitY",b_info[idx][b_exit][1]);
   			cache_get_value_name_float(idx, "b_exitZ",b_info[idx][b_exit][2]);
   			cache_get_value_name_float(idx, "b_menuX",b_info[idx][b_menu][0]);
   			cache_get_value_name_float(idx, "b_menuY",b_info[idx][b_menu][1]);
   			cache_get_value_name_float(idx, "b_menuZ",b_info[idx][b_menu][2]);
   			cache_get_value_name_int(idx, "b_lock",b_info[idx][_lock]);
   			
   			if(b_info[idx][_colvo] <= -1 && b_info[idx][_owned])
            {
                format(string,sizeof(string),"UPDATE accounts SET `key` = '-1',`bank` = '%d' WHERE `name` = '%s'",b_info[idx][_price]+b_info[idx][_bank],b_info[idx][_owner]);
    			mysql_tquery(con_bd, string, "", "");
				b_info[idx][_owned] = 0;
				b_info[idx][_zakaz] = 0;
				strmid(b_info[idx][_owner], "State", 0, strlen("State"), 255);
			}
   			
   			
	    	b_info[idx][_picD] = Create3DTextLabel("ALT\n(Меню)", info, b_info[idx][b_menu][0], b_info[idx][b_menu][1], b_info[idx][b_menu][2]-0.5,11.0,idx,-1);
	        b_info[idx][_picV] = Create3DTextLabel("ALT\n(Выход)", info, b_info[idx][b_exit][0], b_info[idx][b_exit][1], b_info[idx][b_exit][2]-0.5,11.0,idx,-1);

			if(b_info[idx][_tip] != 4) b_info[idx][_pic] = CreateDynamicPickup(1559, 23, b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],-1);
			if(b_info[idx][_tip] != 4) CreateDynamicMapIcon(b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],56,0);
			else CreateDynamicMapIcon(b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],55,0);
			if(b_info[idx][_owned] == 0) format(string,sizeof(string),"%s\n"W"Цена: "I"%d$",b_info[idx][_name],b_info[idx][_price]),b_info[idx][_text] = Create3DTextLabel(string,info,b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],20.0,0,1);
			else if(b_info[idx][_owned] == 1  && b_info[idx][_tip] != 4) format(string,sizeof (string),"%s\n"W"Владелец:"I" %s",b_info[idx][_name],b_info[idx][_owner]),b_info[idx][_text] = Create3DTextLabel(string,info,b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],20.0,0,1);
            else if(b_info[idx][_owned] == 1  && b_info[idx][_tip] == 4) format(string,sizeof (string),"%s\n"W"Владелец:"I" %s"E"\nЗаправиться: NUM2\nЦена бензина: %d$ за 1 литр",b_info[idx][_name],b_info[idx][_owner],b_info[idx][_cena1]),b_info[idx][_text] = Create3DTextLabel(string,info,b_info[idx][b_enter][0], b_info[idx][b_enter][1], b_info[idx][b_enter][2],20.0,0,1);
			totalbiz++;
		}
	}
	printf("Бизнесов загружено: %i за %d мс",totalbiz,GetTickCount()-time);
  	return true;
}
forward biz_save();
public biz_save()
{
	new query[412];
    for(new idx = 0; idx < totalbiz; idx++)
	{
	    mysql_format(con_bd,query,sizeof(query),"UPDATE biz SET `b_name`='%s',`b_owned`='%i',`b_owner`='%s',`b_cena`='%d',`b_prod`='%d',`b_bank`='%d' WHERE `b_id`='%i'",\
 		b_info[idx][_name],b_info[idx][_owned],b_info[idx][_owner],b_info[idx][_cena1],b_info[idx][_prod],b_info[idx][_bank],b_info[idx][_b_id]);
        mysql_tquery(con_bd, query, "","");
	    mysql_format(con_bd,query,sizeof(query),"UPDATE biz SET `b_lock`='%d',`b_colvo`='%d',`b_zakaz`='%d' WHERE `b_id`='%i'",b_info[idx][_lock],b_info[idx][_colvo],b_info[idx][_zakaz],b_info[idx][_b_id]);
		mysql_tquery(con_bd, query, "","");
    }
}
//Дома
forward load_house();
public load_house()
{
 	new time = GetTickCount();
    new rows,value[128];
	cache_get_row_count(rows);
    if(rows)
    {
		for(new idx = rows-1; idx != -1; --idx)
		{
	        cache_get_value_name_int(idx, "h_id",h_info[idx][h_id]);
	        cache_get_value_name_float(idx, "h_enterx",h_info[idx][h_enter][0]);
	        cache_get_value_name_float(idx, "h_entery",h_info[idx][h_enter][1]);
         	cache_get_value_name_float(idx, "h_enterz",h_info[idx][h_enter][2]);
	        cache_get_value_name_float(idx, "h_exitx",h_info[idx][h_exit][0]);
	        cache_get_value_name_float(idx, "h_exity",h_info[idx][h_exit][1]);
	        cache_get_value_name_float(idx, "h_exitz",h_info[idx][h_exit][2]);
	        cache_get_value_name_int(idx, "h_rent",h_info[idx][h_rent]);
	        cache_get_value_name(idx,"h_owner",h_info[idx][h_owner],24);
	        cache_get_value_name_int(idx, "h_value",h_info[idx][h_value]);
	        cache_get_value_name_int(idx, "h_int",h_info[idx][h_int]);
	        cache_get_value_name_int(idx, "h_lock",h_info[idx][h_lock]);
	        cache_get_value_name_int(idx, "h_owned",h_info[idx][h_owned]);
	        cache_get_value_name_int(idx, "h_squar",h_info[idx][h_squar]);
	        format(value,sizeof(value),"Дом №%d\nЦена: %d$",idx,h_info[idx][h_value]);
			h_info[idx][h_text] = Create3DTextLabel(value,white,h_info[idx][h_enter][0], h_info[idx][h_enter][1], h_info[idx][h_enter][2],20.0,0,1);
			h_info[idx][h_icon] = CreateDynamicMapIcon(h_info[idx][h_enter][0], h_info[idx][h_enter][1], h_info[idx][h_enter][2], 31, -1, 0, -1, -1, 400.0);
			if(h_info[idx][h_owned] == 0) h_info[idx][h_pickup] = CreateDynamicPickup(1273, 23, h_info[idx][h_enter][0], h_info[idx][h_enter][1], h_info[idx][h_enter][2],-1);
			else h_info[idx][h_pickup] = CreateDynamicPickup(19522, 23, h_info[idx][h_enter][0], h_info[idx][h_enter][1], h_info[idx][h_enter][2],-1);

            if(h_info[idx][h_rent] <= -1 && h_info[idx][h_owned])
            {
                format(value,sizeof(value),"UPDATE accounts SET `keyh` = '60635',`spawn` = '0',`bank` = '%d' WHERE `name` = '%s'",h_info[idx][h_value],h_info[idx][h_owner]);
    			mysql_tquery(con_bd, value, "", "");
    			
                h_info[idx][h_lock] = 1;
				h_info[idx][h_owned] = 0;
				strmid(h_info[idx][h_owner], "State", 0, strlen("State"), 255);
			}

			//
			update_house(idx);
			totalhouses++;
		}
	}

 	printf("Домов загружено: %d за %i мс",totalhouses,GetTickCount()-time);
    return true;
}

forward save_house(houseid);
public save_house(houseid)
{
    new temp[128], str_house[1024]; //
    mysql_format(con_bd, str_house, sizeof(str_house), "UPDATE `house` SET ");
    format(temp,sizeof(temp),"`h_enterx`= '%f',",h_info[houseid][h_enter][0]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_entery`= '%f',",h_info[houseid][h_enter][1]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_enterz`= '%f',",h_info[houseid][h_enter][2]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_exitx`='%f',",h_info[houseid][h_exit][0]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_exity`='%f',",h_info[houseid][h_exit][1]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_exitz`='%f',",h_info[houseid][h_exit][2]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_rent`='%d',",h_info[houseid][h_rent]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_owner`='%s',",h_info[houseid][h_owner]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_value`='%i',",h_info[houseid][h_value]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_int`='%i',",h_info[houseid][h_int]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_lock`='%i',",h_info[houseid][h_lock]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_owned`='%i',",h_info[houseid][h_owned]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp),"`h_squar`='%i'",h_info[houseid][h_squar]);strcat(str_house,temp,sizeof(str_house));
    format(temp,sizeof(temp)," WHERE h_id='%i'",h_info[houseid][h_id]);strcat(str_house,temp,sizeof(str_house));
    mysql_tquery(con_bd, str_house, "", "");
    return true;
}

stock update_house(h)
{
	new string[128];
    DestroyDynamicMapIcon(h_info[h][h_icon]);
	Delete3DTextLabel(h_info[h][h_text]);
	DestroyDynamicPickup(h_info[h][h_pickup]);
	if(h_info[h][h_owned] == 0)
	{
	    f(string,"Дом"I" №%d\n"W"Цена:"I" %d$"W"\n"W"Используйте: "I"ALT",h,h_info[h][h_value]);
		h_info[h][h_text] = Create3DTextLabel(string,white,h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2],20.0,0,1);
		h_info[h][h_icon] = CreateDynamicMapIcon(h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2], 31, -1, 0, -1, -1, 90.0);
		h_info[h][h_pickup] = CreateDynamicPickup(1273, 23, h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2],-1);
	}
	if(h_info[h][h_owned] == 1)
	{
	    f(string,"Дом"I" №%d\n"W"Владелец:"I" %s"W"\nИспользуйте:"I" ALT",h,h_info[h][h_owner]);
		h_info[h][h_text] = Create3DTextLabel(string,white,h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2],20.0,0,1);
		h_info[h][h_icon] = CreateDynamicMapIcon(h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2], 32, -1, 0, -1, -1, 90.0);
		h_info[h][h_pickup] = CreateDynamicPickup(19522, 23, h_info[h][h_enter][0], h_info[h][h_enter][1], h_info[h][h_enter][2],-1);
	}
	return 1;
}
//Авто

//автомобили
stock LoadVehicles()
{
    new time = GetTickCount();
	if(!fexist("vehicles.cfg")) return printf("файл 'vehicles.cfg' не найден");
	new arrCoords[27][64],strFromFile[256],car,string[128];
	new File:GetFile = fopen("vehicles.cfg");
	while(fread(GetFile, strFromFile))
	{
		if(!strlen(strFromFile)) break;
		split(strFromFile, arrCoords, '|');
		car = CreateVehicle(strval(arrCoords[0]), floatstr(arrCoords[1]), floatstr(arrCoords[2]), floatstr(arrCoords[3]), floatstr(arrCoords[4]), strval(arrCoords[9]), strval(arrCoords[10]), -1);
		veh_info[car][v_model] = strval(arrCoords[0]);
	 	veh_info[car][v_pos][0] = floatstr(arrCoords[1]);
	 	veh_info[car][v_pos][1] = floatstr(arrCoords[2]);
	 	veh_info[car][v_pos][2] = floatstr(arrCoords[3]);
	 	veh_info[car][v_pos][3] = floatstr(arrCoords[4]);
	 	veh_info[car][v_price] = strval(arrCoords[5]);
   		strmid(veh_info[car][v_owner], arrCoords[6],0,strlen(arrCoords[6]), 255);
   		veh_info[car][v_lock] = strval(arrCoords[7]);
	 	veh_info[car][v_color][0] = strval(arrCoords[8]);
		veh_info[car][v_color][1] = strval(arrCoords[9]);
	 	veh_info[car][v_tun][0] = strval(arrCoords[10]);
	 	veh_info[car][v_tun][1] = strval(arrCoords[11]);
	 	veh_info[car][v_tun][2] = strval(arrCoords[12]);
	 	veh_info[car][v_tun][3] = strval(arrCoords[13]);
	 	veh_info[car][v_tun][4] = strval(arrCoords[14]);
	 	veh_info[car][v_tun][5] = strval(arrCoords[15]);
	 	veh_info[car][v_tun][6] = strval(arrCoords[16]);
	 	veh_info[car][v_tun][7] = strval(arrCoords[17]);
	 	veh_info[car][v_tun][8] = strval(arrCoords[18]);
	 	veh_info[car][v_tun][9] = strval(arrCoords[19]);
	 	veh_info[car][v_tun][10] = strval(arrCoords[20]);
	 	veh_info[car][v_tun][11] = strval(arrCoords[21]);
	 	veh_info[car][v_tun][12] = strval(arrCoords[22]);
	 	veh_info[car][v_if_buy] = 1;
	 	f(string, "Владелец: %s", arrCoords[6]);
        player_owner[car] = CreateDynamic3DTextLabel(string, error, 0.0, 0.0, 0.5, 30.0, INVALID_PLAYER_ID, car, 1);
        for (new i;i<13; i++) if(veh_info[car][v_tun][i] !=0) AddVehicleComponent (car, veh_info[car][v_tun][i]);
        CAR++;
	}
	fclose(GetFile);
	printf("Авто загружено: %d за %i мс",CAR,GetTickCount()-time);
	return true;
}
stock VehSpwn(vehicleid)
{
    if(veh_info[vehicleid][v_if_buy] == 1)
	{
	    for (new i;i<13; i++) if(veh_info[vehicleid][v_tun][i] !=0) AddVehicleComponent (vehicleid, veh_info[vehicleid][v_tun][i]);
	    SetVehiclePos(vehicleid, veh_info[vehicleid][v_pos][0], veh_info[vehicleid][v_pos][1], veh_info[vehicleid][v_pos][2]);
		SetVehicleZAngle(vehicleid, veh_info[vehicleid][v_pos][3]);
		if(veh_info[vehicleid][v_lock] == 1)
		{
			veh_info[vehicleid][v_lock] = 1;
			GetVehicleParamsEx(vehicleid,engine,lights,alarm,doors,bonnet,boot,objective);
			SetVehicleParamsEx(vehicleid,engine,lights,alarm,1,bonnet,boot,objective);
		}
		else
		{
			veh_info[vehicleid][v_lock] = 0;
			GetVehicleParamsEx(vehicleid,engine,lights,alarm,doors,bonnet,boot,objective);
			SetVehicleParamsEx(vehicleid,engine,lights,alarm,0,bonnet,boot,objective);
		}
	}
	return true;
}
stock SaveVehicles()
{
    if(!fexist("vehicles.cfg")) return printf("file 'vehicles.cfg' not found");
	new string[256],File:GetFile = fopen("vehicles.cfg", io_write);
	for(new i=0; i<MAX_VEHICLES; i++)
	{
    	if(veh_info[i][v_if_buy] == 0) continue;
		f(string, "%d|%f|%f|%f|%f|%d|%s|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d|%d\n",
		veh_info[i][v_model],veh_info[i][v_pos][0],veh_info[i][v_pos][1],veh_info[i][v_pos][2],veh_info[i][v_pos][3],veh_info[i][v_price],
		veh_info[i][v_owner],veh_info[i][v_lock],veh_info[i][v_color][0],veh_info[i][v_color][1],
		veh_info[i][v_tun][0],veh_info[i][v_tun][1],
		veh_info[i][v_tun][2],veh_info[i][v_tun][3],
		veh_info[i][v_tun][4],veh_info[i][v_tun][5],
		veh_info[i][v_tun][6],veh_info[i][v_tun][7],
		veh_info[i][v_tun][8],veh_info[i][v_tun][9],
		veh_info[i][v_tun][10],veh_info[i][v_tun][11],
		veh_info[i][v_tun][12]);
		fwrite(GetFile, string);
	}
	fclose(GetFile);
	return true;
}


stock lockCar(carid,info_doors) //1 закрыты 0 открыты
{
    GetVehicleParamsEx(carid,engine,lights,alarm,doors,bonnet,boot,objective);
	SetVehicleParamsEx(carid,engine,lights,alarm,info_doors,bonnet,boot,objective);
}




//Используемые stock:

player_stats(playerid)
{
    new str[356],string[484];
	format(str,sizeof(str),""W"Имя:\t\t\t\t %s\n",get_name(playerid)); strcat(string,str);
	format(str,sizeof(str),"Уровень:\t\t\t %d\n",p_info[playerid][level]); strcat(string,str);
	format(str,sizeof(str),"Очки опыта:\t\t\t %d/%d\n",p_info[playerid][exp],(p_info[playerid][level]+1)*4); strcat(string,str);
	format(str,sizeof(str),"Деньги:\t\t\t %d\n\n",p_info[playerid][cash]); strcat(string,str);
	format(str,sizeof(str),"Жильё:\t\t\t %s{ffffff}\n",(p_info[playerid][keyh] != 60635)?("Имеется"):("Не имеется")); strcat(string,str);
	format(str,sizeof(str),"Бизнес:\t\t\t %s{ffffff}\n",(p_info[playerid][key] != -1)?("Имеется"):("Не имеется")); strcat(string,str);
	format(str,sizeof(str),"Транспорт:\t\t\t %s{ffffff}\n\n",(400<=GetVehicleModel(p_info[playerid][veh_id])<=611)?(VehicleNames[GetVehicleModel(p_info[playerid][veh_id])-400]):("Не имеется")); strcat(string,str);
    format(str,sizeof(str),"Организация:\t\t\t "W"%s{ffffff}\n",fracName(playerid)); strcat(string,str);
    format(str,sizeof(str),"Ранг:\t\t\t\t "W"%s %d{ffffff}\n\n",RankName(playerid),p_info[playerid][rang]); strcat(string,str);
    format(str,sizeof(str),"Материалы:\t\t\t "W"%d кг{ffffff}\n",p_info[playerid][material]); strcat(string,str);
    format(str,sizeof(str),"Патроны:\t\t\t "W"%d шт{ffffff}\n\n\n",p_info[playerid][patr]); strcat(string,str);
	format(str,sizeof(str),"Дата регистрации:\t\t %s\n",p_info[playerid][reg_data]); strcat(string,str);
	return ShowPlayerDialog(playerid,1000,DIALOG_STYLE_MSGBOX,"Статистика",string,"Назад","Закрыть");
}

remove_build(playerid)
{
	//Удаление объектов з51 забор
	RemoveBuildingForPlayer(playerid, 1411, 347.1953, 1799.2656, 18.7578, 0.25);
	RemoveBuildingForPlayer(playerid, 1411, 342.9375, 1796.2891, 18.7578, 0.25);
	RemoveBuildingForPlayer(playerid, 16094, 191.1406, 1870.0391, 21.4766, 0.25);
	//Баллас
    RemoveBuildingForPlayer(playerid, 673, 2227.2031, -1444.5000, 22.9609, 0.25);
	RemoveBuildingForPlayer(playerid, 5682, 2241.4297, -1433.6719, 31.2813, 0.25);
	RemoveBuildingForPlayer(playerid, 700, 2226.5156, -1426.7656, 23.1172, 0.25);
	RemoveBuildingForPlayer(playerid, 673, 2243.5703, -1423.6094, 22.9609, 0.25);
	RemoveBuildingForPlayer(playerid, 620, 2256.4063, -1444.5078, 23.1016, 0.25);
	RemoveBuildingForPlayer(playerid, 3593, 2261.7734, -1441.1016, 23.5000, 0.25);
}
set_TextDrawPlayer(playerid)
{
	skinTextDraw[playerid][0] = TextDrawCreate(346.823486, 381.499969, "LD_BEAT:right");
	TextDrawLetterSize(skinTextDraw[playerid][0], 0.000000, 0.000000);
	TextDrawTextSize(skinTextDraw[playerid][0], 26.823524, 23.333314);
	TextDrawFont(skinTextDraw[playerid][0], 4);
	TextDrawSetSelectable(skinTextDraw[playerid][0], true);

	skinTextDraw[playerid][1] = TextDrawCreate(259.764678, 380.916687, "LD_BEAT:left");
	TextDrawLetterSize(skinTextDraw[playerid][1], 0.000000, 0.000000);
	TextDrawTextSize(skinTextDraw[playerid][1], 27.535293, 23.333312);
	TextDrawFont(skinTextDraw[playerid][1], 4);
	TextDrawSetSelectable(skinTextDraw[playerid][1], true);

	skinTextDraw[playerid][2] = TextDrawCreate(291.764892, 380.916870, "ld_grav:playy");
	TextDrawTextSize(skinTextDraw[playerid][2], 50.784942, 24.500003);
	TextDrawFont(skinTextDraw[playerid][2], 4);
	TextDrawSetSelectable(skinTextDraw[playerid][2], true);
	
		//спидометр
	speedTD[playerid][0] = CreatePlayerTextDraw(playerid, 130.717422, 387.333374, "ld_pool:ball");
	PlayerTextDrawTextSize(playerid, speedTD[playerid][0], 42.166915, 46.666687);
	PlayerTextDrawColor(playerid, speedTD[playerid][0], -2139062017);
	PlayerTextDrawFont(playerid, speedTD[playerid][0], 4);

	speedTD[playerid][1] = CreatePlayerTextDraw(playerid, 135.982421, 430.000183, "ld_pool:ball");
	PlayerTextDrawTextSize(playerid, speedTD[playerid][1], 11.894592, 12.083312);
	PlayerTextDrawColor(playerid, speedTD[playerid][1], 8388863);
	PlayerTextDrawFont(playerid, speedTD[playerid][1], 4);

	speedTD[playerid][2] = CreatePlayerTextDraw(playerid, 139.619323, 413.583343, "ld_pool:ball");
	PlayerTextDrawTextSize(playerid, speedTD[playerid][2], -24.363098, 24.500000);
	PlayerTextDrawColor(playerid, speedTD[playerid][2], -2139062017);
	PlayerTextDrawFont(playerid, speedTD[playerid][2], 4);

	speedTD[playerid][3] = CreatePlayerTextDraw(playerid, 136.808212, 389.083404, "150");
	PlayerTextDrawLetterSize(playerid, speedTD[playerid][3], 0.448594, 3.624165);
	PlayerTextDrawAlignment(playerid, speedTD[playerid][3], 1);
	PlayerTextDrawColor(playerid, speedTD[playerid][3], -1);
	PlayerTextDrawSetShadow(playerid, speedTD[playerid][3], 0);
	PlayerTextDrawSetOutline(playerid, speedTD[playerid][3], 1);
	PlayerTextDrawBackgroundColor(playerid, speedTD[playerid][3], 51);
	PlayerTextDrawFont(playerid, speedTD[playerid][3], 2);

	speedTD[playerid][4] = CreatePlayerTextDraw(playerid, 141.493408, 418.833312, "1000");
	PlayerTextDrawLetterSize(playerid, speedTD[playerid][4], 0.277584, 1.063333);
	PlayerTextDrawAlignment(playerid, speedTD[playerid][4], 1);
	PlayerTextDrawColor(playerid, speedTD[playerid][4], -1);
	PlayerTextDrawSetShadow(playerid, speedTD[playerid][4], 0);
	PlayerTextDrawSetOutline(playerid, speedTD[playerid][4], 1);
	PlayerTextDrawBackgroundColor(playerid, speedTD[playerid][4], 51);
	PlayerTextDrawFont(playerid, speedTD[playerid][4], 1);

	speedTD[playerid][5] = CreatePlayerTextDraw(playerid, 117.130340, 417.666656, "100");
	PlayerTextDrawLetterSize(playerid, speedTD[playerid][5], 0.301947, 1.564999);
	PlayerTextDrawAlignment(playerid, speedTD[playerid][5], 1);
	PlayerTextDrawColor(playerid, speedTD[playerid][5], -1);
	PlayerTextDrawSetShadow(playerid, speedTD[playerid][5], 0);
	PlayerTextDrawSetOutline(playerid, speedTD[playerid][5], 1);
	PlayerTextDrawBackgroundColor(playerid, speedTD[playerid][5], 51);
	PlayerTextDrawFont(playerid, speedTD[playerid][5], 2);




	skin_price[playerid][0] = TextDrawCreate(112.913604, 184.916656, "LD_BEAT:right");
	TextDrawLetterSize(skin_price[playerid][0], 0.000000, 0.000000);
	TextDrawTextSize(skin_price[playerid][0],  30.922416, 26.833347);
	TextDrawFont(skin_price[playerid][0], 4);
	TextDrawSetSelectable(skin_price[playerid][0], true);

	skin_price[playerid][1] = TextDrawCreate(39.824325, 184.916656, "LD_BEAT:left");
	TextDrawLetterSize(skin_price[playerid][1], 0.000000, 0.000000);
	TextDrawTextSize(skin_price[playerid][1],  30.922416, 26.833347);
	TextDrawFont(skin_price[playerid][1], 4);
	TextDrawSetSelectable(skin_price[playerid][1], true);

	skin_price[playerid][2] = TextDrawCreate(68.404098, 209.416717, "ld_chat:thumbup");
	TextDrawLetterSize(skin_price[playerid][2], 0.000000, 0.000000);
	TextDrawTextSize(skin_price[playerid][2],  17.335277, 21.000005);
	TextDrawFont(skin_price[playerid][2], 4);
	TextDrawSetSelectable(skin_price[playerid][2], true);

	skin_price[playerid][3] = TextDrawCreate(95.109802, 209.416702, "ld_chat:thumbdn");
	TextDrawLetterSize(skin_price[playerid][3], 0.000000, 0.000000);
	TextDrawTextSize(skin_price[playerid][3],  18.272338, 20.416671);
	TextDrawFont(skin_price[playerid][3], 4);
	TextDrawSetSelectable(skin_price[playerid][3], true);

	skin_price[playerid][4] = TextDrawCreate(71.683746, 179.083282, "223500");
	TextDrawLetterSize( skin_price[playerid][4],  0.261185, 3.023335);
	TextDrawAlignment(skin_price[playerid][4], 1);
	TextDrawColor(skin_price[playerid][4], -1);
	TextDrawSetShadow( skin_price[playerid][4], 0);
	TextDrawSetOutline (skin_price[playerid][4], 1);
	TextDrawBackgroundColor(skin_price[playerid][4], 51);
	TextDrawFont(skin_price[playerid][4], 2);

    GangWar[playerid] = CreatePlayerTextDraw(playerid, 406.000000, 304.000000, "_");
	PlayerTextDrawBackgroundColor(playerid, GangWar[playerid], 255);
	PlayerTextDrawFont(playerid, GangWar[playerid], 2);
	PlayerTextDrawLetterSize(playerid, GangWar[playerid], 0.400000, 2.000000);
	PlayerTextDrawColor(playerid, GangWar[playerid], info);
	PlayerTextDrawSetOutline(playerid, GangWar[playerid], 1);
	PlayerTextDrawSetProportional(playerid, GangWar[playerid], 1);
	PlayerTextDrawSetShadow(playerid, GangWar[playerid], 1);
}

stock ConvertTime(number)
{
	new hours = 0, mins = 0, secs = 0, string[128];
	hours = floatround(number/3600);
	mins = floatround((number/60) - (hours * 60));
	secs = floatround(number - ((hours * 3600)+(mins * 60)));
	if(hours > 0) format(string, sizeof(string), "%d:%02d:%02d", hours, mins, secs);
	else format(string, sizeof(string), "%d:%02d", mins, secs);
	return string;
}
set_money(playerid, money)//Выдача денег ( с информацией в GameText + звук отриц/полож )
{
	new string[55];
    if(money > 0) p_info[playerid][cash] += money, format(string, sizeof(string), "~n~~n~~n~~n~~n~~n~~g~+%d$", money),PlayerPlaySound(playerid, 1083, 0.0, 0.0, 0.0);
    else if(money < 0) p_info[playerid][cash] += money, format(string, sizeof(string), "~n~~n~~n~~n~~n~~n~~r~%d$", money),PlayerPlaySound(playerid, 1085 , 0.0, 0.0, 0.0);
	GameTextForPlayer(playerid, string, 1000, 3);
	ResetPlayerMoney(playerid),GivePlayerMoney(playerid,p_info[playerid][cash]);
	return 1;
}
forward OnPlayerExitCar(playerid);
public OnPlayerExitCar(playerid)
{
	new str[12];
	format(str, sizeof (str), "~r~%d SEC",ExitCount[playerid]);//можете убрать
	GameTextForPlayer(playerid, str, 1000, 4);//можете убрать
	if(ExitCount[playerid] == 1) EndPlayerCasualJob(playerid);
 	else ExitCount[playerid] -= 1;
	return true;
}

stock EndPlayerCasualJob(playerid)
{
    if(GetPlayerRentBus[playerid] != (-1))
	{

	    KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
		TogglePlayerControllable(playerid, true);
        RemovePlayerFromVehicle(playerid);
		//
		new string[124],Float:healths;
		GetVehicleHealth(GetPlayerRentBus[playerid], healths);
		SendClientMessage(playerid, info, "Рабочий день завершен!");
        format(string, sizeof(string), "Заработано: "I"%d$",GetPVarInt(playerid, "@flight_num")*50);
		SendClientMessage(playerid, white, string);
		format(string, sizeof(string), "Количество пассажиров:"I" %d | Куплено билетов на %d$",GetPVarInt(playerid, "@passenger"),GetPVarInt(playerid, "@payment")*GetPVarInt(playerid, "@passenger"));
		SendClientMessage(playerid, white, string);
		format(string, sizeof(string), "За ремонт автобуса: "E"-%d$",floatround(floatsub(1000.0, healths))*2);
		SendClientMessage(playerid, white, string);
		set_money(playerid,(GetPVarInt(playerid, "@flight_num")*50) + GetPVarInt(playerid, "@payment")*GetPVarInt(playerid, "@passenger")- (floatround(floatsub(1000.0, healths))*2)); //количество чекпоинт*50$ + пассажиры*стоимость проезда
		//
		
		DisablePlayerRaceCheckpoint(playerid);
        SetPVarInt(playerid, "race_check",-1);
        SetPVarInt(playerid, "@flight_num",0);
        SetPVarInt(playerid, "@passenger",0);
        SetPVarInt(playerid, "@startJob",0);
        DestroyDynamic3DTextLabel(INFO_VEH[GetPlayerRentBus[playerid]]);
		
		SetVehicleToRespawn(GetPlayerRentBus[playerid]);
		bus_info[GetPlayerRentBus[playerid]] = 0;
		GetPlayerRentBus[playerid] = -1;
	}
	if(GetPlayerRentTaxi[playerid] != (-1))
	{

	    KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
		TogglePlayerControllable(playerid, true);
        RemovePlayerFromVehicle(playerid);
		//
		new string[124];
		SendClientMessage(playerid, info, "Рабочий день завершен!");
        format(string, sizeof(string), "Заработано: "I"%d$",GetPVarInt(playerid, "@passenger")*GetPVarInt(playerid, "@payment"));
		SendClientMessage(playerid, white, string);
		format(string, sizeof(string), "Количество пассажиров:"I" %d",GetPVarInt(playerid, "@passenger"));
		SendClientMessage(playerid, white, string);
		//

		DisablePlayerRaceCheckpoint(playerid);
        SetPVarInt(playerid, "race_check",-1);
        SetPVarInt(playerid, "@flight_num",0);
        SetPVarInt(playerid, "@passenger",0);
        SetPVarInt(playerid, "@startJob",0);
        DestroyDynamic3DTextLabel(INFO_VEH[GetPlayerRentTaxi[playerid]]);

		SetVehicleToRespawn(GetPlayerRentTaxi[playerid]);
		taxi_info[GetPlayerRentTaxi[playerid]] = 0;
		GetPlayerRentTaxi[playerid] = -1;
	}
	if(GetCarDelivery[playerid] != (-1))
	{
	
	    if(GetPVarInt(playerid, "biz_zakaz") != -1)
		{
			b_info[GetPVarInt(playerid, "biz_zakaz")][_status] = 0,SetPVarInt(playerid, "biz_zakaz",-1);
			foreach(Player, i) if(p_info[i][job] == 3) SendClientMessage(i, server, "Доступен новый заказ (/list)");
		}
	    if(loadCar[GetCarDelivery[playerid]] > 0)
	    {
			set_money(playerid, -500);
			SendClientMessage(playerid, error, "Вы не доставили груз! С вас списан штраф в размере 500$");
		}
	    
	    KillTimer(GetPVarInt(playerid, "ExitCarTimer"));
		TogglePlayerControllable(playerid, true);
        RemovePlayerFromVehicle(playerid);

		DisablePlayerRaceCheckpoint(playerid);
		SendClientMessage(playerid, info, "Рабочий день завершен!");
		SetVehicleToRespawn(GetCarDelivery[playerid]);
		dlv_info[GetCarDelivery[playerid]] = 0;
		GetCarDelivery[playerid] = -1;
	}
	return 1;
}
stock distance_chat(playerid,Float:Radi=10.0,color,text[])
{
    new Float:pos[3];
    GetPlayerPos(playerid,pos[0],pos[1],pos[2]);
    for(new i;i<GetMaxPlayers();i++)
    {
        if(IsPlayerConnected(i))
        if(IsPlayerInRangeOfPoint(i,Radi,pos[0],pos[1],pos[2])) if(GetPlayerVirtualWorld(i) == GetPlayerVirtualWorld(playerid) && GetPlayerInterior(playerid) == GetPlayerInterior(i))SendClientMessage(i,color,text);
    }
}


///ГангЗоны
stock capt_start(familyone, familytwo)
{
	foreach(new i: Player)
	{
		if(!IsPlayerConnected(i)) continue;
		if(p_info[i][member] == familyone || p_info[i][member] == familytwo)
		{
		    PlayerTextDrawShow(i, GangWar[i]);
			drawcapt[i] = true;
			get_capture = true;
		}
	}
}
stock gz_timer()
{
    if(FrakCD > 0 && get_capture == false) FrakCD--;
	for(new i = 0; i < sizeof(gangzone_Info); i++) if(GZSafeTime[i] > 0) 	GZSafeTime[i]--;//отнимаем секунды
	
	new string[256];
	for(new i = 0; i < sizeof(gangzone_Info); i++)
	{
		if(ZoneOnBattle[i] == 1 && get_capture == true)
		{
			format(string,sizeof(string),"TIME: %s~n~~n~%s: %d~n~%s: %d",ConvertTime(GZSafeTime[i]),gang_name_color(gangzone_Info[i][gang_attack]),capture_info[gangzone_Info[i][gang_attack]][score],gang_name_color(gangzone_Info[i][gang_terr]),capture_info[gangzone_Info[i][gang_terr]][score]);
   			foreach(new x: Player)
			{
				if(!IsPlayerConnected(x) && drawcapt[x] == true) continue;
				if(p_info[x][member] == gangzone_Info[i][gang_attack] || p_info[x][member] == gangzone_Info[i][gang_terr])
				{
					PlayerTextDrawSetString(x, GangWar[x], string);
					GangZoneFlashForPlayer(x,GangZone[i],gz_color_Attack(gangzone_Info[i][gang_attack]));
					drawcapt[x] = true;
				}
			}
		}
		if(ZoneOnBattle[i] == 1 && GZSafeTime[i] == 0)
		{
			if(capture_info[gangzone_Info[i][gang_attack]][score] == capture_info[gangzone_Info[i][gang_terr]][score])
			{
				new zh = gangzone_Info[i][gang_attack];
				new zj = i;
				new zg = gangzone_Info[i][gang_terr];
				format(string, 128, "Вы захватили новую территорию, которая находилась под контролем банды %s",gang_name(zg));
				SendFamilyMessage(gangzone_Info[i][gang_attack],accept, string);
				format(string, 128, "Вам не удалось отстоять свою территорию, теперь эта территория под контролем банды %s",gang_name(zh));
				SendFamilyMessage(gangzone_Info[i][gang_terr],error, string);
				ZoneOnBattle[i] = 0;
				get_capture = false;
				capt_end(gangzone_Info[i][gang_attack], gangzone_Info[i][gang_terr]);
				capture_info[gangzone_Info[i][gang_attack]][captureid] =
				capture_info[gangzone_Info[i][gang_attack]][capture] =
				capture_info[gangzone_Info[i][gang_attack]][score] =
				capture_info[gangzone_Info[i][gang_terr]][captureid] =
				capture_info[gangzone_Info[i][gang_terr]][capture] =
				capture_info[gangzone_Info[i][gang_terr]][score] =
				capture_info[gangzone_Info[i][gang_attack]][gangnumber] =
				capture_info[gangzone_Info[i][gang_terr]][gangnumber] = 0;
				gangzone_Info[zj][gang_terr] = zh;
				gangzone_Info[zj][gang_attack] = 0;
				GangZoneStopFlashForAll(GangZone[zj]);
				GangZoneHideForAll(GangZone[zj]);
				GangZoneShowForAll(GangZone[zj],gz_color(zj));
				save_gz(zj);
			}
			else if(capture_info[gangzone_Info[i][gang_attack]][score] > capture_info[gangzone_Info[i][gang_terr]][score])
			{
				new zx = gangzone_Info[i][gang_attack];
				new zl = i;
				format(string, 128, "Вы захватили новую территорию, которая находилась под контролем банды %s", gang_name(gangzone_Info[i][gang_terr]));
				SendFamilyMessage(gangzone_Info[i][gang_attack],accept, string);
				format(string, 128, "Вам не удалось отстоять свою территорию, теперь эта территория под контролем банды %s",gang_name(zx));
				SendFamilyMessage(gangzone_Info[i][gang_terr],error, string);
				ZoneOnBattle[zl] = 0;
				capt_end(gangzone_Info[zl][gang_attack], gangzone_Info[zl][gang_terr]);
				capture_info[gangzone_Info[zl][gang_attack]][captureid] =
				capture_info[gangzone_Info[zl][gang_attack]][capture] =
				capture_info[gangzone_Info[zl][gang_attack]][score] =
				capture_info[gangzone_Info[zl][gang_terr]][captureid] =
				capture_info[gangzone_Info[zl][gang_terr]][capture] =
				capture_info[gangzone_Info[zl][gang_terr]][score] =
				capture_info[gangzone_Info[i][gang_attack]][gangnumber] =
				capture_info[gangzone_Info[i][gang_terr]][gangnumber] = 0;
				gangzone_Info[zl][gang_terr] = zx;
				gangzone_Info[zl][gang_attack] = 0;
				get_capture = false;
				GangZoneStopFlashForAll(GangZone[zl]);
				GangZoneHideForAll(GangZone[zl]);
				GangZoneShowForAll(GangZone[zl],gz_color(zl));
				save_gz(zl);
			}
			else if(capture_info[gangzone_Info[i][gang_attack]][score] < capture_info[gangzone_Info[i][gang_terr]][score])
			{
				new zx = gangzone_Info[i][gang_terr];
				new zl = i;
				SendFamilyMessage(gangzone_Info[i][gang_attack],error, "Вам не удалось захватить новую территорию");
				SendFamilyMessage(gangzone_Info[i][gang_terr],accept,"Вы отстояли свою территорию");
				ZoneOnBattle[zl] = 0;
				capt_end(gangzone_Info[zl][gang_attack], gangzone_Info[zl][gang_terr]);
				capture_info[gangzone_Info[zl][gang_attack]][captureid] =
				capture_info[gangzone_Info[zl][gang_attack]][capture] =
				capture_info[gangzone_Info[zl][gang_attack]][score] =
				capture_info[gangzone_Info[zl][gang_terr]][captureid] =
				capture_info[gangzone_Info[zl][gang_terr]][capture] =
				capture_info[gangzone_Info[zl][gang_terr]][score] =
				capture_info[gangzone_Info[i][gang_attack]][gangnumber] =
				capture_info[gangzone_Info[i][gang_terr]][gangnumber] = 0;
				get_capture = false;
				gangzone_Info[zl][gang_terr] = zx;
				gangzone_Info[zl][gang_attack] = 0;
				GangZoneStopFlashForAll(GangZone[zl]);
				GangZoneHideForAll(GangZone[zl]);
				GangZoneShowForAll(GangZone[zl],gz_color(zl));
				save_gz(zl);
			}
		}
	}
	for(new i = 0; i < sizeof(gangzone_Info); i++)
	{
		for(new z = 0; z < 20; z++)
		{
			on_zone[i][z] = 0;
		}
	}
	return 1;
}

stock capt_end(familyone, familytwo)
{
	foreach(new i: Player)
	{
		if(p_info[i][member] == familyone || p_info[i][member] == familytwo)
		{
		    PlayerTextDrawHide(i, GangWar[i]);
			drawcapt[i] = false;
		}
	}
}
stock gz_color_Attack(i)
	return
		(i == 11) ? (0xFF00EB65) :
		(i == 12) ? (0x0087FF65) :
		(i == 14) ? (0xFFC80065) :
		(i == 10) ? (0x00FF1465) :
		(i == 13) ? (0x00EBFF65) : (0xFFFFFF40);
stock gz_color(fractionid)
	return
		(gangzone_Info[fractionid][gang_terr] == 11) ? (0xFF00EB65) :
		(gangzone_Info[fractionid][gang_terr] == 12) ? (0x0087FF65) :
		(gangzone_Info[fractionid][gang_terr] == 14) ? (0xFFC80065) :
		(gangzone_Info[fractionid][gang_terr] == 10) ? (0x00FF1465) :
		(gangzone_Info[fractionid][gang_terr] == 13) ? (0x00EBFF65) : (0xFFFFFF40);

stock gang_name(fractionid)
{
	new string[20];
	switch(fractionid)
	{
		case 10: format(string, sizeof(string), "Grove Street");
		case 11: format(string, sizeof(string), "E.S Ballas");
		case 12: format(string, sizeof(string), "The Rifa");
		case 13: format(string, sizeof(string), "El Corona");
		case 14: format(string, sizeof(string), "LS Vagos");
		default: format(string, sizeof(string), "Free Terr");
	}
	return string;
}
stock gang_name_color(fractionid)
{
	new string[20];
	switch(fractionid)
	{
		case 10: format(string, sizeof(string), "~g~Grove Street");
		case 11: format(string, sizeof(string), "~p~E.S Ballas");
		case 12: format(string, sizeof(string), "~b~The Rifa");
		case 13: format(string, sizeof(string), "~b~El Corona");
		case 14: format(string, sizeof(string), "~y~LS Vagos");
		default: format(string, sizeof(string), "~g~Free Terr");
	}
	return string;
}

stock IsInAllowed(playerid)
{
	for(new i = 0; i < sizeof(allowedfactions); i++)
	{
		if(p_info[playerid][member] == allowedfactions[i] || p_info[playerid][leader] == allowedfactions[i]) return 1;
	}
	return 0;
}
stock IsPlayerInBandOnline(fractionid)
{
	new np;
	foreach(new i: Player)
	{
		if(!IsPlayerConnected(i)) continue;
		if(p_info[i][member] == fractionid || p_info[i][leader] == fractionid) np++;
	}
	return np;
}

stock IsPlayerToSquare(playerid,Float:min_x,Float:min_y,Float:max_x,Float:max_y)
{
	new Float:xxp,Float:yyp,Float:zzp;
	GetPlayerPos(playerid, xxp, yyp, zzp);
	if((xxp <= max_x && xxp >= min_x) && (yyp <= max_y && yyp >= min_y)) return 1;
	return 0;
}

//Организации
stock fracSpawn(playerid)
{
    SetPlayerInterior(playerid,spawnFrac[p_info[playerid][member]-1][in]);
	SetPlayerVirtualWorld(playerid,spawnFrac[p_info[playerid][member]-1][vw]);
	SetPlayerPos(playerid,spawnFrac[p_info[playerid][member]-1][f_x],spawnFrac[p_info[playerid][member]-1][f_y],spawnFrac[p_info[playerid][member]-1][f_z]);
	SetPlayerFacingAngle(playerid,spawnFrac[p_info[playerid][member]-1][f_a]);
	SetCameraBehindPlayer(playerid);
	return 1;
}
stock fracName(t)
{
	new fname[42];
	if(p_info[t][member] == 0) fname =  "Гражданский";
 	if(p_info[t][member] == 1) fname =  "Полиция Лос Сантос";
 	if(p_info[t][member] == 2) fname =  "Полиция Сан Фиерро";
 	if(p_info[t][member] == 3) fname =  "Полиция Лас Вентурас";
 	if(p_info[t][member] == 4) fname =  "Федеральное бюро расследований";
 	if(p_info[t][member] == 5) fname =  "Армия";
 	if(p_info[t][member] == 6) fname =  "Радиоцентр";
 	if(p_info[t][member] == 7) fname =  "Русская мафия";
 	if(p_info[t][member] == 8) fname =  "La Cosa Nostra";
 	if(p_info[t][member] == 9) fname =  "Yakuza";
 	if(p_info[t][member] == 10) fname =  "Grove St.";
 	if(p_info[t][member] == 11) fname =  "E.S Ballas";
 	if(p_info[t][member] == 12) fname =  "The Rifa";
 	if(p_info[t][member] == 13) fname =  "El`Corona";
 	if(p_info[t][member] == 14) fname =  "Vagos Gang";
 	return fname;
}
stock RankName(playerid)
{
	new atext[30];
	if(p_info[playerid][member] == 1 || p_info[playerid][member] == 2 || p_info[playerid][member] == 3)
	{
		switch(p_info[playerid][rang])
		{
			case 10: atext = "Генерал";
			case 9: atext = "Полковник";
			case 8: atext = "Подполковник";
			case 7: atext = "Майор";
			case 6: atext = "Капитан";
			case 5: atext = "Ст.Лейтенант";
			case 4: atext = "Лейтенант";
			case 3: atext = "Ст.Сержант";
			case 2: atext = "Сержант";
			case 1: atext = "Рядовой";
		}
	}
	if(p_info[playerid][member] == 4)
	{
		switch(p_info[playerid][rang])
		{
			case 10: atext = "Директор";
			case 9: atext = "Зам.Директора";
			case 8: atext = "Инспектор";
			case 7: atext = "Глава отдела КСО";
			case 6: atext = "Глава отдела ГНК";
			case 5: atext = "Ст.Агент";
			case 4: atext = "Агент КСО";
			case 3: atext = "Агент ГНК";
			case 2: atext = "Мл.Агент";
			case 1: atext = "Стажёр";
		}
	}
	if(p_info[playerid][member] == 5)
	{
		switch(p_info[playerid][rang])
		{
		        case 10: atext = "Генерал";
		        case 9: atext = "Полковник";
				case 8: atext = "Майор";
				case 7: atext = "Лейтенант";
				case 6: atext = "Прапорщик";
				case 5: atext = "Старшина";
				case 4: atext = "Ст. Сержан";
				case 3: atext = "Сержант";
				case 2: atext = "Ефрейтор";
				case 1: atext = "Рядовой";
		}
	}
	if(p_info[playerid][member] == 6)
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Директор радиоцентра";
				case 9: atext = "Зам.Директора";
				case 8: atext = "гл. Оператор";
				case 7: atext = "Оператор";
				case 6: atext = "гл. Редактор";
				case 5: atext = "Редактор";
				case 4: atext = "Старший журналист";
				case 3: atext = "Журналист";
				case 2: atext = "ст. Стажёр";
				case 1: atext = "Стажёр";
		}
	}
	if(p_info[playerid][member] == 7)
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Вор в законе";
				case 9: atext = "Фраер";
				case 8: atext = "Авторитет";
				case 7: atext = "Следящий за всем шнырями";
				case 6: atext = "Шнырь всем шнырям шнырь";
				case 5: atext = "Еще чуть старше шнырь";
				case 4: atext = "Старший шнырь";
				case 3: atext = "Главный над главным по шнырям";
				case 2: atext = "Главный по шнырям";
				case 1: atext = "Шнырь";
		}
	}
	if(p_info[playerid][member] == 8)
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Джекич Ан";
				case 9: atext = "Хунк Кван";
				case 8: atext = "Хунк Кван";
				case 7: atext = "Хунк Кван";
				case 6: atext = "Хунк Кван";
				case 5: atext = "Хунк Кван";
				case 4: atext = "Хунк Кван";
				case 3: atext = "Хунк Кван";
				case 2: atext = "Шо Хай";
				case 1: atext = "Сей Коу Джай";
		}
	}
	if(p_info[playerid][member] == 9)
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Дон";
				case 9: atext = "Новато 9 ранга";
				case 8: atext = "Новато 8 ранга";
				case 7: atext = "Новато 7 ранга";
				case 6: atext = "Новато 6 ранга";
				case 5: atext = "Новато 5 ранга";
				case 4: atext = "Новато 4 ранга";
				case 3: atext = "Новато 3 ранга";
				case 2: atext = "Новато 2 ранга";
				case 1: atext = "Новато 1 ранга";
		}
	}
	if(p_info[playerid][member] == 10)//Грув
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Бандит";
				case 9: atext = "Бандит 9 ранга";
				case 8: atext = "Бандит 8 ранга";
				case 7: atext = "Бандит 7 ранга";
				case 6: atext = "Бандит 6 ранга";
				case 5: atext = "Бандит 5 ранга";
				case 4: atext = "Бандит 4 ранга";
				case 3: atext = "Бандит 3 ранга";
				case 2: atext = "Бандит 2 ранга";
				case 1: atext = "Бандит 1 ранга";
		}
	}
	if(p_info[playerid][member] == 11)//Баллас
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Бандит";
				case 9: atext = "Бандит 9 ранга";
				case 8: atext = "Бандит 8 ранга";
				case 7: atext = "Бандит 7 ранга";
				case 6: atext = "Бандит 6 ранга";
				case 5: atext = "Бандит 5 ранга";
				case 4: atext = "Бандит 4 ранга";
				case 3: atext = "Бандит 3 ранга";
				case 2: atext = "Бандит 2 ранга";
				case 1: atext = "Бандит 1 ранга";
		}
	}
	if(p_info[playerid][member] == 12)//Рифа
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Бандит";
				case 9: atext = "Бандит 9 ранга";
				case 8: atext = "Бандит 8 ранга";
				case 7: atext = "Бандит 7 ранга";
				case 6: atext = "Бандит 6 ранга";
				case 5: atext = "Бандит 5 ранга";
				case 4: atext = "Бандит 4 ранга";
				case 3: atext = "Бандит 3 ранга";
				case 2: atext = "Бандит 2 ранга";
				case 1: atext = "Бандит 1 ранга";
		}
	}
	if(p_info[playerid][member] == 13)//Коронес
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Бандит";
				case 9: atext = "Бандит 9 ранга";
				case 8: atext = "Бандит 8 ранга";
				case 7: atext = "Бандит 7 ранга";
				case 6: atext = "Бандит 6 ранга";
				case 5: atext = "Бандит 5 ранга";
				case 4: atext = "Бандит 4 ранга";
				case 3: atext = "Бандит 3 ранга";
				case 2: atext = "Бандит 2 ранга";
				case 1: atext = "Бандит 1 ранга";
		}
	}
	if(p_info[playerid][member] == 14)//Вагос
	{
		switch(p_info[playerid][rang])
		{
				case 10: atext = "Бандит";
				case 9: atext = "Бандит 9 ранга";
				case 8: atext = "Бандит 8 ранга";
				case 7: atext = "Бандит 7 ранга";
				case 6: atext = "Бандит 6 ранга";
				case 5: atext = "Бандит 5 ранга";
				case 4: atext = "Бандит 4 ранга";
				case 3: atext = "Бандит 3 ранга";
				case 2: atext = "Бандит 2 ранга";
				case 1: atext = "Бандит 1 ранга";
		}
	}
	if(p_info[playerid][member] == 0) atext = "Гражданский";
	return atext;
}
stock fracSkin(playerid)
{
	//полиция
	if(p_info[playerid][member] == 1 || p_info[playerid][member] == 2 || p_info[playerid][member] == 3)
	{
		switch(p_info[playerid][rang])
		{
		    case 1..2: p_info[playerid][fskin] = 266;
			case 3..4: p_info[playerid][fskin] = 280;
			case 5..6: p_info[playerid][fskin] = 300;
			case 7..8: p_info[playerid][fskin] = 301;
			case 9,10: p_info[playerid][fskin] = 288;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	//фбр
	if(p_info[playerid][member] == 4)
	{
		switch(p_info[playerid][rang])
		{
			case 1..2: p_info[playerid][fskin] = 285;
			case 3..4: p_info[playerid][fskin] = 286;
			case 5..8: p_info[playerid][fskin] = 163;
			case 9,10: p_info[playerid][fskin] = 164;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	//армия
	if(p_info[playerid][member] == 5)
	{
		switch(p_info[playerid][rang])
		{
			case 1..7: p_info[playerid][fskin] = 287;
			case 8..10: p_info[playerid][fskin] = 61;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	//радио
	if(p_info[playerid][member] == 6)
	{
		switch(p_info[playerid][rang])
		{
			case 1..2: p_info[playerid][fskin] = 250;
			case 3..4: p_info[playerid][fskin] = 60;
			case 5..8: p_info[playerid][fskin] = 188;
			case 9: p_info[playerid][fskin] = 223;
			case 10: p_info[playerid][fskin] = 187;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	//мафии
	if(p_info[playerid][member] == 7)
	{
		switch(p_info[playerid][rang])
		{
			case 1..2: p_info[playerid][fskin] = 125;
			case 3..4: p_info[playerid][fskin] = 126;
			case 5..8: p_info[playerid][fskin] = 112;
			case 9: p_info[playerid][fskin] = 272;
			case 10: p_info[playerid][fskin] = 272;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	if(p_info[playerid][member] == 8)
	{
		switch(p_info[playerid][rang])
		{
			case 1..2: p_info[playerid][fskin] = 127;
			case 3..4: p_info[playerid][fskin] = 113;
			case 5..8: p_info[playerid][fskin] = 124;
			case 9: p_info[playerid][fskin] = 126;
			case 10: p_info[playerid][fskin] = 46;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	if(p_info[playerid][member] == 9)
	{
		switch(p_info[playerid][rang])
		{
			case 1..2: p_info[playerid][fskin] = 121;
			case 3..4: p_info[playerid][fskin] = 122;
			case 5..8: p_info[playerid][fskin] = 123;
			case 9: p_info[playerid][fskin] = 117;
			case 10: p_info[playerid][fskin] = 120;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	//банды
	if(p_info[playerid][member] == 10)
	{
		switch(p_info[playerid][rang])
		{
			case 1..4: p_info[playerid][fskin] = 105;
			case 5..8: p_info[playerid][fskin] = 106;
			case 9,10: p_info[playerid][fskin] = 107;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	if(p_info[playerid][member] == 11)
	{
		switch(p_info[playerid][rang])
		{
			case 1..4: p_info[playerid][fskin] = 103;
			case 5..8: p_info[playerid][fskin] = 102;
			case 9,10: p_info[playerid][fskin] = 104;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}

	if(p_info[playerid][member] == 12)
	{
		switch(p_info[playerid][rang])
		{
		    case 1..4: p_info[playerid][fskin] = 175;
			case 5..8: p_info[playerid][fskin] = 173;
			case 9,10: p_info[playerid][fskin] = 174;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	if(p_info[playerid][member] == 13)
	{
		switch(p_info[playerid][rang])
		{
			case 1..2: p_info[playerid][fskin] = 114;
			case 3..4: p_info[playerid][fskin] = 114;
			case 5..8: p_info[playerid][fskin] = 116;
			case 9,10: p_info[playerid][fskin] = 115;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	if(p_info[playerid][member] == 14)
	{
		switch(p_info[playerid][rang])
		{
			case 1..4: p_info[playerid][fskin] = 109;
			case 5..8: p_info[playerid][fskin] = 110;
			case 9,10: p_info[playerid][fskin] = 108;
		}
		SetPlayerSkin(playerid,p_info[playerid][fskin]);
		return 1;
	}
	return 1<2;
}
forward SpeedoUpdate(playerid);
public SpeedoUpdate(playerid)
{
	new Float:x,Float:y,Float:z,string[24],Float:hp;
	GetVehicleHealth(GetPlayerVehicleID(playerid),hp);
	GetVehicleVelocity(GetPlayerVehicleID(playerid),x,y,z);
	format(string,sizeof(string), "%d",floatround(floatsqroot(((x*x)+(y*y))+(z*z))*156.666667));
	PlayerTextDrawSetString(playerid, speedTD[playerid][3],string);
	format(string,sizeof(string),"%d",floatround(hp));
	PlayerTextDrawSetString(playerid, speedTD[playerid][4],string);
	format(string,sizeof(string)," %d",fuel_car[GetPlayerVehicleID(playerid)]);
	PlayerTextDrawSetString(playerid, speedTD[playerid][5],string);
	return 1;
}
stock PriceCar(vehicleid)
{
	new buycena;
	switch(GetVehicleModel(vehicleid))
	{
	case  466: buycena = 16600; case  542: buycena = 15100; case  492: buycena = 19000;
	case  517: buycena = 18600; case  516: buycena = 20350; case  467: buycena = 22300;
	case  600: buycena = 19500; case  549: buycena = 21000; case  529: buycena = 25000;
	case  404: buycena = 13400; case 474: buycena = 16500; case  410: buycena = 20410;
	case  422: buycena = 19900; case  439: buycena = 31400; case  479: buycena = 27000;
	case  535: buycena = 28900; case  543: buycena = 14500; case  575: buycena = 27400;
	case  545: buycena = 23900; case  411: buycena = 848000; case  560: buycena = 356400;
	case  562: buycena = 212300; case  579: buycena = 311900; case  429: buycena = 549300;
	case  415: buycena = 600100; case  559: buycena = 289000; case  581: buycena = 113000;
	case  506: buycena = 431000; case  402: buycena = 234900; case  541: buycena = 705000;
	case  522: buycena = 560400; case  481: buycena = 12600; case  510: buycena = 15600; case  463: buycena = 39700;
	case  586: buycena = 72000; case  468: buycena = 51000; case  451: buycena = 790000;  case  521: buycena = 152400;
	}
	return buycena;
}
//автошкола
stock AutoTest(playerid, number)
{
	switch(number)
	{//21041 //правильные ответы по listitem
	    case 0: ShowPlayerDialog(playerid,27,DIALOG_STYLE_LIST,"Какие действия вы примите во время тумана?","Отключу фары\nБуду ездить без правил\nВключу противотуманные фары","Ответить","");
    	case 1: ShowPlayerDialog(playerid,28,DIALOG_STYLE_LIST,"Что означает знак '60' в красном кругу","Трасса номер 60\nРазрешенная скорость 60км/ч\nБлижайшая заправка через 60 метров","Ответить","");
    	case 2: ShowPlayerDialog(playerid,29,DIALOG_STYLE_LIST,"Ограничение скорости движения по городу:","60 км/ч\n120 км/ч","Ответить","");
    	case 3: ShowPlayerDialog(playerid,30,DIALOG_STYLE_LIST,"Чтобы заправится на заправочной станции надо:","Вызвать механика\nПроехать на полной скорости успев ввести команду /fill\nПосигналить персоналу\nКричать о том чтоб вас заправили\nЗаглушить двигатель и ввести команду /fill\nНи один из вариантов не подходит","Ответить","");
		case 4: ShowPlayerDialog(playerid,31,DIALOG_STYLE_LIST,"При виде автомобиля с включеной сиреной вы:","Продолжите движение с нормальной скоростью\nПродолжите движение снизив скорость\nУвеличите скорость\nПопытаетесь скрыться\nСреди предложенных вариантов нет правильного","Ответить","");
	}
	return 1;
}
stock AUTSH(playerid)
{
		new string[156];
		if(GetPVarInt(playerid,"FAIL") >= 2) SendClientMessage(playerid, error,"К сожалению, вы провалили теорию. Экзамен окончен!");
		else
		{
		    SetPVarInt(playerid, "EKZAMEN",1411);
		    f(string, "{ffffff}Количество правильных ответов: %d\nПоздравляем!\nВы получили допуск к городу!\nДля перехода к практике нажмите 'Далее'",GetPVarInt(playerid,"ACCEPT"));
			return ShowPlayerDialog(playerid, 25, 0, "Результаты теории", string, "Далее", "");
		}
		SetPVarInt(playerid,"FAIL",0);
		SetPVarInt(playerid,"ACCEPT",0);
	 	return 1;
}

stock GetZonaName  ( Float: x,  Float: y )
{
    for ( new i = 0; i != sizeof ( gSAZones ); i++ )
    {
        if ( x >= gSAZones[i][SAZONE_AREA][0] && x <= gSAZones[i][SAZONE_AREA][3] && y >= gSAZones[i][SAZONE_AREA][1] && y <= gSAZones[i][SAZONE_AREA][4]) return i;
    }
    return 1;
}
stock GetCityName ( Float: x,  Float: y)
{
    for ( new i = 0; i != sizeof ( gSAZonesCity ); i++ )
    {
        if ( x >= gSAZonesCity[i][SAZONE_AREA][0] && x <= gSAZonesCity[i][SAZONE_AREA][3] && y >= gSAZonesCity[i][SAZONE_AREA][1] && y <= gSAZonesCity[i][SAZONE_AREA][4] ) return i;
    }
    return 1;
}

stock _@3DTEXT() //обновление 3д текстов
{
    new texts[134];
	format(texts,sizeof(texts),"\n"A"Металл: "W"%d кг.\n"A"Патроны: "W"%d шт.",army_material,army_patr);
	UpdateDynamic3DTextLabelText(sv_3d,-1,texts);
	//
	format(texts,sizeof(texts),""A"Боеприпасы: "W"%d ящиков",avia_boe);
	UpdateDynamic3DTextLabelText(avia_3d,-1,texts);
	//
	
	format(texts,sizeof(texts),""W"Готовых продуктов: "I"%d шт\n"W"Топливо: "I"%d л.\n\n"W"Загрузить продукты/топливо: /load",zprod,zfuel);
	UpdateDynamic3DTextLabelText(factory_3D,white, texts);
	
	format(texts,sizeof(texts),"Склад:\n"W"Готовых продуктов: "I"%d шт.\n"W"Топливо: "I"%d л.",zprod,zfuel);
	UpdateDynamic3DTextLabelText(factory_int_3D, white, texts);
	
	//
	
	format(texts,sizeof(texts),"Склад Русской мафии:\n\n"W"Наркотики:"I" %d гр.\n"W"Деньги: "I"%d$",store_mafia[0][0],store_mafia[0][1]);
	UpdateDynamic3DTextLabelText(store_m3D[0], info, texts);

	format(texts,sizeof(texts),"Склад La Cosa Nostra:\n\n"W"Наркотики:"I" %d гр.\n"W"Деньги: "I"%d$",store_mafia[1][0],store_mafia[1][1]);
	UpdateDynamic3DTextLabelText(store_m3D[1], info, texts);

	format(texts,sizeof(texts),"Склад Yakuza:\n\n"W"Наркотики:"I" %d гр.\n"W"Деньги: "I"%d$",store_mafia[2][0],store_mafia[2][1]);
	UpdateDynamic3DTextLabelText(store_m3D[2], info, texts);
	
	//
	format(texts,sizeof(texts),"Склад Grove St.:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[0][0],s_band[0][1],s_band[0][2]);
	UpdateDynamic3DTextLabelText(store_b3D[0], info, texts);
	format(texts,sizeof(texts),"Склад E.S Ballas:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[1][0],s_band[1][1],s_band[1][2]);
	UpdateDynamic3DTextLabelText(store_b3D[1], info, texts);
	format(texts,sizeof(texts),"Склад The Rifa:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[2][0],s_band[2][1],s_band[2][2]);
	UpdateDynamic3DTextLabelText(store_b3D[2], info, texts);
	format(texts,sizeof(texts),"Склад El Corona:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[3][0],s_band[3][1],s_band[3][2]);
	UpdateDynamic3DTextLabelText(store_b3D[3], info, texts);
	format(texts,sizeof(texts),"Склад L.S Vagos:\n"W"Металл: "I"%d кг\n"W"Патроны: "I"%d шт.\n"W"Наркотики:"I" %d гр.",s_band[4][0],s_band[4][1],s_band[4][2]);
	UpdateDynamic3DTextLabelText(store_b3D[4], info, texts);
}
MENU_BIZ(playerid, para)
{
	new string[144],str[13];
	switch(para)
	{
		case 1:format(string, sizeof(string), "Мобильный телефон\t500$\nСим-карта (Изменить номер)\t300$\nАптечка (2 шт.)\t150$\nМаска\t300$"),SetPVarInt(playerid, "biz_numb_menu",1);//Супермаркет
	    case 2: 
		{
			SetPlayerCameraPos(playerid, 208.6179, -34.7552, 1002.0765+0.4);
			SetPlayerCameraLookAt(playerid, 209.2358, -33.9708, 1001.9014+0.4);
            SetPlayerPos(playerid,210.4674,-33.0304,1001.9297);
            SetPlayerFacingAngle(playerid,123.6620);
            for(new i; i<5; i++) TextDrawShowForPlayer(playerid, skin_price[playerid][i]);
            SelectTextDraw(playerid,0x1C9AD8AA);
            SendClientMessage(playerid,error,"Используйте меню-панель для выбора одежды.");
            SetPlayerSkin(playerid, (p_info[playerid][sex] == 1)?(skinBuyMan[GetPVarInt(playerid, "@clothes")][0]):(skinBuyMale[GetPVarInt(playerid, "@clothes")][0]));
            format(str,sizeof(str),"~g~%d$",(p_info[playerid][sex] == 1)?(skinBuyMan[GetPVarInt(playerid, "@clothes")][1]):(skinBuyMale[GetPVarInt(playerid, "@clothes")][1]));
			TextDrawSetString(skin_price[playerid][4],str);
		}
	    case 3:format(string, sizeof(string), "Пиво\t50$\nВино\t60$\nТекилла\t100$\nВодка\t120$"),SetPVarInt(playerid, "biz_numb_menu",3);//Бар
	}
    return ShowPlayerDialog(playerid,43, DIALOG_STYLE_TABLIST, "{6495ED}Покупка товаров", string, "Купить","Отмена");
}
forward factoryFinish(i);
public factoryFinish(i)
{
    TogglePlayerControllable(i, 1);
	DestroyObject(obje[i]);
	SetPVarInt(i, "kgfor",0);
	SetPVarInt(i,"zav", 0);
	if(IsPlayerAttachedObjectSlotUsed(i,1)) RemovePlayerAttachedObject(i,1);
	if(IsPlayerAttachedObjectSlotUsed(i,2)) RemovePlayerAttachedObject(i,2);
	ApplyAnimation(i,"CARRY","crry_prtial",4.1,1,0,0,1,1);
 	SetPlayerAttachedObject(i, 1 , 1279, 1, 0.062397, 0.453746, 0.000000, 0.000000, 94.689308, 0.000000);
	SetPVarInt(i, "meshokin",1);
}

stock list_delivery(playerid)
{
    new string[944],str[944],num;
    string[0] = EOS;
    str[0] = EOS;
    for(new i; i < 22; i ++) DBizitem[playerid][i] = -1;
    strcat(str,"Заказчик:\tКуда:\tЗаработок:\tСтатус заказа:\n");
    if(GetPlayerVehicleID(playerid) >= carDelivery[0] && GetPlayerVehicleID(playerid) <= carDelivery[1])
    {
	    for(new h = 0; h < totalbiz; h++)
		{
		    if(num<21)
	      	{
				if(b_info[h][_zakaz] == 0) continue;
				if(b_info[h][_tip] == 4) continue;
				else f(string, "%s"W"%s\t%s\t%d$\t%s\n", string, b_info[h][_owner], b_info[h][_name], b_info[h][_zakaz]*6,(b_info[h][_status])?("{BE2D2D}Выполняется"W""):("{42B02C}Свободен"W"")),DBizitem[playerid][num] = h;
				num++;
			}
			else break;
		}
	}
	else if(GetPlayerVehicleID(playerid) >= carGasTanker[0] && GetPlayerVehicleID(playerid) <= carGasTanker[1])
	{
	    for(new h = 0; h < totalbiz; h++)
		{
		    if(num<21)
	      	{
				if(b_info[h][_zakaz] == 0) continue;
				if(b_info[h][_tip] != 4) continue;
				else f(string, "%s"W"%s\t%s\t%d$\t%s\n", string, b_info[h][_owner], b_info[h][_name], b_info[h][_zakaz]*2,(b_info[h][_status])?("{BE2D2D}Выполняется"W""):("{42B02C}Свободен"W"")),DBizitem[playerid][num] = h;
				num++;
            }
			else break;
		}
	}
	strcat(str,string);
	if(num>0)  ShowPlayerDialog(playerid, 51, DIALOG_STYLE_TABLIST_HEADERS, ""W"Заказы", str, "Принять", "Закрыть");
	else SendClientMessage(playerid, error,"Заказов не найдено");
	return 1;
}
stock IsBankomat(playerid)
{
	for(new i=0; i<sizeof(gAtmPoint); i++) if(IsPlayerInRangeOfPoint(playerid, 1.0, gAtmPoint[i][0], gAtmPoint[i][1], gAtmPoint[i][2])) return true;
	return 0;
}


stock arrest(playerid)
{
	if(IsPlayerInRangeOfPoint(playerid, 10.0,-1590.2740,716.2745,-5.24)
	|| IsPlayerInRangeOfPoint(playerid, 10.0,2284.0093,2428.5073,3.2734)
	|| IsPlayerInRangeOfPoint(playerid, 10.0,1568.5825,-1691.8123,5.8906)) return 1;
	return 0;
}

stock cop(playerid){
	 switch(p_info[playerid][member]) {
	 case 1..4: return true; }
	 return false; }
stock gang(playerid) {
	 switch(p_info[playerid][member]) {
	 case 10..14: {
	 return true; } }
	 return false; }
stock mafia(playerid) {
	switch(p_info[playerid][member]) {
	case 7..9: {
	return true; } }
	return false; }
stock gos(playerid) {
	 switch(p_info[playerid][member]) {
	 case 1..6:   return true; }
	 return false; }

stock SendFamilyMessage(family, color, string[])
{
	for(new i=0; i<GetMaxPlayers(); i++)
	{
		if(IsPlayerConnected(i))
		{
			if(p_info[i][member] == family || p_info[i][leader] == family) SendClientMessage(i, color, string);
		}
	}
	return 1;
}
stock GetNearestVehicle(playerid)
{
    for(new i=0; i<MAX_VEHICLES; i++)
	{
        if(GetVehicleModel(i))
        {
            new Float:Xx,Float:Yy,Float:Zz;
            GetVehiclePos(i,Xx,Yy,Zz);
            if(IsPlayerInRangeOfPoint( playerid,3.0,  Xx, Yy, Zz)) return i;
        }
    }
    return -1;
}

stock SetPlayerCuffed(playerid, bool:type)
{
    if(type)
    {
		SetPlayerAttachedObject(playerid, 4, 19418, 6, -0.011, 0.028, -0.022, -15.600, -33.699, -81.700, 0.891, 1.000, 1.168);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CUFFED);
	}
	else
	{
		RemovePlayerAttachedObject(playerid, 4);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
	}
	return true;
}
stock OnPlayerInConvoi(playerid)
{
	new bool:current;
	if(!IsPlayerConnected(GetPVarInt(playerid,"Ved")))
	{
		SetPVarInt(playerid,"Ved",0);
		SendClientMessage(playerid, info, "Конвой: "E"Вы освобождены от конвоя.");
		SetPVarInt(playerid,"Cuff",0);
		SetPVarInt(playerid,"Conv",0);
		TogglePlayerControllable(playerid, true);
		ClearAnimations(playerid);
		return true;
	}
	if(!IsPlayerConnected(playerid)) return SendClientMessage(GetPVarInt(playerid,"Ved"),info, "Конвой: "E"Арестованный вышел из игры. Конвой прекращён.");
	if(GetPVarInt(playerid,"Cuff") == 0)
	{
		SetPVarInt(playerid,"Ved",0);
  		SendClientMessage(GetPVarInt(playerid,"Ved"), info, "Конвой: "E"На арестованном не одеты наручники. Конвой прекращён");
		SetPVarInt(playerid,"Conv",0);
		TogglePlayerControllable(playerid, true);
		ClearAnimations(playerid);
		return true;
	}
	if(IsPlayerInAnyVehicle(playerid))
	{
		SetPVarInt(playerid,"Ved",0);
  		SendClientMessage(GetPVarInt(playerid,"Ved"), info, "Конвой: "E"Арестованный находится в машине. Конвой прекращён");
		SetPVarInt(playerid,"Conv",0);
		TogglePlayerControllable(playerid, false);
		return true;
	}
	if(GetPlayerVirtualWorld(GetPVarInt(playerid,"Ved")) != GetPlayerVirtualWorld(playerid)
	|| GetPlayerInterior(GetPVarInt(playerid,"Ved")) != GetPlayerInterior(playerid))
	{
		new Float:POS[3];
		GetPlayerPos(GetPVarInt(playerid,"Ved"), POS[0], POS[1], POS[2]);
  		SetPlayerPos(playerid, POS[0], POS[1], POS[2]);
  		SetPlayerVirtualWorld(playerid, GetPlayerVirtualWorld(GetPVarInt(playerid,"Ved")));
  		SetPlayerInterior(playerid, GetPlayerInterior(GetPVarInt(playerid,"Ved")));
  		current = true;
	}
	if(distance(playerid, GetPVarInt(playerid,"Ved")) < 0.9)
	{
		SetPlayerAngleToPlayer(playerid, GetPVarInt(playerid,"Ved"));
		TogglePlayerControllable(playerid, false);
	}
	else if(distance(playerid, GetPVarInt(playerid,"Ved")) > 10.0)
	{
	    if(!current)
	    {
			SetPVarInt(playerid,"Ved",0);
	  		SendClientMessage(GetPVarInt(playerid,"Ved"), info, "Конвой: "E"Ты ушёл слишком далеко. Конвой прекращён.");
			SendClientMessage(playerid,info, "Конвой: "E"Твой конвоир ушёл слишком далеко. Конвой прекращён.");
			//SetPlayerCuffed(playerid, true);
			SetPVarInt(playerid,"Conv",0);
			TogglePlayerControllable(playerid, false);
			ClearAnimations(playerid);
		}
		else current = false;
	}
	else
	{
		TogglePlayerControllable(playerid, true);
		SetPlayerAngleToPlayer(playerid, GetPVarInt(playerid,"Ved"));
		ApplyAnimation(playerid, "ped", "WALK_civi", 6.0, 1, 1, 1, 1, 0, 1);
	}
	return true;
}
stock SetPlayerAngleToPlayer(playerid, targetid)
{
	new Float:POS[2][3];
	GetPlayerPos(targetid, POS[0][0], POS[0][1], POS[0][2]);
	GetPlayerPos(playerid, POS[1][0], POS[1][1], POS[1][2]);
	new Float:ANGLE = 180-atan2(POS[1][0]-POS[0][0], POS[1][1]-POS[0][1]);
	SetPlayerFacingAngle(playerid, ANGLE);
	return true;
}
stock distance(playerid, playerid2)
{
	new Float:x1,Float:y1,Float:z1,Float:x2,Float:y2,Float:z2;
	new Float:tmpdis;
	GetPlayerPos(playerid,x1,y1,z1);
	GetPlayerPos(playerid2,x2,y2,z2);
	tmpdis = floatsqroot(floatpower(floatabs(floatsub(x2,x1)),2)+floatpower(floatabs(floatsub(y2,y1)),2)+floatpower(floatabs(floatsub(z2,z1)),2));
	return floatround(tmpdis);
}
stock SendDistanceChat(playerid, Float:range, string[])
{
	new Float:POS[3],Float:radius;
	GetPlayerPos(playerid, POS[0], POS[1], POS[2]);
	for(new i=0; i<GetMaxPlayers(); i++)
	{
		if(IsPlayerConnected(i) && GetPlayerVirtualWorld(playerid) == GetPlayerVirtualWorld(i))
		{
			radius = GetPlayerDistanceFromPoint(i, POS[0], POS[1], POS[2]);
			if(radius < range/16) SendClientMessage(i, 0xD7D7D7FF, string);
			else if(radius < range/8) SendClientMessage(i, 0xCDCDCDFF, string);
			else if(radius < range/4) SendClientMessage(i, 0xC0C0C0FF, string);
			else if(radius < range/2) SendClientMessage(i, 0xB4B4B4FF, string);
			else if(radius < range) SendClientMessage(i, 0xA5A5A5FF, string);
		}
	}
	return true;
}

stock PreloadAnimLib(playerid, animlib[])//Загружаем анимации
{
	ApplyAnimation(playerid,animlib,"null",0.0,0,0,0,0,0);
	return false;
}
stock PreloadAllAnims(playerid)
{
    PreloadAnimLib(playerid,"SWORD");
    PreloadAnimLib(playerid,"SWAT");
	PreloadAnimLib(playerid,"DANCING");
	PreloadAnimLib(playerid,"PAULNMAC");
	PreloadAnimLib(playerid,"PARK");
	PreloadAnimLib(playerid,"CRACK");
	PreloadAnimLib(playerid,"MISC");
	PreloadAnimLib(playerid,"SWEET");
	PreloadAnimLib(playerid,"SPRAYCAN");
	PreloadAnimLib(playerid,"SHOP");
	PreloadAnimLib(playerid,"RYDER");
	PreloadAnimLib(playerid,"RIOT");
	PreloadAnimLib(playerid,"BAR");
	PreloadAnimLib(playerid,"BEACH");
	PreloadAnimLib(playerid,"benchpress");
	PreloadAnimLib(playerid,"BSKTBALL");
	PreloadAnimLib(playerid,"CAMERA");
	PreloadAnimLib(playerid,"CAR");
	PreloadAnimLib(playerid,"CAR_CHAT");
	PreloadAnimLib(playerid,"COP_AMBIENT");
	PreloadAnimLib(playerid,"GHANDS");
	PreloadAnimLib(playerid,"GRAFFITI");
	PreloadAnimLib(playerid,"GRAVEYARD");
	PreloadAnimLib(playerid,"INT_HOUSE");
	PreloadAnimLib(playerid,"INT_OFFICE");
	PreloadAnimLib(playerid,"LOWRIDER");
	PreloadAnimLib(playerid,"MEDIC");
	PreloadAnimLib(playerid,"BOMBER");
	PreloadAnimLib(playerid,"SHOP");
	PreloadAnimLib(playerid,"BEACH");
	PreloadAnimLib(playerid,"SMOKING");
	PreloadAnimLib(playerid,"FOOD");
	PreloadAnimLib(playerid,"ON_LOOKERS");
	PreloadAnimLib(playerid,"DEALER");
	PreloadAnimLib(playerid,"CRACK");
	PreloadAnimLib(playerid,"CARRY");
	PreloadAnimLib(playerid,"COP_AMBIENT");
	PreloadAnimLib(playerid,"PARK");
	PreloadAnimLib(playerid,"INT_HOUSE");
	PreloadAnimLib(playerid,"FOOD");
	PreloadAnimLib(playerid,"GANGS");
	PreloadAnimLib(playerid,"KISSING");
	PreloadAnimLib(playerid,"CAR_CHAT");
	PreloadAnimLib(playerid,"DODGE");
	PreloadAnimLib(playerid,"MD_END");
	PreloadAnimLib(playerid,"MUSCULAR");
	PreloadAnimLib(playerid,"MD_CHASE");
	PreloadAnimLib(playerid,"FAT");
	PreloadAnimLib(playerid,"DANCING");
	PreloadAnimLib(playerid,"SCRATCHING");
	PreloadAnimLib(playerid,"GYMNASIUM");
	PreloadAnimLib(playerid,"JST_BUISNESS");
	PreloadAnimLib(playerid,"OTB");
	PreloadAnimLib(playerid,"PLAYIDLES");
	PreloadAnimLib(playerid,"ROB_BANK");
	PreloadAnimLib(playerid,"PED");   
	PreloadAnimLib(playerid,"UZI");
}
stock split(const strsrc[], strdest[][], delimiter)
{
	new i, li,aNum,len;
	while(i <= strlen(strsrc))
	{
		if(strsrc[i]==delimiter || i==strlen(strsrc))
		{
			len = strmid(strdest[aNum], strsrc, li, i, 128);
			strdest[aNum][len] = 0; li = i+1; aNum++;
		}
		i++;
	}
	return 1;
}
stock TimestampToDate(timestamp)
{
    new year = 1970, day = 1, month = 1, hour = 0, mins = 0, sec = 0;
    new days_of_month[12] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
    new time = timestamp;
    while(time > GetSecondCountInYear(year)){time -= GetSecondCountInYear(year); year++;}
    if(IsVis(year)) days_of_month[1] = 29;
    while(time > days_of_month[month - 1] * 86400) {time -= days_of_month[month - 1] * 86400; month++;}
    while(time > 86400) {time -= 86400; day++;}
    while(time > 3600) {time -= 3600; hour++;}
    while(time > 60) {time -= 60; mins++;}
    sec = time;
    return year,month,day;
}

stock IsVis(dYear)
{
    if((dYear % 4 == 0 && dYear % 100 != 0) || dYear % 400 == 0) return true;
    else return false;
}

stock GetSecondCountInYear(dYear)
{
    if(IsVis(dYear)) return 31622400;
    else return 31536000;
}
stock get_name(playerid) { new name@[MAX_PLAYER_NAME]; GetPlayerName(playerid, name@, sizeof(name@)); return name@; }
stock SendAdminMessage(color, string[]) { foreach(Player,i) if(p_info[i][admin] > 0) SendClientMessage(i, color, string); return 1; }

